question,query,qsq_list_idx,question_idx,answer
At what temperature is HKUST-1 synthesized?,"MATCH (s:Synthesis_Procedure)-[:has_publication]->(:Publication)<-[:has_publication]-(m:MOF) MATCH (s)-[:has_temperature]->(t:Synthesis_Temperature) WHERE s.name CONTAINS 'HKUST-1' RETURN t.Value, t. Unit",106,3,"[{""t.Value"": 343.15, ""t. Unit"": ""K1.0""}, {""t.Value"": 343.15, ""t. Unit"": ""K1.0""}, {""t.Value"": 275.15, ""t. Unit"": ""K1.0""}]"
Is the structure of MOF 'ZIF-1' three-dimensional?,"MATCH (m:MOF) WHERE m.name CONTAINS 'ZIF-1' RETURN m.refcode, m.name, m.has_3d_structure",17,1,"[{""m.refcode"": ""BIHQAM"", ""m.name"": ""MOZIF-1"", ""m.has_3d_structure"": true}, {""m.refcode"": ""VEJYEP"", ""m.name"": ""ZIF-1"", ""m.has_3d_structure"": true}]"
Which RCSR code is linked to the most frequent MOF topology?,"MATCH (m:MOF)-[r:has_topology]->(c:Topology) RETURN c.rcsr_code, count(c) as freq ORDER BY freq DESC LIMIT 1",71,3,"[{""c.rcsr_code"": ""UNKNOWN"", ""freq"": 2960}]"
What is the specific temperature employed in the creation of HKUST-1?,"MATCH (s:Synthesis_Procedure)-[:has_publication]->(:Publication)<-[:has_publication]-(m:MOF) MATCH (s)-[:has_temperature]->(t:Synthesis_Temperature) WHERE s.name CONTAINS 'HKUST-1' RETURN t.Value, t. Unit",106,1,"[{""t.Value"": 343.15, ""t. Unit"": ""K1.0""}, {""t.Value"": 343.15, ""t. Unit"": ""K1.0""}, {""t.Value"": 275.15, ""t. Unit"": ""K1.0""}]"
Count the total number of journals that have published articles on HKUST-1.,"MATCH (m:MOF {name: ""HKUST-1""})-[:has_publication]->(p:Publication)-[:in_journal]->(j:Journal) RETURN count(distinct j);",159,1,"[{""count(distinct j)"": 2}]"
What is the metal precursor used in the synthesis of MOF-3?,MATCH (m:MOF)-[:has_publication]->(:Publication)<-[:has_publication]-(s:Synthesis_Procedure)-[:has_metal_precursor]->(mp:Synthesis_Metal_Precursor) WHERE m.name CONTAINS 'MOF-3' RETURN mp.name,81,0,"[{""mp.name"": ""GWMOF-3""}, {""mp.name"": ""praseodymium chloride heptahydrate""}, {""mp.name"": ""PrCl3\u22c57H2O""}, {""mp.name"": ""GWMOF-3""}, {""mp.name"": ""praseodymium chloride heptahydrate""}, {""mp.name"": ""PrCl3\u22c57H2O""}, {""mp.name"": ""Zn(NO3)2\u22c56H2O""}, {""mp.name"": ""Cd(NO3)2\u22c54H2O""}, {""mp.name"": ""Cd(NO3)2\u22c54H2O""}]"
Where was the information about MOFs 'HKUST-1' obtained?,"MATCH (m:MOF) WHERE m.name CONTAINS 'HKUST-1' RETURN m.refcode, m.name, m.source",50,2,"[{""m.refcode"": ""DOTSOV42"", ""m.name"": ""HKUST-1"", ""m.source"": """"}, {""m.refcode"": ""FIQCEN"", ""m.name"": ""HKUST-1|Teaching Subset: MOFs"", ""m.source"": """"}, {""m.refcode"": ""FUNGAZ"", ""m.name"": ""HKUST-1 (as synthesised)"", ""m.source"": """"}, {""m.refcode"": ""LUDLED"", ""m.name"": ""HKUST-1"", ""m.source"": """"}, {""m.refcode"": ""WULJUJ"", ""m.name"": ""HKUST-1 0.56(dideuteroacetylene)"", ""m.source"": """"}]"
What is the deposition number of the MOFs 'HKUST-1' in the database?,"MATCH (m:MOF) WHERE m.name CONTAINS 'HKUST-1' RETURN m.refcode, m.name, m.deposition_number",52,0,"[{""m.refcode"": ""DOTSOV42"", ""m.name"": ""HKUST-1"", ""m.deposition_number"": 755080.0}, {""m.refcode"": ""FIQCEN"", ""m.name"": ""HKUST-1|Teaching Subset: MOFs"", ""m.deposition_number"": 112954.0}, {""m.refcode"": ""FUNGAZ"", ""m.name"": ""HKUST-1 (as synthesised)"", ""m.deposition_number"": 1950115.0}, {""m.refcode"": ""LUDLED"", ""m.name"": ""HKUST-1"", ""m.deposition_number"": 943962.0}, {""m.refcode"": ""WULJUJ"", ""m.name"": ""HKUST-1 0.56(dideuteroacetylene)"", ""m.deposition_number"": 755081.0}]"
What is the MOF 'IRMOF' sourced from?,"MATCH (m:MOF) WHERE m.name CONTAINS 'IRMOF' RETURN m.refcode, m.name, m.source",25,3,"[{""m.refcode"": ""GINYAG"", ""m.name"": ""Ni-IRMOF-74-II"", ""m.source"": """"}, {""m.refcode"": ""GINYIO"", ""m.name"": ""Ni-IRMOF-74-III"", ""m.source"": """"}, {""m.refcode"": ""GINYOU"", ""m.name"": ""Ni-IRMOF-74-IV"", ""m.source"": """"}, {""m.refcode"": ""GINYUA"", ""m.name"": ""Ni-IRMOF-74-V"", ""m.source"": """"}, {""m.refcode"": ""HOLQAC"", ""m.name"": ""\u03b1-IRMOF-3-AMPh"", ""m.source"": """"}, {""m.refcode"": ""NODTEH"", ""m.name"": ""IRMOF-23terp"", ""m.source"": """"}, {""m.refcode"": ""NODTIL"", ""m.name"": ""IRMOF-25terPh"", ""m.source"": """"}, {""m.refcode"": ""NODTOR"", ""m.name"": ""IRMOF-pentane"", ""m.source"": """"}, {""m.refcode"": ""NUVYEK"", ""m.name"": ""IRMOF-61"", ""m.source"": """"}, {""m.refcode"": ""NUVYIO"", ""m.name"": ""IRMOF-62"", ""m.source"": """"}, {""m.refcode"": ""PIWLIT"", ""m.name"": ""IRMOF-9"", ""m.source"": """"}, {""m.refcode"": ""RAVVUH"", ""m.name"": ""IRMOF-74-II"", ""m.source"": """"}, {""m.refcode"": ""RAVWAO"", ""m.name"": ""IRMOF-74-III"", ""m.source"": """"}, {""m.refcode"": ""RAVWES"", ""m.name"": ""IRMOF-74-IV"", ""m.source"": """"}, {""m.refcode"": ""RAVWOC"", ""m.name"": ""IRMOF-74-V-hex"", ""m.source"": """"}, {""m.refcode"": ""RAVWUI"", ""m.name"": ""IRMOF-74-VI"", ""m.source"": """"}, {""m.refcode"": ""RAVXAP"", ""m.name"": ""IRMOF-74-VII"", ""m.source"": """"}, {""m.refcode"": ""RAVXET"", ""m.name"": ""IRMOF-74-VI-oeg"", ""m.source"": """"}, {""m.refcode"": ""RAVXIX"", ""m.name"": ""IRMOF-74-IX"", ""m.source"": """"}, {""m.refcode"": ""RAVXOD"", ""m.name"": ""IRMOF-74-XI"", ""m.source"": """"}, {""m.refcode"": ""RUTPAY01"", ""m.name"": ""IRMOF-77"", ""m.source"": """"}, {""m.refcode"": ""WORKUL"", ""m.name"": ""INT-IRMOF-8-C"", ""m.source"": """"}, {""m.refcode"": ""WORLAS"", ""m.name"": ""INT-IRMOF-8-B"", ""m.source"": """"}]"
What is the specific disorder information associated with the MOFs named 'HKUST-1'?,"MATCH (m:MOF) WHERE m.name CONTAINS 'HKUST-1' RETURN m.refcode, m.name, m.disorder_details",38,3,"[{""m.refcode"": ""DOTSOV42"", ""m.name"": ""HKUST-1"", ""m.disorder_details"": """"}, {""m.refcode"": ""FIQCEN"", ""m.name"": ""HKUST-1|Teaching Subset: MOFs"", ""m.disorder_details"": """"}, {""m.refcode"": ""FUNGAZ"", ""m.name"": ""HKUST-1 (as synthesised)"", ""m.disorder_details"": ""The MASK/OLEX2 program was used to model some disordered solvent.""}, {""m.refcode"": ""LUDLED"", ""m.name"": ""HKUST-1"", ""m.disorder_details"": ""Disordered solvent molecules were not modelled and the disordered density was taken into account using the SQUEEZE/PLATON procedure.""}, {""m.refcode"": ""WULJUJ"", ""m.name"": ""HKUST-1 0.56(dideuteroacetylene)"", ""m.disorder_details"": ""The dideuteroacetylene molecule is disordered by symmetry.""}]"
Which MOF has the most number of authors in its publications?,"MATCH (m:MOF)-[:has_publication]->(p:Publication)-[:has_author]->(a:Author) WITH m, count(distinct a) as numAuth RETURN m.refcode, numAuth ORDER BY numAuth DESC LIMIT 1;",158,0,"[{""m.refcode"": ""JOYKUF"", ""numAuth"": 26}]"
Could you provide the remarks or comments associated with the MOFs named 'HKUST-1'?,"MATCH (m:MOF) WHERE m.name CONTAINS 'HKUST-1' RETURN m.refcode, m.name, m.remarks",39,1,"[{""m.refcode"": ""DOTSOV42"", ""m.name"": ""HKUST-1"", ""m.remarks"": """"}, {""m.refcode"": ""FIQCEN"", ""m.name"": ""HKUST-1|Teaching Subset: MOFs"", ""m.remarks"": ""Additional water molecules in the pore channels were not directly located""}, {""m.refcode"": ""FUNGAZ"", ""m.name"": ""HKUST-1 (as synthesised)"", ""m.remarks"": """"}, {""m.refcode"": ""LUDLED"", ""m.name"": ""HKUST-1"", ""m.remarks"": """"}, {""m.refcode"": ""WULJUJ"", ""m.name"": ""HKUST-1 0.56(dideuteroacetylene)"", ""m.remarks"": """"}]"
Which IRMOF MOFs belong to the Sohncke space group?,"MATCH (m:MOF) WHERE (m.name CONTAINS 'IRMOF') and (m.sohncke_space_group = 'Yes') RETURN m.refcode, m.name, m.sohncke_space_group",12,1,"[{""m.refcode"": ""GINYOU"", ""m.name"": ""Ni-IRMOF-74-IV"", ""m.sohncke_space_group"": ""Yes""}, {""m.refcode"": ""GINYUA"", ""m.name"": ""Ni-IRMOF-74-V"", ""m.sohncke_space_group"": ""Yes""}, {""m.refcode"": ""NUVYIO"", ""m.name"": ""IRMOF-62"", ""m.sohncke_space_group"": ""Yes""}, {""m.refcode"": ""RAVWES"", ""m.name"": ""IRMOF-74-IV"", ""m.sohncke_space_group"": ""Yes""}, {""m.refcode"": ""RAVWUI"", ""m.name"": ""IRMOF-74-VI"", ""m.sohncke_space_group"": ""Yes""}, {""m.refcode"": ""RAVXAP"", ""m.name"": ""IRMOF-74-VII"", ""m.sohncke_space_group"": ""Yes""}, {""m.refcode"": ""RAVXIX"", ""m.name"": ""IRMOF-74-IX"", ""m.sohncke_space_group"": ""Yes""}, {""m.refcode"": ""RAVXOD"", ""m.name"": ""IRMOF-74-XI"", ""m.sohncke_space_group"": ""Yes""}]"
What is the symbol used to represent the synthesis procedure for MOF-3?,MATCH (m:MOF)-[:has_publication]->(:Publication)<-[:has_publication]-(s:Synthesis_Procedure) WHERE m.name CONTAINS 'MOF-3' RETURN s.symbol,80,0,"[{""s.symbol"": ""[Pr2(C6H8O4)3(H2O)2]\u22c5C10H8N2""}, {""s.symbol"": """"}, {""s.symbol"": ""2""}, {""s.symbol"": ""1""}, {""s.symbol"": ""3""}]"
Which MOF employs the most diverse set of organic linkers in its synthesis?,"MATCH (m1:MOF)-[:has_organicLinker]->(ol1:Organic_Linker) RETURN COUNT(m1), ol1.name ORDER BY count(m1) DESC LIMIT 1",149,2,"[{""COUNT(m1)"": 510, ""ol1.name"": ""[O-]C(=O)c1cc([O])c(cc1[O])C(=O)[O-]""}]"
What is the RCSR code for the most common MOF topology?,"MATCH (m:MOF)-[r:has_topology]->(c:Topology) RETURN c.rcsr_code, count(c) as freq ORDER BY freq DESC LIMIT 1",71,1,"[{""c.rcsr_code"": ""UNKNOWN"", ""freq"": 2960}]"
What is the value of the property utilized in MOF-3's synthesis?,"MATCH (m:MOF)-[:has_publication]->(:Publication)<-[:has_publication]-(s:Synthesis_Procedure)-[:has_property]->(sp:Synthesis_Property) WHERE m.name CONTAINS 'MOF-3' RETURN sp.value, sp.unit",91,2,"[{""sp.value"": ""25"", ""sp.unit"": ""%1.0""}, {""sp.value"": ""4.99"", ""sp.unit"": ""%1.0""}, {""sp.value"": ""53"", ""sp.unit"": ""%1.0""}, {""sp.value"": ""57"", ""sp.unit"": ""%1.0""}, {""sp.value"": ""46"", ""sp.unit"": ""%1.0""}]"
"How many atoms are associated with the MOF that has a Space_Group with the name ""P6/mmm"" and a name that contains ""IRMOF""?","MATCH (m:MOF)-[:has_spaceGroup]->(sg:Space_Group {name: ""P6/mmm""}), (m)-[:has_atom]->(a:Atom) WHERE m.name CONTAINS 'IRMOF' RETURN count(distinct a);",153,0,"[{""count(distinct a)"": 0}]"
What is the source of a MOF 'IRMOF'?,"MATCH (m:MOF) WHERE m.name CONTAINS 'IRMOF' RETURN m.refcode, m.name, m.source",25,0,"[{""m.refcode"": ""GINYAG"", ""m.name"": ""Ni-IRMOF-74-II"", ""m.source"": """"}, {""m.refcode"": ""GINYIO"", ""m.name"": ""Ni-IRMOF-74-III"", ""m.source"": """"}, {""m.refcode"": ""GINYOU"", ""m.name"": ""Ni-IRMOF-74-IV"", ""m.source"": """"}, {""m.refcode"": ""GINYUA"", ""m.name"": ""Ni-IRMOF-74-V"", ""m.source"": """"}, {""m.refcode"": ""HOLQAC"", ""m.name"": ""\u03b1-IRMOF-3-AMPh"", ""m.source"": """"}, {""m.refcode"": ""NODTEH"", ""m.name"": ""IRMOF-23terp"", ""m.source"": """"}, {""m.refcode"": ""NODTIL"", ""m.name"": ""IRMOF-25terPh"", ""m.source"": """"}, {""m.refcode"": ""NODTOR"", ""m.name"": ""IRMOF-pentane"", ""m.source"": """"}, {""m.refcode"": ""NUVYEK"", ""m.name"": ""IRMOF-61"", ""m.source"": """"}, {""m.refcode"": ""NUVYIO"", ""m.name"": ""IRMOF-62"", ""m.source"": """"}, {""m.refcode"": ""PIWLIT"", ""m.name"": ""IRMOF-9"", ""m.source"": """"}, {""m.refcode"": ""RAVVUH"", ""m.name"": ""IRMOF-74-II"", ""m.source"": """"}, {""m.refcode"": ""RAVWAO"", ""m.name"": ""IRMOF-74-III"", ""m.source"": """"}, {""m.refcode"": ""RAVWES"", ""m.name"": ""IRMOF-74-IV"", ""m.source"": """"}, {""m.refcode"": ""RAVWOC"", ""m.name"": ""IRMOF-74-V-hex"", ""m.source"": """"}, {""m.refcode"": ""RAVWUI"", ""m.name"": ""IRMOF-74-VI"", ""m.source"": """"}, {""m.refcode"": ""RAVXAP"", ""m.name"": ""IRMOF-74-VII"", ""m.source"": """"}, {""m.refcode"": ""RAVXET"", ""m.name"": ""IRMOF-74-VI-oeg"", ""m.source"": """"}, {""m.refcode"": ""RAVXIX"", ""m.name"": ""IRMOF-74-IX"", ""m.source"": """"}, {""m.refcode"": ""RAVXOD"", ""m.name"": ""IRMOF-74-XI"", ""m.source"": """"}, {""m.refcode"": ""RUTPAY01"", ""m.name"": ""IRMOF-77"", ""m.source"": """"}, {""m.refcode"": ""WORKUL"", ""m.name"": ""INT-IRMOF-8-C"", ""m.source"": """"}, {""m.refcode"": ""WORLAS"", ""m.name"": ""INT-IRMOF-8-B"", ""m.source"": """"}]"
"For the MOF 'MOF-3' that has the smallest value for any synthesis property, what is its organic composition value?",MATCH (m:MOF)-[:has_publication]->(:Publication)<-[:has_publication]-(s:Synthesis_Procedure)-[:has_organic_precursor]->(op:Synthesis_Organic_Precursor)-[:has_composition]->(oc:Organic_Composition) MATCH (s)-[:has_property]->(p:Synthesis_Property) WHERE m.name CONTAINS 'MOF-3' RETURN oc.value ORDER BY p.value ASC LIMIT 1,118,2,"[{""oc.value"": 8.1}]"
"What is the name of the Topology associated with the MOF having a Metal identified as ""Cu"" and a Crystal_System of ""cubic""?","MATCH (m:MOF)-[:has_metal]->(met: Metal {name: ""[Cu]""}), (m)-[:has_crystalSystem]->(cs:Crystal_System {name: ""cubic""}), (m)-[:has_topology]->(t:Topology) RETURN t.rcsr_code;",155,2,"[{""t.rcsr_code"": ""TIMEOUT""}, {""t.rcsr_code"": ""ERROR""}, {""t.rcsr_code"": ""sod""}, {""t.rcsr_code"": ""fcu""}, {""t.rcsr_code"": ""TIMEOUT""}, {""t.rcsr_code"": ""rho""}, {""t.rcsr_code"": ""lcv""}, {""t.rcsr_code"": ""ctn""}, {""t.rcsr_code"": ""lcv""}, {""t.rcsr_code"": ""sod""}, {""t.rcsr_code"": ""UNKNOWN""}, {""t.rcsr_code"": ""utc""}, {""t.rcsr_code"": ""TIMEOUT""}, {""t.rcsr_code"": ""lcv-f""}, {""t.rcsr_code"": ""gar""}, {""t.rcsr_code"": ""ERROR""}, {""t.rcsr_code"": ""TIMEOUT""}, {""t.rcsr_code"": ""met""}, {""t.rcsr_code"": ""TIMEOUT""}, {""t.rcsr_code"": ""the""}, {""t.rcsr_code"": ""met""}, {""t.rcsr_code"": ""nbo""}, {""t.rcsr_code"": ""TIMEOUT""}, {""t.rcsr_code"": ""UNKNOWN""}]"
What are the MOFs that possess the metals found in MOF-5?,"MATCH (m1:MOF {name:'MOF-5'})-[p1:has_metal]-(t1:Metal)-[p2:has_metal]-(m2:MOF) RETURN m2.refcode, m2.name LIMIT 25",1,3,"[{""m2.refcode"": ""UWAFUU"", ""m2.name"": """"}, {""m2.refcode"": ""BUKTAE"", ""m2.name"": """"}, {""m2.refcode"": ""UWAGAB04"", ""m2.name"": """"}, {""m2.refcode"": ""OLOGEC"", ""m2.name"": ""NJU-Bai2""}, {""m2.refcode"": ""SAHYIK"", ""m2.name"": ""MOF-5|Teaching Subset: MOFs""}, {""m2.refcode"": ""MIBQAR18"", ""m2.name"": ""MOF-5""}, {""m2.refcode"": ""DARQOF"", ""m2.name"": """"}, {""m2.refcode"": ""FANWOI"", ""m2.name"": """"}, {""m2.refcode"": ""YENTUJ"", ""m2.name"": """"}, {""m2.refcode"": ""ETAXUT"", ""m2.name"": """"}, {""m2.refcode"": ""MIBQAR20"", ""m2.name"": ""MOF-5""}, {""m2.refcode"": ""BUKRUW02"", ""m2.name"": """"}, {""m2.refcode"": ""ROLZAV"", ""m2.name"": """"}, {""m2.refcode"": ""HUDMOK"", ""m2.name"": """"}, {""m2.refcode"": ""SAHYOQ03"", ""m2.name"": """"}, {""m2.refcode"": ""PUGSIV"", ""m2.name"": """"}, {""m2.refcode"": ""LEJCIO"", ""m2.name"": """"}, {""m2.refcode"": ""LEJCAG"", ""m2.name"": """"}, {""m2.refcode"": ""MIBQAR14"", ""m2.name"": ""MOF-5""}, {""m2.refcode"": ""MIBQAR06"", ""m2.name"": ""MOF-5""}, {""m2.refcode"": ""HOLQAC"", ""m2.name"": ""\u03b1-IRMOF-3-AMPh""}, {""m2.refcode"": ""MIBQAR07"", ""m2.name"": ""MOF-5""}, {""m2.refcode"": ""MIBQAR16"", ""m2.name"": ""MOF-5""}, {""m2.refcode"": ""LATFOC"", ""m2.name"": """"}, {""m2.refcode"": ""PIWLIT"", ""m2.name"": ""IRMOF-9""}]"
What is the z_prime value of the MOFs 'HKUST-1'?,"MATCH (m:MOF) WHERE m.name CONTAINS 'HKUST-1' RETURN m.refcode, m.name, m.z_prime",41,3,"[{""m.refcode"": ""DOTSOV42"", ""m.name"": ""HKUST-1"", ""m.z_prime"": 0.04}, {""m.refcode"": ""FIQCEN"", ""m.name"": ""HKUST-1|Teaching Subset: MOFs"", ""m.z_prime"": 0.08}, {""m.refcode"": ""FUNGAZ"", ""m.name"": ""HKUST-1 (as synthesised)"", ""m.z_prime"": 0.08}, {""m.refcode"": ""LUDLED"", ""m.name"": ""HKUST-1"", ""m.z_prime"": 0.08}, {""m.refcode"": ""WULJUJ"", ""m.name"": ""HKUST-1 0.56(dideuteroacetylene)"", ""m.z_prime"": 0.04}]"
How is the organic precursor used in the synthesis of MOF-3 represented by SMILES code?,MATCH (m:MOF)-[:has_publication]->(:Publication)<-[:has_publication]-(s:Synthesis_Procedure)-[:has_organic_precursor]->(op:Synthesis_Organic_Precursor) WHERE m.name CONTAINS 'MOF-3' RETURN DISTINCT op.smiles,84,1,"[{""op.smiles"": ""O=C(O)CCCCC(=O)O""}, {""op.smiles"": """"}]"
"Among MOFs named 'MOF-3', what is the greatest duration of any synthesis process?",MATCH (m:MOF)-[:has_publication]->(:Publication)<-[:has_publication]-(s:Synthesis_Procedure)-[:has_operation]->(o:Synthesis_Operation)-[:has_condition]->(c:Synthesis_Operation_Condition) WHERE (m.name CONTAINS 'MOF-3') and (c.Property='Time') WITH toFloat(c.Value) as val RETURN max(val),116,2,"[{""max(val)"": 72.0}]"
Which 5 organic linkers are typically used to fabricate MOFs?,"MATCH (m:MOF)-[r:has_organicLinker]->(c:Organic_Linker) RETURN c.name, count(c) as freq ORDER BY freq DESC LIMIT 5",70,2,"[{""c.name"": ""[O-]C(=O)c1cc([O])c(cc1[O])C(=O)[O-]"", ""freq"": 510}, {""c.name"": ""[O-]C(=O)c1ccc(cc1)C(=O)[O-]"", ""freq"": 383}, {""c.name"": ""[O-]C(=O)c1cc(cc(c1)C(=O)[O-])C(=O)[O-]"", ""freq"": 272}, {""c.name"": ""[O-]C=O"", ""freq"": 259}, {""c.name"": ""[O-]C(=O)C(=O)[O-]"", ""freq"": 245}]"
Give me the volume of the unit cell for MOF 'IRMOF'.,"MATCH (m:MOF) WHERE m.name CONTAINS 'IRMOF' RETURN m.refcode, m.name, m.cell_volume",19,3,"[{""m.refcode"": ""GINYAG"", ""m.name"": ""Ni-IRMOF-74-II"", ""m.cell_volume"": 7830.333812081704}, {""m.refcode"": ""GINYIO"", ""m.name"": ""Ni-IRMOF-74-III"", ""m.cell_volume"": 12437.013749172813}, {""m.refcode"": ""GINYOU"", ""m.name"": ""Ni-IRMOF-74-IV"", ""m.cell_volume"": 17970.850545481026}, {""m.refcode"": ""GINYUA"", ""m.name"": ""Ni-IRMOF-74-V"", ""m.cell_volume"": 28277.205833670298}, {""m.refcode"": ""HOLQAC"", ""m.name"": ""\u03b1-IRMOF-3-AMPh"", ""m.cell_volume"": 16733.018068609374}, {""m.refcode"": ""NODTEH"", ""m.name"": ""IRMOF-23terp"", ""m.cell_volume"": 16689.48558799738}, {""m.refcode"": ""NODTIL"", ""m.name"": ""IRMOF-25terPh"", ""m.cell_volume"": 16619.052977674055}, {""m.refcode"": ""NODTOR"", ""m.name"": ""IRMOF-pentane"", ""m.cell_volume"": 16911.001339142396}, {""m.refcode"": ""NUVYEK"", ""m.name"": ""IRMOF-61"", ""m.cell_volume"": 15328.107369796588}, {""m.refcode"": ""NUVYIO"", ""m.name"": ""IRMOF-62"", ""m.cell_volume"": 32931.673848748665}, {""m.refcode"": ""PIWLIT"", ""m.name"": ""IRMOF-9"", ""m.cell_volume"": 7119.219717999888}, {""m.refcode"": ""RAVVUH"", ""m.name"": ""IRMOF-74-II"", ""m.cell_volume"": 7795.566443322164}, {""m.refcode"": ""RAVWAO"", ""m.name"": ""IRMOF-74-III"", ""m.cell_volume"": 11780.842833048522}, {""m.refcode"": ""RAVWES"", ""m.name"": ""IRMOF-74-IV"", ""m.cell_volume"": 17942.24811706026}, {""m.refcode"": ""RAVWOC"", ""m.name"": ""IRMOF-74-V-hex"", ""m.cell_volume"": 26610.98899515233}, {""m.refcode"": ""RAVWUI"", ""m.name"": ""IRMOF-74-VI"", ""m.cell_volume"": 36505.4901309066}, {""m.refcode"": ""RAVXAP"", ""m.name"": ""IRMOF-74-VII"", ""m.cell_volume"": 51176.31646333511}, {""m.refcode"": ""RAVXET"", ""m.name"": ""IRMOF-74-VI-oeg"", ""m.cell_volume"": 51947.5784373008}, {""m.refcode"": ""RAVXIX"", ""m.name"": ""IRMOF-74-IX"", ""m.cell_volume"": 77838.75644709257}, {""m.refcode"": ""RAVXOD"", ""m.name"": ""IRMOF-74-XI"", ""m.cell_volume"": 128222.51086634406}, {""m.refcode"": ""RUTPAY01"", ""m.name"": ""IRMOF-77"", ""m.cell_volume"": 59427.41525399425}, {""m.refcode"": ""WORKUL"", ""m.name"": ""INT-IRMOF-8-C"", ""m.cell_volume"": 6482.926841135814}, {""m.refcode"": ""WORLAS"", ""m.name"": ""INT-IRMOF-8-B"", ""m.cell_volume"": 6409.715670913836}]"
What is the temporal unit used during the synthesis of MOF-3?,"MATCH (m:MOF)-[:has_publication]->(:Publication)<-[:has_publication]-(s:Synthesis_Procedure)-[:has_time]->(st:Synthesis_Time) WHERE m.name CONTAINS 'MOF-3' RETURN st.Value, st.Unit",90,2,"[{""st.Value"": ""72"", ""st.Unit"": ""h1.0""}, {""st.Value"": ""72"", ""st.Unit"": ""h1.0""}, {""st.Value"": ""48.0"", ""st.Unit"": ""h1.0""}, {""st.Value"": ""48.0"", ""st.Unit"": ""h1.0""}, {""st.Value"": ""48.0"", ""st.Unit"": ""h1.0""}]"
"Can you calculate the total number of atoms linked to the MOF with a Space_Group of ""P6/mmm"" and a name containing ""IRMOF""?","MATCH (m:MOF)-[:has_spaceGroup]->(sg:Space_Group {name: ""P6/mmm""}), (m)-[:has_atom]->(a:Atom) WHERE m.name CONTAINS 'IRMOF' RETURN count(distinct a);",153,1,"[{""count(distinct a)"": 0}]"
What is the magnitude and unit of the critical property utilized in the creation of HKUST-1?,"MATCH (s:Synthesis_Procedure)-[:has_publication]->(:Publication)<-[:has_publication]-(m:MOF) MATCH (s)-[:has_property]->(sp:Synthesis_Property) WHERE m.name CONTAINS 'MOF-5' RETURN sp.value, sp.unit",108,3,"[{""sp.value"": ""86"", ""sp.unit"": ""%1.0""}, {""sp.value"": ""60"", ""sp.unit"": ""%1.0""}, {""sp.value"": ""60"", ""sp.unit"": ""%1.0""}, {""sp.value"": ""60"", ""sp.unit"": ""%1.0""}, {""sp.value"": ""60"", ""sp.unit"": ""%1.0""}, {""sp.value"": ""81"", ""sp.unit"": ""%1.0""}, {""sp.value"": ""77"", ""sp.unit"": ""%1.0""}, {""sp.value"": ""83"", ""sp.unit"": ""%1.0""}, {""sp.value"": ""74"", ""sp.unit"": ""%1.0""}, {""sp.value"": ""65"", ""sp.unit"": ""%1.0""}, {""sp.value"": ""64"", ""sp.unit"": ""%1.0""}]"
Could you provide the z_prime value for MOFs 'HKUST-1'?,"MATCH (m:MOF) WHERE m.name CONTAINS 'HKUST-1' RETURN m.refcode, m.name, m.z_prime",41,2,"[{""m.refcode"": ""DOTSOV42"", ""m.name"": ""HKUST-1"", ""m.z_prime"": 0.04}, {""m.refcode"": ""FIQCEN"", ""m.name"": ""HKUST-1|Teaching Subset: MOFs"", ""m.z_prime"": 0.08}, {""m.refcode"": ""FUNGAZ"", ""m.name"": ""HKUST-1 (as synthesised)"", ""m.z_prime"": 0.08}, {""m.refcode"": ""LUDLED"", ""m.name"": ""HKUST-1"", ""m.z_prime"": 0.08}, {""m.refcode"": ""WULJUJ"", ""m.name"": ""HKUST-1 0.56(dideuteroacetylene)"", ""m.z_prime"": 0.04}]"
What is the z value of a MOF 'IRMOF'?,"MATCH (m:MOF) WHERE m.name CONTAINS 'IRMOF' RETURN m.refcode, m.name, m.z_value",20,0,"[{""m.refcode"": ""GINYAG"", ""m.name"": ""Ni-IRMOF-74-II"", ""m.z_value"": 9.0}, {""m.refcode"": ""GINYIO"", ""m.name"": ""Ni-IRMOF-74-III"", ""m.z_value"": 9.0}, {""m.refcode"": ""GINYOU"", ""m.name"": ""Ni-IRMOF-74-IV"", ""m.z_value"": 9.0}, {""m.refcode"": ""GINYUA"", ""m.name"": ""Ni-IRMOF-74-V"", ""m.z_value"": 9.0}, {""m.refcode"": ""HOLQAC"", ""m.name"": ""\u03b1-IRMOF-3-AMPh"", ""m.z_value"": 8.0}, {""m.refcode"": ""NODTEH"", ""m.name"": ""IRMOF-23terp"", ""m.z_value"": 8.0}, {""m.refcode"": ""NODTIL"", ""m.name"": ""IRMOF-25terPh"", ""m.z_value"": 8.0}, {""m.refcode"": ""NODTOR"", ""m.name"": ""IRMOF-pentane"", ""m.z_value"": 8.0}, {""m.refcode"": ""NUVYEK"", ""m.name"": ""IRMOF-61"", ""m.z_value"": 4.0}, {""m.refcode"": ""NUVYIO"", ""m.name"": ""IRMOF-62"", ""m.z_value"": 6.0}, {""m.refcode"": ""PIWLIT"", ""m.name"": ""IRMOF-9"", ""m.z_value"": 4.0}, {""m.refcode"": ""RAVVUH"", ""m.name"": ""IRMOF-74-II"", ""m.z_value"": 9.0}, {""m.refcode"": ""RAVWAO"", ""m.name"": ""IRMOF-74-III"", ""m.z_value"": 9.0}, {""m.refcode"": ""RAVWES"", ""m.name"": ""IRMOF-74-IV"", ""m.z_value"": 9.0}, {""m.refcode"": ""RAVWOC"", ""m.name"": ""IRMOF-74-V-hex"", ""m.z_value"": 9.0}, {""m.refcode"": ""RAVWUI"", ""m.name"": ""IRMOF-74-VI"", ""m.z_value"": 9.0}, {""m.refcode"": ""RAVXAP"", ""m.name"": ""IRMOF-74-VII"", ""m.z_value"": 9.0}, {""m.refcode"": ""RAVXET"", ""m.name"": ""IRMOF-74-VI-oeg"", ""m.z_value"": 9.0}, {""m.refcode"": ""RAVXIX"", ""m.name"": ""IRMOF-74-IX"", ""m.z_value"": 9.0}, {""m.refcode"": ""RAVXOD"", ""m.name"": ""IRMOF-74-XI"", ""m.z_value"": 9.0}, {""m.refcode"": ""RUTPAY01"", ""m.name"": ""IRMOF-77"", ""m.z_value"": 12.0}, {""m.refcode"": ""WORKUL"", ""m.name"": ""INT-IRMOF-8-C"", ""m.z_value"": 2.0}, {""m.refcode"": ""WORLAS"", ""m.name"": ""INT-IRMOF-8-B"", ""m.z_value"": 2.0}]"
List the chemical formula of the MOF HKUST-1.,"MATCH (m:MOF) WHERE m.name CONTAINS 'HKUST-1' RETURN m.refcode, m.name, m.chemical_formula",6,0,"[{""m.refcode"": ""DOTSOV42"", ""m.name"": ""HKUST-1"", ""m.chemical_formula"": ""(C36 H12 Cu6 O24)n""}, {""m.refcode"": ""FIQCEN"", ""m.name"": ""HKUST-1|Teaching Subset: MOFs"", ""m.chemical_formula"": ""(C18 H12 Cu3 O15)n,10n(H2 O1)""}, {""m.refcode"": ""FUNGAZ"", ""m.name"": ""HKUST-1 (as synthesised)"", ""m.chemical_formula"": ""(C18 H12 Cu3 O15)n""}, {""m.refcode"": ""LUDLED"", ""m.name"": ""HKUST-1"", ""m.chemical_formula"": ""(C18 H12 Cu3 O15)n,7n(H2 O1)""}, {""m.refcode"": ""WULJUJ"", ""m.name"": ""HKUST-1 0.56(dideuteroacetylene)"", ""m.chemical_formula"": ""(C36 H12 Cu6 O24)n,3.4n(C2 D2)""}]"
Can you provide the time unit used in synthesizing MOF-3?,"MATCH (m:MOF)-[:has_publication]->(:Publication)<-[:has_publication]-(s:Synthesis_Procedure)-[:has_time]->(st:Synthesis_Time) WHERE m.name CONTAINS 'MOF-3' RETURN st.Value, st.Unit",90,1,"[{""st.Value"": ""72"", ""st.Unit"": ""h1.0""}, {""st.Value"": ""72"", ""st.Unit"": ""h1.0""}, {""st.Value"": ""48.0"", ""st.Unit"": ""h1.0""}, {""st.Value"": ""48.0"", ""st.Unit"": ""h1.0""}, {""st.Value"": ""48.0"", ""st.Unit"": ""h1.0""}]"
What is the specific name of the database that contains information about the MOFs named 'HKUST-1'?,"MATCH (m:MOF) WHERE m.name CONTAINS 'HKUST-1' RETURN m.refcode, m.name, m.database_name",37,3,"[{""m.refcode"": ""DOTSOV42"", ""m.name"": ""HKUST-1"", ""m.database_name"": ""as543be_ASER""}, {""m.refcode"": ""FIQCEN"", ""m.name"": ""HKUST-1|Teaching Subset: MOFs"", ""m.database_name"": ""as543be_ASER""}, {""m.refcode"": ""FUNGAZ"", ""m.name"": ""HKUST-1 (as synthesised)"", ""m.database_name"": ""as543be_ASER""}, {""m.refcode"": ""LUDLED"", ""m.name"": ""HKUST-1"", ""m.database_name"": ""as543be_ASER""}, {""m.refcode"": ""WULJUJ"", ""m.name"": ""HKUST-1 0.56(dideuteroacetylene)"", ""m.database_name"": ""as543be_ASER""}]"
What is the mixture of the solvent used in the synthesis of HKUST-1?,"MATCH (s:Synthesis_Procedure)-[:has_publication]->(:Publication)<-[:has_publication]-(m:MOF) MATCH (s)-[:has_solvent_precursor]->(sp:Synthesis_Solvent_Precursor)-[:has_composition]->(sc:Solvent_Composition) WHERE m.name CONTAINS 'HKUST-1' RETURN sc.comp_id, sc.unit, sc.order, sc.value",105,2,"[{""sc.comp_id"": ""MIsyn3526_sprec2_comp0"", ""sc.unit"": ""mL1.0"", ""sc.order"": 0, ""sc.value"": 6.0}, {""sc.comp_id"": ""MIsyn3526_sprec1_comp0"", ""sc.unit"": ""mL1.0"", ""sc.order"": 0, ""sc.value"": 6.0}, {""sc.comp_id"": ""MIsyn3526_sprec3_comp0"", ""sc.unit"": ""mL1.0"", ""sc.order"": 0, ""sc.value"": 6.0}, {""sc.comp_id"": ""MIsyn3526_sprec2_comp0"", ""sc.unit"": ""mL1.0"", ""sc.order"": 0, ""sc.value"": 6.0}, {""sc.comp_id"": ""MIsyn3526_sprec1_comp0"", ""sc.unit"": ""mL1.0"", ""sc.order"": 0, ""sc.value"": 6.0}, {""sc.comp_id"": ""MIsyn3526_sprec3_comp0"", ""sc.unit"": ""mL1.0"", ""sc.order"": 0, ""sc.value"": 6.0}]"
Give me the list of MOF names that contain 'IRMOF.',MATCH (m:MOF) WHERE m.name CONTAINS 'IRMOF' RETURN m.name,5,0,"[{""m.name"": ""Ni-IRMOF-74-II""}, {""m.name"": ""Ni-IRMOF-74-III""}, {""m.name"": ""Ni-IRMOF-74-IV""}, {""m.name"": ""Ni-IRMOF-74-V""}, {""m.name"": ""\u03b1-IRMOF-3-AMPh""}, {""m.name"": ""IRMOF-23terp""}, {""m.name"": ""IRMOF-25terPh""}, {""m.name"": ""IRMOF-pentane""}, {""m.name"": ""IRMOF-61""}, {""m.name"": ""IRMOF-62""}, {""m.name"": ""IRMOF-9""}, {""m.name"": ""IRMOF-74-II""}, {""m.name"": ""IRMOF-74-III""}, {""m.name"": ""IRMOF-74-IV""}, {""m.name"": ""IRMOF-74-V-hex""}, {""m.name"": ""IRMOF-74-VI""}, {""m.name"": ""IRMOF-74-VII""}, {""m.name"": ""IRMOF-74-VI-oeg""}, {""m.name"": ""IRMOF-74-IX""}, {""m.name"": ""IRMOF-74-XI""}, {""m.name"": ""IRMOF-77""}, {""m.name"": ""INT-IRMOF-8-C""}, {""m.name"": ""INT-IRMOF-8-B""}]"
What is the source of radiation for the experiment used to determine the structure of the MOFs 'HKUST-1'?,"MATCH (m:MOF) WHERE m.name CONTAINS 'HKUST-1' RETURN m.refcode, m.name, m.radiation_source",40,0,"[{""m.refcode"": ""DOTSOV42"", ""m.name"": ""HKUST-1"", ""m.radiation_source"": ""Neutron""}, {""m.refcode"": ""FIQCEN"", ""m.name"": ""HKUST-1|Teaching Subset: MOFs"", ""m.radiation_source"": ""X-ray""}, {""m.refcode"": ""FUNGAZ"", ""m.name"": ""HKUST-1 (as synthesised)"", ""m.radiation_source"": ""X-ray""}, {""m.refcode"": ""LUDLED"", ""m.name"": ""HKUST-1"", ""m.radiation_source"": ""X-ray""}, {""m.refcode"": ""WULJUJ"", ""m.name"": ""HKUST-1 0.56(dideuteroacetylene)"", ""m.radiation_source"": ""Neutron""}]"
"What is the name of the Organic_Linker in the MOF that has a Crystal_System of ""orthorhombic"" and a name that contains ""IRMOF""?","MATCH (m:MOF)-[:has_crystalSystem]->(cs:Crystal_System {name: ""orthorhombic""}), (m)-[:has_organicLinker]->(ol:Organic_Linker) WHERE m.name CONTAINS 'IRMOF' RETURN ol.name;",154,0,"[{""ol.name"": ""[O-]C(=O)c1ccc(cc1)C(=O)[O-]""}]"
"Among all the MOFs 'MOF-3', what is the highest metal composition value observed in the metal precursor used in the preparation process with a 'prepare' operation name?",MATCH (m:MOF)-[:has_publication]->(:Publication)<-[:has_publication]-(s:Synthesis_Procedure)-[:has_metal_precursor]->(mp:Synthesis_Metal_Precursor)-[:has_composition]->(mc:Metal_Composition) MATCH (s)-[:has_operation]->(p:Synthesis_Operation) WHERE m.name CONTAINS 'MOF-3' AND toLower(p.name) CONTAINS 'prepare' RETURN max(mc.value) ORDER BY max(mc.value) DESC LIMIT 1,127,2,"[{""max(mc.value)"": 12.3}]"
Could you describe the color of MOFs 'HKUST-1' under different lighting conditions?,"MATCH (m:MOF) WHERE m.name CONTAINS 'HKUST-1' RETURN m.refcode, m.name, m.color",49,1,"[{""m.refcode"": ""DOTSOV42"", ""m.name"": ""HKUST-1"", ""m.color"": """"}, {""m.refcode"": ""FIQCEN"", ""m.name"": ""HKUST-1|Teaching Subset: MOFs"", ""m.color"": ""turquoise""}, {""m.refcode"": ""FUNGAZ"", ""m.name"": ""HKUST-1 (as synthesised)"", ""m.color"": ""light blue""}, {""m.refcode"": ""LUDLED"", ""m.name"": ""HKUST-1"", ""m.color"": ""blue""}, {""m.refcode"": ""WULJUJ"", ""m.name"": ""HKUST-1 0.56(dideuteroacetylene)"", ""m.color"": """"}]"
Can you provide the names of the 5 most prevalent space groups in MOFs?,"MATCH (m:MOF)-[r:has_spaceGroup]->(c:Space_Group) RETURN c.name, count(c) as freq ORDER BY freq DESC LIMIT 5",74,2,"[{""c.name"": ""C2/c"", ""freq"": 1430}, {""c.name"": ""P-1"", ""freq"": 1280}, {""c.name"": ""P21/c"", ""freq"": 1045}, {""c.name"": ""R-3"", ""freq"": 830}, {""c.name"": ""P21/n"", ""freq"": 665}]"
Can you specify the deposition date of MOF 'HKUST-1' in the database?,"MATCH (m:MOF) WHERE m.name CONTAINS 'HKUST-1' RETURN m.refcode, m.name, m.deposition_date",24,2,"[{""m.refcode"": ""DOTSOV42"", ""m.name"": ""HKUST-1"", ""m.deposition_date"": ""06/17/2010""}, {""m.refcode"": ""FIQCEN"", ""m.name"": ""HKUST-1|Teaching Subset: MOFs"", ""m.deposition_date"": ""08/13/1999""}, {""m.refcode"": ""FUNGAZ"", ""m.name"": ""HKUST-1 (as synthesised)"", ""m.deposition_date"": ""01/29/2020""}, {""m.refcode"": ""LUDLED"", ""m.name"": ""HKUST-1"", ""m.deposition_date"": ""05/14/2015""}, {""m.refcode"": ""WULJUJ"", ""m.name"": ""HKUST-1 0.56(dideuteroacetylene)"", ""m.deposition_date"": ""06/17/2010""}]"
