question,query,qsq_list_idx,question_idx,answer
What are the top 5 metals with the highest frequency of use in MOF synthesis?,"MATCH (m:MOF)-[r:has_metal]->(c:Metal) RETURN c.name, count(c) as freq ORDER BY freq DESC LIMIT 5",68,3,"[{""c.name"": ""[Zn]"", ""freq"": 1179}, {""c.name"": ""[Cu]"", ""freq"": 1068}, {""c.name"": ""[Cd]"", ""freq"": 812}, {""c.name"": ""[Co]"", ""freq"": 807}, {""c.name"": ""*"", ""freq"": 424}]"
What is the r_factor of a MOF 'MOF-5'?,"MATCH (m:MOF) WHERE m.name CONTAINS 'MOF-5' RETURN m.refcode, m.name, m.r_factor",35,0,"[{""m.refcode"": ""FAYPUS"", ""m.name"": ""DMOF-5"", ""m.r_factor"": 10.93}, {""m.refcode"": ""LASYOU"", ""m.name"": ""MOF-505"", ""m.r_factor"": 3.61}, {""m.refcode"": ""MIBQAR"", ""m.name"": ""MOF-5"", ""m.r_factor"": 4.88}, {""m.refcode"": ""MIBQAR01"", ""m.name"": ""MOF-5"", ""m.r_factor"": 4.05}, {""m.refcode"": ""MIBQAR02"", ""m.name"": ""MOF-5"", ""m.r_factor"": 3.61}, {""m.refcode"": ""MIBQAR03"", ""m.name"": ""MOF-5"", ""m.r_factor"": 3.3000000000000003}, {""m.refcode"": ""MIBQAR04"", ""m.name"": ""MOF-5"", ""m.r_factor"": 2.97}, {""m.refcode"": ""MIBQAR05"", ""m.name"": ""MOF-5"", ""m.r_factor"": 3.14}, {""m.refcode"": ""MIBQAR06"", ""m.name"": ""MOF-5"", ""m.r_factor"": 2.97}, {""m.refcode"": ""MIBQAR07"", ""m.name"": ""MOF-5"", ""m.r_factor"": 3.11}, {""m.refcode"": ""MIBQAR08"", ""m.name"": ""MOF-5"", ""m.r_factor"": 3.34}, {""m.refcode"": ""MIBQAR09"", ""m.name"": ""MOF-5"", ""m.r_factor"": 3.15}, {""m.refcode"": ""MIBQAR10"", ""m.name"": ""MOF-5"", ""m.r_factor"": 3.14}, {""m.refcode"": ""MIBQAR11"", ""m.name"": ""MOF-5"", ""m.r_factor"": 3.13}, {""m.refcode"": ""MIBQAR12"", ""m.name"": ""MOF-5"", ""m.r_factor"": 3.13}, {""m.refcode"": ""MIBQAR13"", ""m.name"": ""MOF-5"", ""m.r_factor"": 3.26}, {""m.refcode"": ""MIBQAR14"", ""m.name"": ""MOF-5"", ""m.r_factor"": 3.21}, {""m.refcode"": ""MIBQAR15"", ""m.name"": ""MOF-5"", ""m.r_factor"": 3.09}, {""m.refcode"": ""MIBQAR16"", ""m.name"": ""MOF-5"", ""m.r_factor"": 3.6}, {""m.refcode"": ""MIBQAR17"", ""m.name"": ""MOF-5"", ""m.r_factor"": 3.28}, {""m.refcode"": ""MIBQAR18"", ""m.name"": ""MOF-5"", ""m.r_factor"": 6.9}, {""m.refcode"": ""MIBQAR19"", ""m.name"": ""MOF-5"", ""m.r_factor"": 3.1}, {""m.refcode"": ""MIBQAR20"", ""m.name"": ""MOF-5"", ""m.r_factor"": 3.46}, {""m.refcode"": ""OFEDAH"", ""m.name"": ""GR-MOF-5"", ""m.r_factor"": 4.45}, {""m.refcode"": ""OMUKUE"", ""m.name"": ""TPMOF-5"", ""m.r_factor"": 5.0600000000000005}, {""m.refcode"": ""OTECEX"", ""m.name"": ""\u0394-MOF-520 unknown solvate"", ""m.r_factor"": 3.39}, {""m.refcode"": ""OTECUN"", ""m.name"": ""\u039b-MOF-520 trimesate unknown solvate"", ""m.r_factor"": 6.2}, {""m.refcode"": ""OTEDEY"", ""m.name"": ""\u039b-MOF-520 3-(t-butoxycarbonylamino)propan-1,2-diolato unknown solvate"", ""m.r_factor"": 5.23}, {""m.refcode"": ""OTEDOI"", ""m.name"": ""\u039b-MOF-520 unknown solvate"", ""m.r_factor"": 2.9}, {""m.refcode"": ""OTEDUO"", ""m.name"": ""\u039b-MOF-520 methanolate unknown solvate"", ""m.r_factor"": 3.34}, {""m.refcode"": ""QEFWUV"", ""m.name"": ""MOF-545"", ""m.r_factor"": 7.58}, {""m.refcode"": ""QOXQEC"", ""m.name"": ""-MOF-520-24"", ""m.r_factor"": 3.54}, {""m.refcode"": ""QOXQIG"", ""m.name"": ""-MOF-520-25"", ""m.r_factor"": 4.76}, {""m.refcode"": ""QOXQUS"", ""m.name"": ""-MOF-520-27"", ""m.r_factor"": 4.91}, {""m.refcode"": ""QOXRAZ"", ""m.name"": ""-MOF-520-28"", ""m.r_factor"": 5.5600000000000005}, {""m.refcode"": ""QOXRIH"", ""m.name"": ""-MOF-520-31-activated"", ""m.r_factor"": 5.32}, {""m.refcode"": ""QOXRON"", ""m.name"": ""-MOF-520-S-32"", ""m.r_factor"": 7.95}, {""m.refcode"": ""QOXSAA"", ""m.name"": ""-MOF-520-22"", ""m.r_factor"": 2.54}, {""m.refcode"": ""QOXSOO"", ""m.name"": ""-MOF-520-R-32"", ""m.r_factor"": 8.73}, {""m.refcode"": ""QOXSUU"", ""m.name"": ""\u0394-MOF-520-17"", ""m.r_factor"": 4.94}, {""m.refcode"": ""QOXTOP"", ""m.name"": ""\u0394-MOF-520-21"", ""m.r_factor"": 6.54}, {""m.refcode"": ""QOXVEH"", ""m.name"": ""-MOF-520 N,N-dimethylformamide solvate"", ""m.r_factor"": 6.82}, {""m.refcode"": ""RIXPOF"", ""m.name"": ""MOF-519"", ""m.r_factor"": 11.12}, {""m.refcode"": ""RUVKAV"", ""m.name"": ""catena-[(\u03bc8-5,5'-Buta-1,3-diyne-1,4-diyldibenzene-1,3-dicarboxylato)-diaqua-di-copper(ii) dimethylformamide solvate trihydrate]|MOF-505"", ""m.r_factor"": 6.2700000000000005}, {""m.refcode"": ""SAHYIK"", ""m.name"": ""MOF-5|Teaching Subset: MOFs"", ""m.r_factor"": 10.99}, {""m.refcode"": ""SUFJEK"", ""m.name"": ""PMOF-55"", ""m.r_factor"": 4.17}, {""m.refcode"": ""TIHROU"", ""m.name"": ""MOF-591"", ""m.r_factor"": 8.71}, {""m.refcode"": ""TIHRUA"", ""m.name"": ""MOF-592"", ""m.r_factor"": 5.66}, {""m.refcode"": ""TIHTUC"", ""m.name"": ""MOF-590"", ""m.r_factor"": 6.03}, {""m.refcode"": ""VUSKEA01"", ""m.name"": ""MOF-5"", ""m.r_factor"": 5.86}]"
How would you characterize the color of MOF 'MOF-5'?,"MATCH (m:MOF) WHERE m.name CONTAINS 'MOF-5' RETURN m.refcode, m.name, m.color",26,3,"[{""m.refcode"": ""FAYPUS"", ""m.name"": ""DMOF-5"", ""m.color"": ""colorless""}, {""m.refcode"": ""LASYOU"", ""m.name"": ""MOF-505"", ""m.color"": ""blue""}, {""m.refcode"": ""MIBQAR"", ""m.name"": ""MOF-5"", ""m.color"": ""colorless""}, {""m.refcode"": ""MIBQAR01"", ""m.name"": ""MOF-5"", ""m.color"": ""colorless""}, {""m.refcode"": ""MIBQAR02"", ""m.name"": ""MOF-5"", ""m.color"": ""colorless""}, {""m.refcode"": ""MIBQAR03"", ""m.name"": ""MOF-5"", ""m.color"": ""colorless""}, {""m.refcode"": ""MIBQAR04"", ""m.name"": ""MOF-5"", ""m.color"": ""colorless""}, {""m.refcode"": ""MIBQAR05"", ""m.name"": ""MOF-5"", ""m.color"": ""colorless""}, {""m.refcode"": ""MIBQAR06"", ""m.name"": ""MOF-5"", ""m.color"": ""colorless""}, {""m.refcode"": ""MIBQAR07"", ""m.name"": ""MOF-5"", ""m.color"": ""colorless""}, {""m.refcode"": ""MIBQAR08"", ""m.name"": ""MOF-5"", ""m.color"": ""colorless""}, {""m.refcode"": ""MIBQAR09"", ""m.name"": ""MOF-5"", ""m.color"": ""colorless""}, {""m.refcode"": ""MIBQAR10"", ""m.name"": ""MOF-5"", ""m.color"": ""colorless""}, {""m.refcode"": ""MIBQAR11"", ""m.name"": ""MOF-5"", ""m.color"": ""colorless""}, {""m.refcode"": ""MIBQAR12"", ""m.name"": ""MOF-5"", ""m.color"": ""colorless""}, {""m.refcode"": ""MIBQAR13"", ""m.name"": ""MOF-5"", ""m.color"": ""colorless""}, {""m.refcode"": ""MIBQAR14"", ""m.name"": ""MOF-5"", ""m.color"": ""colorless""}, {""m.refcode"": ""MIBQAR15"", ""m.name"": ""MOF-5"", ""m.color"": ""colorless""}, {""m.refcode"": ""MIBQAR16"", ""m.name"": ""MOF-5"", ""m.color"": ""colorless""}, {""m.refcode"": ""MIBQAR17"", ""m.name"": ""MOF-5"", ""m.color"": ""colorless""}, {""m.refcode"": ""MIBQAR18"", ""m.name"": ""MOF-5"", ""m.color"": ""colorless""}, {""m.refcode"": ""MIBQAR19"", ""m.name"": ""MOF-5"", ""m.color"": ""colorless""}, {""m.refcode"": ""MIBQAR20"", ""m.name"": ""MOF-5"", ""m.color"": ""colorless""}, {""m.refcode"": ""OFEDAH"", ""m.name"": ""GR-MOF-5"", ""m.color"": ""light green""}, {""m.refcode"": ""OMUKUE"", ""m.name"": ""TPMOF-5"", ""m.color"": ""yellow""}, {""m.refcode"": ""OTECEX"", ""m.name"": ""\u0394-MOF-520 unknown solvate"", ""m.color"": ""colorless""}, {""m.refcode"": ""OTECUN"", ""m.name"": ""\u039b-MOF-520 trimesate unknown solvate"", ""m.color"": ""colorless""}, {""m.refcode"": ""OTEDEY"", ""m.name"": ""\u039b-MOF-520 3-(t-butoxycarbonylamino)propan-1,2-diolato unknown solvate"", ""m.color"": ""colorless""}, {""m.refcode"": ""OTEDOI"", ""m.name"": ""\u039b-MOF-520 unknown solvate"", ""m.color"": ""colorless""}, {""m.refcode"": ""OTEDUO"", ""m.name"": ""\u039b-MOF-520 methanolate unknown solvate"", ""m.color"": ""colorless""}, {""m.refcode"": ""QEFWUV"", ""m.name"": ""MOF-545"", ""m.color"": ""red brown""}, {""m.refcode"": ""QOXQEC"", ""m.name"": ""-MOF-520-24"", ""m.color"": ""colorless""}, {""m.refcode"": ""QOXQIG"", ""m.name"": ""-MOF-520-25"", ""m.color"": ""colorless""}, {""m.refcode"": ""QOXQUS"", ""m.name"": ""-MOF-520-27"", ""m.color"": ""colorless""}, {""m.refcode"": ""QOXRAZ"", ""m.name"": ""-MOF-520-28"", ""m.color"": ""colorless""}, {""m.refcode"": ""QOXRIH"", ""m.name"": ""-MOF-520-31-activated"", ""m.color"": ""colorless""}, {""m.refcode"": ""QOXRON"", ""m.name"": ""-MOF-520-S-32"", ""m.color"": ""colorless""}, {""m.refcode"": ""QOXSAA"", ""m.name"": ""-MOF-520-22"", ""m.color"": ""colorless""}, {""m.refcode"": ""QOXSOO"", ""m.name"": ""-MOF-520-R-32"", ""m.color"": ""colorless""}, {""m.refcode"": ""QOXSUU"", ""m.name"": ""\u0394-MOF-520-17"", ""m.color"": ""colorless""}, {""m.refcode"": ""QOXTOP"", ""m.name"": ""\u0394-MOF-520-21"", ""m.color"": ""colorless""}, {""m.refcode"": ""QOXVEH"", ""m.name"": ""-MOF-520 N,N-dimethylformamide solvate"", ""m.color"": ""colorless""}, {""m.refcode"": ""RIXPOF"", ""m.name"": ""MOF-519"", ""m.color"": ""colorless""}, {""m.refcode"": ""RUVKAV"", ""m.name"": ""catena-[(\u03bc8-5,5'-Buta-1,3-diyne-1,4-diyldibenzene-1,3-dicarboxylato)-diaqua-di-copper(ii) dimethylformamide solvate trihydrate]|MOF-505"", ""m.color"": ""green""}, {""m.refcode"": ""SAHYIK"", ""m.name"": ""MOF-5|Teaching Subset: MOFs"", ""m.color"": """"}, {""m.refcode"": ""SUFJEK"", ""m.name"": ""PMOF-55"", ""m.color"": ""colorless""}, {""m.refcode"": ""TIHROU"", ""m.name"": ""MOF-591"", ""m.color"": ""light yellow""}, {""m.refcode"": ""TIHRUA"", ""m.name"": ""MOF-592"", ""m.color"": ""light yellow""}, {""m.refcode"": ""TIHTUC"", ""m.name"": ""MOF-590"", ""m.color"": """"}, {""m.refcode"": ""VUSKEA01"", ""m.name"": ""MOF-5"", ""m.color"": """"}]"
Can you specify the dimensions of the edges of the unit cell of MOF 'MOF-3'?,"MATCH (m:MOF) WHERE m.name CONTAINS 'MOF-3' RETURN m.refcode, m.name, m.cell_lengths",22,2,"[{""m.refcode"": ""CEFNOT"", ""m.name"": ""she-MOF-3"", ""m.cell_lengths"": ""CellLengths(a=46.744, b=46.744, c=46.744)""}, {""m.refcode"": ""FAYPIG"", ""m.name"": ""DMOF-3"", ""m.cell_lengths"": ""CellLengths(a=19.562, b=20.85, c=23.573)""}, {""m.refcode"": ""FEYQIK"", ""m.name"": ""GWMOF-3"", ""m.cell_lengths"": ""CellLengths(a=8.655000000000001, b=9.9366, c=11.717)""}, {""m.refcode"": ""HOLQAC"", ""m.name"": ""\u03b1-IRMOF-3-AMPh"", ""m.cell_lengths"": ""CellLengths(a=25.5775, b=25.5775, c=25.5775)""}, {""m.refcode"": ""KITVEQ"", ""m.name"": ""MOF-3"", ""m.cell_lengths"": ""CellLengths(a=15.749, b=16.425, c=15.725)""}, {""m.refcode"": ""LAJKUE"", ""m.name"": ""CD-MOF-3"", ""m.cell_lengths"": ""CellLengths(a=30.868000000000002, b=30.868000000000002, c=30.868000000000002)""}, {""m.refcode"": ""MIFGEQ"", ""m.name"": ""TMOF-3"", ""m.cell_lengths"": ""CellLengths(a=22.2892, b=22.2235, c=15.7911)""}, {""m.refcode"": ""PIKYAM"", ""m.name"": ""JUST-3|LMOF-311"", ""m.cell_lengths"": ""CellLengths(a=17.133, b=42.533, c=33.899300000000004)""}]"
What is the last step in the synthesis procedure of MOFs 'MOF-3' called?,MATCH (m:MOF)-[:has_publication]->(:Publication)<-[:has_publication]-(s:Synthesis_Procedure)-[:has_operation]->(o:Synthesis_Operation) WHERE m.name CONTAINS 'MOF-3' RETURN o.name ORDER BY o.order DESC LIMIT 1,125,1,"[{""o.name"": ""prepare""}]"
What is the size of the angle formed between the a-axis and c-axis for the unit cell of MOFs 'HKUST-1'?,"MATCH (m:MOF) WHERE m.name CONTAINS 'HKUST-1' RETURN m.refcode, m.name, m.cell_angles",46,3,"[{""m.refcode"": ""DOTSOV42"", ""m.name"": ""HKUST-1"", ""m.cell_angles"": ""CellAngles(alpha=90.0, beta=90.0, gamma=90.0)""}, {""m.refcode"": ""FIQCEN"", ""m.name"": ""HKUST-1|Teaching Subset: MOFs"", ""m.cell_angles"": ""CellAngles(alpha=90.0, beta=90.0, gamma=90.0)""}, {""m.refcode"": ""FUNGAZ"", ""m.name"": ""HKUST-1 (as synthesised)"", ""m.cell_angles"": ""CellAngles(alpha=90.0, beta=90.0, gamma=90.0)""}, {""m.refcode"": ""LUDLED"", ""m.name"": ""HKUST-1"", ""m.cell_angles"": ""CellAngles(alpha=90.0, beta=90.0, gamma=90.0)""}, {""m.refcode"": ""WULJUJ"", ""m.name"": ""HKUST-1 0.56(dideuteroacetylene)"", ""m.cell_angles"": ""CellAngles(alpha=90.0, beta=90.0, gamma=90.0)""}]"
What is the total number of authors for publications about HKUST-1?,"MATCH (m:MOF {name: ""HKUST-1""})-[:has_publication]->(p:Publication)-[:has_author]->(a:Author) RETURN count(distinct a);",157,0,"[{""count(distinct a)"": 11}]"
How is the temperature in the synthesis of MOF-3 quantified?,"MATCH (m:MOF)-[:has_publication]->(:Publication)<-[:has_publication]-(s:Synthesis_Procedure)-[:has_temperature]->(t:Synthesis_Temperature) WHERE m.name CONTAINS 'MOF-3' RETURN t.Value, t.Unit",88,3,"[{""t.Value"": 393.15, ""t.Unit"": ""K1.0""}, {""t.Value"": 453.15, ""t.Unit"": ""K1.0""}, {""t.Value"": 353.15, ""t.Unit"": ""K1.0""}, {""t.Value"": 353.15, ""t.Unit"": ""K1.0""}, {""t.Value"": 398.15, ""t.Unit"": ""K1.0""}]"
What is the most popular synthesis name in the database?,"MATCH (n:Synthesis_Procedure)-[:has_publication]-() RETURN n.name, count(n) as freq ORDER BY freq DESC LIMIT 1",76,0,"[{""n.name"": """", ""freq"": 1362}]"
What is the most common metal used in creating MOFs?,"MATCH (m:MOF)-[r:has_metal]->(c:Metal) RETURN c.name, count(c) as freq ORDER BY freq DESC LIMIT 1",67,1,"[{""c.name"": ""[Zn]"", ""freq"": 1179}]"
What is the publication title for the synthesis procedure that has the highest MOratio among MOFs 'MOF-3'?,MATCH (m:MOF)-[:has_publication]->(p:Publication)<-[:has_publication]-(s:Synthesis_Procedure) WHERE m.name CONTAINS 'MOF-3' WITH max(s.MOratio) as max MATCH (m1:MOF)-[:has_publication]->(p1:Publication)<-[:has_publication]-(s1:Synthesis_Procedure) MATCH (p1)-[:has_title]-(t:Title) WHERE (m1.name CONTAINS 'MOF-3') and (s1.MOratio=max) RETURN t.title,128,0,"[{""t.title"": ""Highly Luminescent Metal\u2013Organic Frameworks Based on an Aggregation-Induced Emission Ligand as Chemical Sensors for Nitroaromatic Compounds""}]"
What is the SMILES code for the organic precursor used in the synthesis of HKUST-1?,MATCH (s:Synthesis_Procedure)-[:has_publication]->(:Publication)<-[:has_publication]-(m:MOF) MATCH (s)-[:has_organic_precursor]->(mp:Synthesis_Organic_Precursor) WHERE m.name CONTAINS 'HKUST-1' RETURN mp.smiles,103,0,"[{""mp.smiles"": ""O=C(O)c1cc(C(=O)O)cc(C(=O)O)c1""}, {""mp.smiles"": ""O=C(O)c1cc(C(=O)O)cc(C(=O)O)c1""}]"
What is the unit for the temperature used in the synthesis of MOF-3?,"MATCH (m:MOF)-[:has_publication]->(:Publication)<-[:has_publication]-(s:Synthesis_Procedure)-[:has_temperature]->(t:Synthesis_Temperature) WHERE m.name CONTAINS 'MOF-3' RETURN t.Value, t.Unit",88,0,"[{""t.Value"": 393.15, ""t.Unit"": ""K1.0""}, {""t.Value"": 453.15, ""t.Unit"": ""K1.0""}, {""t.Value"": 353.15, ""t.Unit"": ""K1.0""}, {""t.Value"": 353.15, ""t.Unit"": ""K1.0""}, {""t.Value"": 398.15, ""t.Unit"": ""K1.0""}]"
Can you provide a list of the 5 most frequently used organic linkers in MOF synthesis?,"MATCH (m:MOF)-[r:has_organicLinker]->(c:Organic_Linker) RETURN c.name, count(c) as freq ORDER BY freq DESC LIMIT 5",70,1,"[{""c.name"": ""[O-]C(=O)c1cc([O])c(cc1[O])C(=O)[O-]"", ""freq"": 510}, {""c.name"": ""[O-]C(=O)c1ccc(cc1)C(=O)[O-]"", ""freq"": 383}, {""c.name"": ""[O-]C(=O)c1cc(cc(c1)C(=O)[O-])C(=O)[O-]"", ""freq"": 272}, {""c.name"": ""[O-]C=O"", ""freq"": 259}, {""c.name"": ""[O-]C(=O)C(=O)[O-]"", ""freq"": 245}]"
What is the hue of MOF 'MOF-5'?,"MATCH (m:MOF) WHERE m.name CONTAINS 'MOF-5' RETURN m.refcode, m.name, m.color",26,2,"[{""m.refcode"": ""FAYPUS"", ""m.name"": ""DMOF-5"", ""m.color"": ""colorless""}, {""m.refcode"": ""LASYOU"", ""m.name"": ""MOF-505"", ""m.color"": ""blue""}, {""m.refcode"": ""MIBQAR"", ""m.name"": ""MOF-5"", ""m.color"": ""colorless""}, {""m.refcode"": ""MIBQAR01"", ""m.name"": ""MOF-5"", ""m.color"": ""colorless""}, {""m.refcode"": ""MIBQAR02"", ""m.name"": ""MOF-5"", ""m.color"": ""colorless""}, {""m.refcode"": ""MIBQAR03"", ""m.name"": ""MOF-5"", ""m.color"": ""colorless""}, {""m.refcode"": ""MIBQAR04"", ""m.name"": ""MOF-5"", ""m.color"": ""colorless""}, {""m.refcode"": ""MIBQAR05"", ""m.name"": ""MOF-5"", ""m.color"": ""colorless""}, {""m.refcode"": ""MIBQAR06"", ""m.name"": ""MOF-5"", ""m.color"": ""colorless""}, {""m.refcode"": ""MIBQAR07"", ""m.name"": ""MOF-5"", ""m.color"": ""colorless""}, {""m.refcode"": ""MIBQAR08"", ""m.name"": ""MOF-5"", ""m.color"": ""colorless""}, {""m.refcode"": ""MIBQAR09"", ""m.name"": ""MOF-5"", ""m.color"": ""colorless""}, {""m.refcode"": ""MIBQAR10"", ""m.name"": ""MOF-5"", ""m.color"": ""colorless""}, {""m.refcode"": ""MIBQAR11"", ""m.name"": ""MOF-5"", ""m.color"": ""colorless""}, {""m.refcode"": ""MIBQAR12"", ""m.name"": ""MOF-5"", ""m.color"": ""colorless""}, {""m.refcode"": ""MIBQAR13"", ""m.name"": ""MOF-5"", ""m.color"": ""colorless""}, {""m.refcode"": ""MIBQAR14"", ""m.name"": ""MOF-5"", ""m.color"": ""colorless""}, {""m.refcode"": ""MIBQAR15"", ""m.name"": ""MOF-5"", ""m.color"": ""colorless""}, {""m.refcode"": ""MIBQAR16"", ""m.name"": ""MOF-5"", ""m.color"": ""colorless""}, {""m.refcode"": ""MIBQAR17"", ""m.name"": ""MOF-5"", ""m.color"": ""colorless""}, {""m.refcode"": ""MIBQAR18"", ""m.name"": ""MOF-5"", ""m.color"": ""colorless""}, {""m.refcode"": ""MIBQAR19"", ""m.name"": ""MOF-5"", ""m.color"": ""colorless""}, {""m.refcode"": ""MIBQAR20"", ""m.name"": ""MOF-5"", ""m.color"": ""colorless""}, {""m.refcode"": ""OFEDAH"", ""m.name"": ""GR-MOF-5"", ""m.color"": ""light green""}, {""m.refcode"": ""OMUKUE"", ""m.name"": ""TPMOF-5"", ""m.color"": ""yellow""}, {""m.refcode"": ""OTECEX"", ""m.name"": ""\u0394-MOF-520 unknown solvate"", ""m.color"": ""colorless""}, {""m.refcode"": ""OTECUN"", ""m.name"": ""\u039b-MOF-520 trimesate unknown solvate"", ""m.color"": ""colorless""}, {""m.refcode"": ""OTEDEY"", ""m.name"": ""\u039b-MOF-520 3-(t-butoxycarbonylamino)propan-1,2-diolato unknown solvate"", ""m.color"": ""colorless""}, {""m.refcode"": ""OTEDOI"", ""m.name"": ""\u039b-MOF-520 unknown solvate"", ""m.color"": ""colorless""}, {""m.refcode"": ""OTEDUO"", ""m.name"": ""\u039b-MOF-520 methanolate unknown solvate"", ""m.color"": ""colorless""}, {""m.refcode"": ""QEFWUV"", ""m.name"": ""MOF-545"", ""m.color"": ""red brown""}, {""m.refcode"": ""QOXQEC"", ""m.name"": ""-MOF-520-24"", ""m.color"": ""colorless""}, {""m.refcode"": ""QOXQIG"", ""m.name"": ""-MOF-520-25"", ""m.color"": ""colorless""}, {""m.refcode"": ""QOXQUS"", ""m.name"": ""-MOF-520-27"", ""m.color"": ""colorless""}, {""m.refcode"": ""QOXRAZ"", ""m.name"": ""-MOF-520-28"", ""m.color"": ""colorless""}, {""m.refcode"": ""QOXRIH"", ""m.name"": ""-MOF-520-31-activated"", ""m.color"": ""colorless""}, {""m.refcode"": ""QOXRON"", ""m.name"": ""-MOF-520-S-32"", ""m.color"": ""colorless""}, {""m.refcode"": ""QOXSAA"", ""m.name"": ""-MOF-520-22"", ""m.color"": ""colorless""}, {""m.refcode"": ""QOXSOO"", ""m.name"": ""-MOF-520-R-32"", ""m.color"": ""colorless""}, {""m.refcode"": ""QOXSUU"", ""m.name"": ""\u0394-MOF-520-17"", ""m.color"": ""colorless""}, {""m.refcode"": ""QOXTOP"", ""m.name"": ""\u0394-MOF-520-21"", ""m.color"": ""colorless""}, {""m.refcode"": ""QOXVEH"", ""m.name"": ""-MOF-520 N,N-dimethylformamide solvate"", ""m.color"": ""colorless""}, {""m.refcode"": ""RIXPOF"", ""m.name"": ""MOF-519"", ""m.color"": ""colorless""}, {""m.refcode"": ""RUVKAV"", ""m.name"": ""catena-[(\u03bc8-5,5'-Buta-1,3-diyne-1,4-diyldibenzene-1,3-dicarboxylato)-diaqua-di-copper(ii) dimethylformamide solvate trihydrate]|MOF-505"", ""m.color"": ""green""}, {""m.refcode"": ""SAHYIK"", ""m.name"": ""MOF-5|Teaching Subset: MOFs"", ""m.color"": """"}, {""m.refcode"": ""SUFJEK"", ""m.name"": ""PMOF-55"", ""m.color"": ""colorless""}, {""m.refcode"": ""TIHROU"", ""m.name"": ""MOF-591"", ""m.color"": ""light yellow""}, {""m.refcode"": ""TIHRUA"", ""m.name"": ""MOF-592"", ""m.color"": ""light yellow""}, {""m.refcode"": ""TIHTUC"", ""m.name"": ""MOF-590"", ""m.color"": """"}, {""m.refcode"": ""VUSKEA01"", ""m.name"": ""MOF-5"", ""m.color"": """"}]"
What is the most commonly employed synthesis name in the MOF database?,"MATCH (n:Synthesis_Procedure)-[:has_publication]-() RETURN n.name, count(n) as freq ORDER BY freq DESC LIMIT 1",76,2,"[{""n.name"": """", ""freq"": 1362}]"
What is the solvent utilized in the creation of HKUST-1?,MATCH (s:Synthesis_Procedure)-[:has_publication]->(:Publication)<-[:has_publication]-(m:MOF) MATCH (s)-[:has_solvent_precursor]->(mp:Synthesis_Solvent_Precursor) WHERE m.name CONTAINS 'HKUST-1' RETURN mp.name,104,1,"[{""mp.name"": ""N,N-dimethylformamide""}, {""mp.name"": ""/ethanol""}, {""mp.name"": ""DMF""}, {""mp.name"": ""/H2O""}, {""mp.name"": ""N,N-dimethylformamide""}, {""mp.name"": ""/ethanol""}, {""mp.name"": ""DMF""}, {""mp.name"": ""/H2O""}]"
In which year the synthesis procedure and properties of HKUST-1 was published?,MATCH (m:MOF)-[:has_publication]-(p:Publication)-[:has_publication]-(s:Synthesis_Procedure) WHERE m.name CONTAINS 'HKUST-1' RETURN p.year,98,0,"[{""p.year"": 2009}, {""p.year"": 2009}]"
What is the identity of the metal employed in the production of MOF-5?,"MATCH (m:MOF {name: ""MOF-5""})-[:has_metal]->(metal:Metal) RETURN DISTINCT metal.name;",146,2,"[{""metal.name"": ""[Zn][O]([Zn])([Zn])[Zn]""}]"
What is the denomination of time used in the production of MOF-3?,"MATCH (m:MOF)-[:has_publication]->(:Publication)<-[:has_publication]-(s:Synthesis_Procedure)-[:has_time]->(st:Synthesis_Time) WHERE m.name CONTAINS 'MOF-3' RETURN st.Value, st.Unit",90,3,"[{""st.Value"": ""72"", ""st.Unit"": ""h1.0""}, {""st.Value"": ""72"", ""st.Unit"": ""h1.0""}, {""st.Value"": ""48.0"", ""st.Unit"": ""h1.0""}, {""st.Value"": ""48.0"", ""st.Unit"": ""h1.0""}, {""st.Value"": ""48.0"", ""st.Unit"": ""h1.0""}]"
"How much void space, as a percentage, does the MOF IRMOF-74 possess?","MATCH (m:MOF) WHERE m.name CONTAINS 'IRMOF-74' RETURN m.refcode, m.name, m.percentage_void_space ORDER BY m.percentage_void_space",9,1,"[{""m.refcode"": ""RAVWOC"", ""m.name"": ""IRMOF-74-V-hex"", ""m.percentage_void_space"": 66.164}, {""m.refcode"": ""RAVWAO"", ""m.name"": ""IRMOF-74-III"", ""m.percentage_void_space"": 66.538}, {""m.refcode"": ""RAVVUH"", ""m.name"": ""IRMOF-74-II"", ""m.percentage_void_space"": 67.191}, {""m.refcode"": ""GINYIO"", ""m.name"": ""Ni-IRMOF-74-III"", ""m.percentage_void_space"": 67.223}, {""m.refcode"": ""GINYAG"", ""m.name"": ""Ni-IRMOF-74-II"", ""m.percentage_void_space"": 67.715}, {""m.refcode"": ""RAVWES"", ""m.name"": ""IRMOF-74-IV"", ""m.percentage_void_space"": 72.939}, {""m.refcode"": ""GINYOU"", ""m.name"": ""Ni-IRMOF-74-IV"", ""m.percentage_void_space"": 72.971}, {""m.refcode"": ""RAVXET"", ""m.name"": ""IRMOF-74-VI-oeg"", ""m.percentage_void_space"": 75.375}, {""m.refcode"": ""GINYUA"", ""m.name"": ""Ni-IRMOF-74-V"", ""m.percentage_void_space"": 76.732}, {""m.refcode"": ""RAVXAP"", ""m.name"": ""IRMOF-74-VII"", ""m.percentage_void_space"": 78.578}, {""m.refcode"": ""RAVWUI"", ""m.name"": ""IRMOF-74-VI"", ""m.percentage_void_space"": 79.822}, {""m.refcode"": ""RAVXIX"", ""m.name"": ""IRMOF-74-IX"", ""m.percentage_void_space"": 83.153}, {""m.refcode"": ""RAVXOD"", ""m.name"": ""IRMOF-74-XI"", ""m.percentage_void_space"": 85.617}]"
Which journal has the most published articles on MOF-5?,"MATCH (:MOF {name: 'MOF-5'})-[:has_publication]->(p:Publication)-[:in_journal]-(j:Journal) RETURN j.name, COUNT(j) ORDER BY COUNT(j) DESC LIMIT 1;",134,1,"[{""j.name"": ""J.Phys.Chem.C"", ""COUNT(j)"": 21}]"
Can you provide the length of the b-axis for the unit cell of MOFs 'HKUST-1'?,"MATCH (m:MOF) WHERE m.name CONTAINS 'HKUST-1' RETURN m.refcode, m.name, m.cell_lengths",43,2,"[{""m.refcode"": ""DOTSOV42"", ""m.name"": ""HKUST-1"", ""m.cell_lengths"": ""CellLengths(a=26.287910000000004, b=26.287910000000004, c=26.287910000000004)""}, {""m.refcode"": ""FIQCEN"", ""m.name"": ""HKUST-1|Teaching Subset: MOFs"", ""m.cell_lengths"": ""CellLengths(a=26.343, b=26.343, c=26.343)""}, {""m.refcode"": ""FUNGAZ"", ""m.name"": ""HKUST-1 (as synthesised)"", ""m.cell_lengths"": ""CellLengths(a=26.3518, b=26.3518, c=26.3518)""}, {""m.refcode"": ""LUDLED"", ""m.name"": ""HKUST-1"", ""m.cell_lengths"": ""CellLengths(a=26.315, b=26.315, c=26.315)""}, {""m.refcode"": ""WULJUJ"", ""m.name"": ""HKUST-1 0.56(dideuteroacetylene)"", ""m.cell_lengths"": ""CellLengths(a=26.3256, b=26.3256, c=26.3256)""}]"
What is the name of the most frequently referenced MOF in the database?,"MATCH (m:MOF) WHERE m.name <> """" WITH m.name AS name, count(*) AS frequency ORDER BY frequency DESC LIMIT 1 RETURN name",8,1,"[{""name"": ""CPO-27-Cu""}]"
What is the formula of the metal reagent utilized in the synthesis of HKUST-1?,MATCH (s:Synthesis_Procedure)-[:has_publication]->(:Publication)<-[:has_publication]-(m:MOF) MATCH (s)-[:has_metal_precursor]->(mp:Synthesis_Metal_Precursor) WHERE m.name CONTAINS 'HKUST-1' RETURN mp.formul,101,3,"[{""mp.formul"": null}, {""mp.formul"": null}]"
What is the synthesis property that has the lowest value among all the MOFs 'MOF-3'?,"MATCH (m:MOF)-[:has_publication]->(:Publication)<-[:has_publication]-(s:Synthesis_Procedure)-[:has_property]->(p:Synthesis_Property) WHERE m.name CONTAINS 'MOF-3' WITH toFloat(p.value) AS val WITH min(val) as min MATCH (m1:MOF)-[:has_publication]->(:Publication)<-[:has_publication]-(s1:Synthesis_Procedure)-[:has_property]->(p1:Synthesis_Property)  WHERE (m1.name CONTAINS 'MOF-3') and (toFloat(p1.value)=min) RETURN p1.prop_id, p1.prop, p1.value",122,1,"[{""p1.prop_id"": ""MIsyn8200_prop0"", ""p1.prop"": ""yield"", ""p1.value"": ""4.99""}]"
Which synthesis name is the most frequently used in the database?,"MATCH (n:Synthesis_Procedure)-[:has_publication]-() RETURN n.name, count(n) as freq ORDER BY freq DESC LIMIT 1",76,1,"[{""n.name"": """", ""freq"": 1362}]"
Give me the density of the MOF HKUST-1.,"MATCH (m:MOF) WHERE m.name CONTAINS 'HKUST-1' RETURN m.refcode, m.name, m.density",11,3,"[{""m.refcode"": ""DOTSOV42"", ""m.name"": ""HKUST-1"", ""m.density"": 0.885}, {""m.refcode"": ""FIQCEN"", ""m.name"": ""HKUST-1|Teaching Subset: MOFs"", ""m.density"": 1.219}, {""m.refcode"": ""FUNGAZ"", ""m.name"": ""HKUST-1 (as synthesised)"", ""m.density"": 0.957}, {""m.refcode"": ""LUDLED"", ""m.name"": ""HKUST-1"", ""m.density"": 1.145}, {""m.refcode"": ""WULJUJ"", ""m.name"": ""HKUST-1 0.56(dideuteroacetylene)"", ""m.density"": 0.95}]"
What is the journal with the highest number of publications about MOF-5?,"MATCH (:MOF {name: 'MOF-5'})-[:has_publication]->(p:Publication)-[:in_journal]-(j:Journal) RETURN j.name, COUNT(j) ORDER BY COUNT(j) DESC LIMIT 1;",134,0,"[{""j.name"": ""J.Phys.Chem.C"", ""COUNT(j)"": 21}]"
Which organic linker is most frequently used to synthesize MOFs with the same space group as MOF-5?,"MATCH (m1:MOF)-[:has_spaceGroup]->(s:Space_Group)-[:has_spaceGroup]-(m2:MOF)-[:has_organicLinker]->(o) WITH o.name as organicLinker, count(distinct m2) as numSynthesized ORDER BY numSynthesized DESC LIMIT 1 RETURN organicLinker;",143,1,"[{""organicLinker"": ""[O-]C(=O)c1cc([O])c(cc1[O])C(=O)[O-]""}]"
What is the r_factor of the MOF with the name 'MOF-5'?,"MATCH (m:MOF) WHERE m.name CONTAINS 'MOF-5' RETURN m.refcode, m.name, m.r_factor",35,3,"[{""m.refcode"": ""FAYPUS"", ""m.name"": ""DMOF-5"", ""m.r_factor"": 10.93}, {""m.refcode"": ""LASYOU"", ""m.name"": ""MOF-505"", ""m.r_factor"": 3.61}, {""m.refcode"": ""MIBQAR"", ""m.name"": ""MOF-5"", ""m.r_factor"": 4.88}, {""m.refcode"": ""MIBQAR01"", ""m.name"": ""MOF-5"", ""m.r_factor"": 4.05}, {""m.refcode"": ""MIBQAR02"", ""m.name"": ""MOF-5"", ""m.r_factor"": 3.61}, {""m.refcode"": ""MIBQAR03"", ""m.name"": ""MOF-5"", ""m.r_factor"": 3.3000000000000003}, {""m.refcode"": ""MIBQAR04"", ""m.name"": ""MOF-5"", ""m.r_factor"": 2.97}, {""m.refcode"": ""MIBQAR05"", ""m.name"": ""MOF-5"", ""m.r_factor"": 3.14}, {""m.refcode"": ""MIBQAR06"", ""m.name"": ""MOF-5"", ""m.r_factor"": 2.97}, {""m.refcode"": ""MIBQAR07"", ""m.name"": ""MOF-5"", ""m.r_factor"": 3.11}, {""m.refcode"": ""MIBQAR08"", ""m.name"": ""MOF-5"", ""m.r_factor"": 3.34}, {""m.refcode"": ""MIBQAR09"", ""m.name"": ""MOF-5"", ""m.r_factor"": 3.15}, {""m.refcode"": ""MIBQAR10"", ""m.name"": ""MOF-5"", ""m.r_factor"": 3.14}, {""m.refcode"": ""MIBQAR11"", ""m.name"": ""MOF-5"", ""m.r_factor"": 3.13}, {""m.refcode"": ""MIBQAR12"", ""m.name"": ""MOF-5"", ""m.r_factor"": 3.13}, {""m.refcode"": ""MIBQAR13"", ""m.name"": ""MOF-5"", ""m.r_factor"": 3.26}, {""m.refcode"": ""MIBQAR14"", ""m.name"": ""MOF-5"", ""m.r_factor"": 3.21}, {""m.refcode"": ""MIBQAR15"", ""m.name"": ""MOF-5"", ""m.r_factor"": 3.09}, {""m.refcode"": ""MIBQAR16"", ""m.name"": ""MOF-5"", ""m.r_factor"": 3.6}, {""m.refcode"": ""MIBQAR17"", ""m.name"": ""MOF-5"", ""m.r_factor"": 3.28}, {""m.refcode"": ""MIBQAR18"", ""m.name"": ""MOF-5"", ""m.r_factor"": 6.9}, {""m.refcode"": ""MIBQAR19"", ""m.name"": ""MOF-5"", ""m.r_factor"": 3.1}, {""m.refcode"": ""MIBQAR20"", ""m.name"": ""MOF-5"", ""m.r_factor"": 3.46}, {""m.refcode"": ""OFEDAH"", ""m.name"": ""GR-MOF-5"", ""m.r_factor"": 4.45}, {""m.refcode"": ""OMUKUE"", ""m.name"": ""TPMOF-5"", ""m.r_factor"": 5.0600000000000005}, {""m.refcode"": ""OTECEX"", ""m.name"": ""\u0394-MOF-520 unknown solvate"", ""m.r_factor"": 3.39}, {""m.refcode"": ""OTECUN"", ""m.name"": ""\u039b-MOF-520 trimesate unknown solvate"", ""m.r_factor"": 6.2}, {""m.refcode"": ""OTEDEY"", ""m.name"": ""\u039b-MOF-520 3-(t-butoxycarbonylamino)propan-1,2-diolato unknown solvate"", ""m.r_factor"": 5.23}, {""m.refcode"": ""OTEDOI"", ""m.name"": ""\u039b-MOF-520 unknown solvate"", ""m.r_factor"": 2.9}, {""m.refcode"": ""OTEDUO"", ""m.name"": ""\u039b-MOF-520 methanolate unknown solvate"", ""m.r_factor"": 3.34}, {""m.refcode"": ""QEFWUV"", ""m.name"": ""MOF-545"", ""m.r_factor"": 7.58}, {""m.refcode"": ""QOXQEC"", ""m.name"": ""-MOF-520-24"", ""m.r_factor"": 3.54}, {""m.refcode"": ""QOXQIG"", ""m.name"": ""-MOF-520-25"", ""m.r_factor"": 4.76}, {""m.refcode"": ""QOXQUS"", ""m.name"": ""-MOF-520-27"", ""m.r_factor"": 4.91}, {""m.refcode"": ""QOXRAZ"", ""m.name"": ""-MOF-520-28"", ""m.r_factor"": 5.5600000000000005}, {""m.refcode"": ""QOXRIH"", ""m.name"": ""-MOF-520-31-activated"", ""m.r_factor"": 5.32}, {""m.refcode"": ""QOXRON"", ""m.name"": ""-MOF-520-S-32"", ""m.r_factor"": 7.95}, {""m.refcode"": ""QOXSAA"", ""m.name"": ""-MOF-520-22"", ""m.r_factor"": 2.54}, {""m.refcode"": ""QOXSOO"", ""m.name"": ""-MOF-520-R-32"", ""m.r_factor"": 8.73}, {""m.refcode"": ""QOXSUU"", ""m.name"": ""\u0394-MOF-520-17"", ""m.r_factor"": 4.94}, {""m.refcode"": ""QOXTOP"", ""m.name"": ""\u0394-MOF-520-21"", ""m.r_factor"": 6.54}, {""m.refcode"": ""QOXVEH"", ""m.name"": ""-MOF-520 N,N-dimethylformamide solvate"", ""m.r_factor"": 6.82}, {""m.refcode"": ""RIXPOF"", ""m.name"": ""MOF-519"", ""m.r_factor"": 11.12}, {""m.refcode"": ""RUVKAV"", ""m.name"": ""catena-[(\u03bc8-5,5'-Buta-1,3-diyne-1,4-diyldibenzene-1,3-dicarboxylato)-diaqua-di-copper(ii) dimethylformamide solvate trihydrate]|MOF-505"", ""m.r_factor"": 6.2700000000000005}, {""m.refcode"": ""SAHYIK"", ""m.name"": ""MOF-5|Teaching Subset: MOFs"", ""m.r_factor"": 10.99}, {""m.refcode"": ""SUFJEK"", ""m.name"": ""PMOF-55"", ""m.r_factor"": 4.17}, {""m.refcode"": ""TIHROU"", ""m.name"": ""MOF-591"", ""m.r_factor"": 8.71}, {""m.refcode"": ""TIHRUA"", ""m.name"": ""MOF-592"", ""m.r_factor"": 5.66}, {""m.refcode"": ""TIHTUC"", ""m.name"": ""MOF-590"", ""m.r_factor"": 6.03}, {""m.refcode"": ""VUSKEA01"", ""m.name"": ""MOF-5"", ""m.r_factor"": 5.86}]"
What is the symbol used to represent the synthesis procedure for HKUST-1?,MATCH (m:MOF)-[:has_publication]-(p:Publication)-[:has_publication]-(s:Synthesis_Procedure) WHERE m.name CONTAINS 'HKUST-1' RETURN s.symbol,99,0,"[{""s.symbol"": """"}, {""s.symbol"": """"}]"
