question,query,qsq_list_idx,question_idx,answer
Give me the angles between the edges of the unit cell of a MOF 'IRMOF'.,"MATCH (m:MOF) WHERE m.name CONTAINS 'IRMOF' RETURN m.refcode, m.name, m.cell_angles",23,3,"[{""m.refcode"": ""GINYAG"", ""m.name"": ""Ni-IRMOF-74-II"", ""m.cell_angles"": ""CellAngles(alpha=90.0, beta=90.0, gamma=119.99999999999999)""}, {""m.refcode"": ""GINYIO"", ""m.name"": ""Ni-IRMOF-74-III"", ""m.cell_angles"": ""CellAngles(alpha=90.0, beta=90.0, gamma=119.99999999999999)""}, {""m.refcode"": ""GINYOU"", ""m.name"": ""Ni-IRMOF-74-IV"", ""m.cell_angles"": ""CellAngles(alpha=90.0, beta=90.0, gamma=119.99999999999999)""}, {""m.refcode"": ""GINYUA"", ""m.name"": ""Ni-IRMOF-74-V"", ""m.cell_angles"": ""CellAngles(alpha=90.0, beta=90.0, gamma=119.99999999999999)""}, {""m.refcode"": ""HOLQAC"", ""m.name"": ""\u03b1-IRMOF-3-AMPh"", ""m.cell_angles"": ""CellAngles(alpha=90.0, beta=90.0, gamma=90.0)""}, {""m.refcode"": ""NODTEH"", ""m.name"": ""IRMOF-23terp"", ""m.cell_angles"": ""CellAngles(alpha=90.0, beta=90.0, gamma=90.0)""}, {""m.refcode"": ""NODTIL"", ""m.name"": ""IRMOF-25terPh"", ""m.cell_angles"": ""CellAngles(alpha=90.0, beta=90.0, gamma=90.0)""}, {""m.refcode"": ""NODTOR"", ""m.name"": ""IRMOF-pentane"", ""m.cell_angles"": ""CellAngles(alpha=90.0, beta=90.0, gamma=90.0)""}, {""m.refcode"": ""NUVYEK"", ""m.name"": ""IRMOF-61"", ""m.cell_angles"": ""CellAngles(alpha=90.0, beta=90.0, gamma=90.0)""}, {""m.refcode"": ""NUVYIO"", ""m.name"": ""IRMOF-62"", ""m.cell_angles"": ""CellAngles(alpha=90.0, beta=90.0, gamma=119.99999999999999)""}, {""m.refcode"": ""PIWLIT"", ""m.name"": ""IRMOF-9"", ""m.cell_angles"": ""CellAngles(alpha=90.0, beta=90.229, gamma=90.0)""}, {""m.refcode"": ""RAVVUH"", ""m.name"": ""IRMOF-74-II"", ""m.cell_angles"": ""CellAngles(alpha=90.0, beta=90.0, gamma=119.99999999999999)""}, {""m.refcode"": ""RAVWAO"", ""m.name"": ""IRMOF-74-III"", ""m.cell_angles"": ""CellAngles(alpha=90.0, beta=90.0, gamma=119.99999999999999)""}, {""m.refcode"": ""RAVWES"", ""m.name"": ""IRMOF-74-IV"", ""m.cell_angles"": ""CellAngles(alpha=90.0, beta=90.0, gamma=119.99999999999999)""}, {""m.refcode"": ""RAVWOC"", ""m.name"": ""IRMOF-74-V-hex"", ""m.cell_angles"": ""CellAngles(alpha=90.0, beta=90.0, gamma=119.99999999999999)""}, {""m.refcode"": ""RAVWUI"", ""m.name"": ""IRMOF-74-VI"", ""m.cell_angles"": ""CellAngles(alpha=90.0, beta=90.0, gamma=119.99999999999999)""}, {""m.refcode"": ""RAVXAP"", ""m.name"": ""IRMOF-74-VII"", ""m.cell_angles"": ""CellAngles(alpha=90.0, beta=90.0, gamma=119.99999999999999)""}, {""m.refcode"": ""RAVXET"", ""m.name"": ""IRMOF-74-VI-oeg"", ""m.cell_angles"": ""CellAngles(alpha=90.0, beta=90.0, gamma=119.99999999999999)""}, {""m.refcode"": ""RAVXIX"", ""m.name"": ""IRMOF-74-IX"", ""m.cell_angles"": ""CellAngles(alpha=90.0, beta=90.0, gamma=119.99999999999999)""}, {""m.refcode"": ""RAVXOD"", ""m.name"": ""IRMOF-74-XI"", ""m.cell_angles"": ""CellAngles(alpha=90.0, beta=90.0, gamma=119.99999999999999)""}, {""m.refcode"": ""RUTPAY01"", ""m.name"": ""IRMOF-77"", ""m.cell_angles"": ""CellAngles(alpha=90.0, beta=90.0, gamma=119.99999999999999)""}, {""m.refcode"": ""WORKUL"", ""m.name"": ""INT-IRMOF-8-C"", ""m.cell_angles"": ""CellAngles(alpha=70.65, beta=70.05, gamma=69.86)""}, {""m.refcode"": ""WORLAS"", ""m.name"": ""INT-IRMOF-8-B"", ""m.cell_angles"": ""CellAngles(alpha=71.64500000000001, beta=70.305, gamma=68.98100000000001)""}]"
What is the formula of the metal precursor used in the synthesis of MOF-3?,MATCH (m:MOF)-[:has_publication]->(:Publication)<-[:has_publication]-(s:Synthesis_Procedure)-[:has_metal_precursor]->(mp:Synthesis_Metal_Precursor) WHERE m.name CONTAINS 'MOF-3' RETURN DISTINCT mp.formula,82,0,"[{""mp.formula"": """"}, {""mp.formula"": ""PrCl3$7H2O""}, {""mp.formula"": ""ZnN2O6$6H2O""}, {""mp.formula"": ""CdN2O6$4H2O""}]"
"Among all the MOFs in the database, which name appears the most often and can be considered the most popular?","MATCH (m:MOF) WHERE m.name <> """" WITH m.name AS name, count(*) AS frequency ORDER BY frequency DESC LIMIT 1 RETURN name",8,2,"[{""name"": ""CPO-27-Cu""}]"
What are the edge angle measurements of the unit cell in MOF 'IRMOF'?,"MATCH (m:MOF) WHERE m.name CONTAINS 'IRMOF' RETURN m.refcode, m.name, m.cell_angles",23,2,"[{""m.refcode"": ""GINYAG"", ""m.name"": ""Ni-IRMOF-74-II"", ""m.cell_angles"": ""CellAngles(alpha=90.0, beta=90.0, gamma=119.99999999999999)""}, {""m.refcode"": ""GINYIO"", ""m.name"": ""Ni-IRMOF-74-III"", ""m.cell_angles"": ""CellAngles(alpha=90.0, beta=90.0, gamma=119.99999999999999)""}, {""m.refcode"": ""GINYOU"", ""m.name"": ""Ni-IRMOF-74-IV"", ""m.cell_angles"": ""CellAngles(alpha=90.0, beta=90.0, gamma=119.99999999999999)""}, {""m.refcode"": ""GINYUA"", ""m.name"": ""Ni-IRMOF-74-V"", ""m.cell_angles"": ""CellAngles(alpha=90.0, beta=90.0, gamma=119.99999999999999)""}, {""m.refcode"": ""HOLQAC"", ""m.name"": ""\u03b1-IRMOF-3-AMPh"", ""m.cell_angles"": ""CellAngles(alpha=90.0, beta=90.0, gamma=90.0)""}, {""m.refcode"": ""NODTEH"", ""m.name"": ""IRMOF-23terp"", ""m.cell_angles"": ""CellAngles(alpha=90.0, beta=90.0, gamma=90.0)""}, {""m.refcode"": ""NODTIL"", ""m.name"": ""IRMOF-25terPh"", ""m.cell_angles"": ""CellAngles(alpha=90.0, beta=90.0, gamma=90.0)""}, {""m.refcode"": ""NODTOR"", ""m.name"": ""IRMOF-pentane"", ""m.cell_angles"": ""CellAngles(alpha=90.0, beta=90.0, gamma=90.0)""}, {""m.refcode"": ""NUVYEK"", ""m.name"": ""IRMOF-61"", ""m.cell_angles"": ""CellAngles(alpha=90.0, beta=90.0, gamma=90.0)""}, {""m.refcode"": ""NUVYIO"", ""m.name"": ""IRMOF-62"", ""m.cell_angles"": ""CellAngles(alpha=90.0, beta=90.0, gamma=119.99999999999999)""}, {""m.refcode"": ""PIWLIT"", ""m.name"": ""IRMOF-9"", ""m.cell_angles"": ""CellAngles(alpha=90.0, beta=90.229, gamma=90.0)""}, {""m.refcode"": ""RAVVUH"", ""m.name"": ""IRMOF-74-II"", ""m.cell_angles"": ""CellAngles(alpha=90.0, beta=90.0, gamma=119.99999999999999)""}, {""m.refcode"": ""RAVWAO"", ""m.name"": ""IRMOF-74-III"", ""m.cell_angles"": ""CellAngles(alpha=90.0, beta=90.0, gamma=119.99999999999999)""}, {""m.refcode"": ""RAVWES"", ""m.name"": ""IRMOF-74-IV"", ""m.cell_angles"": ""CellAngles(alpha=90.0, beta=90.0, gamma=119.99999999999999)""}, {""m.refcode"": ""RAVWOC"", ""m.name"": ""IRMOF-74-V-hex"", ""m.cell_angles"": ""CellAngles(alpha=90.0, beta=90.0, gamma=119.99999999999999)""}, {""m.refcode"": ""RAVWUI"", ""m.name"": ""IRMOF-74-VI"", ""m.cell_angles"": ""CellAngles(alpha=90.0, beta=90.0, gamma=119.99999999999999)""}, {""m.refcode"": ""RAVXAP"", ""m.name"": ""IRMOF-74-VII"", ""m.cell_angles"": ""CellAngles(alpha=90.0, beta=90.0, gamma=119.99999999999999)""}, {""m.refcode"": ""RAVXET"", ""m.name"": ""IRMOF-74-VI-oeg"", ""m.cell_angles"": ""CellAngles(alpha=90.0, beta=90.0, gamma=119.99999999999999)""}, {""m.refcode"": ""RAVXIX"", ""m.name"": ""IRMOF-74-IX"", ""m.cell_angles"": ""CellAngles(alpha=90.0, beta=90.0, gamma=119.99999999999999)""}, {""m.refcode"": ""RAVXOD"", ""m.name"": ""IRMOF-74-XI"", ""m.cell_angles"": ""CellAngles(alpha=90.0, beta=90.0, gamma=119.99999999999999)""}, {""m.refcode"": ""RUTPAY01"", ""m.name"": ""IRMOF-77"", ""m.cell_angles"": ""CellAngles(alpha=90.0, beta=90.0, gamma=119.99999999999999)""}, {""m.refcode"": ""WORKUL"", ""m.name"": ""INT-IRMOF-8-C"", ""m.cell_angles"": ""CellAngles(alpha=70.65, beta=70.05, gamma=69.86)""}, {""m.refcode"": ""WORLAS"", ""m.name"": ""INT-IRMOF-8-B"", ""m.cell_angles"": ""CellAngles(alpha=71.64500000000001, beta=70.305, gamma=68.98100000000001)""}]"
What are the conditions of the synthesis operation used in the synthesis of MOF-3?,"MATCH (m:MOF)-[:has_publication]->(:Publication)<-[:has_publication]-(s:Synthesis_Procedure)-[:has_operation]->(so:Synthesis_Operation)-[:has_condition]->(soc:Synthesis_Operation_Condition) WHERE m.name CONTAINS 'MOF-3' RETURN soc.Property, soc.Value, soc.Unit, soc.order",94,0,"[{""soc.Property"": ""Time"", ""soc.Value"": ""72"", ""soc.Unit"": ""h1.0"", ""soc.order"": 1}, {""soc.Property"": ""Temperature"", ""soc.Value"": ""120"", ""soc.Unit"": ""\u00b0C1.0"", ""soc.order"": 0}, {""soc.Property"": ""Temperature"", ""soc.Value"": ""293"", ""soc.Unit"": ""K1.0"", ""soc.order"": 0}, {""soc.Property"": ""Time"", ""soc.Value"": ""72"", ""soc.Unit"": ""h1.0"", ""soc.order"": 1}, {""soc.Property"": ""Temperature"", ""soc.Value"": ""180"", ""soc.Unit"": ""\u00b0C1.0"", ""soc.order"": 0}, {""soc.Property"": ""Temperature"", ""soc.Value"": ""293"", ""soc.Unit"": ""K1.0"", ""soc.order"": 0}, {""soc.Property"": ""Time"", ""soc.Value"": ""3"", ""soc.Unit"": ""days1.0"", ""soc.order"": 0}, {""soc.Property"": ""Temperature"", ""soc.Value"": ""293"", ""soc.Unit"": ""K1.0"", ""soc.order"": 1}, {""soc.Property"": ""Time"", ""soc.Value"": ""2"", ""soc.Unit"": ""days1.0"", ""soc.order"": 1}, {""soc.Property"": ""Temperature"", ""soc.Value"": ""80"", ""soc.Unit"": ""\u00b0C1.0"", ""soc.order"": 0}, {""soc.Property"": ""Temperature"", ""soc.Value"": ""80"", ""soc.Unit"": ""\u00b0C1.0"", ""soc.order"": 0}, {""soc.Property"": ""Time"", ""soc.Value"": ""2"", ""soc.Unit"": ""days1.0"", ""soc.order"": 1}, {""soc.Property"": ""Time"", ""soc.Value"": ""2"", ""soc.Unit"": ""days1.0"", ""soc.order"": 1}, {""soc.Property"": ""Temperature"", ""soc.Value"": ""125"", ""soc.Unit"": ""\u00b0C1.0"", ""soc.order"": 0}]"
Which MOF has the most individuals contributing to its publications?,"MATCH (m:MOF)-[:has_publication]->(p:Publication)-[:has_author]->(a:Author) WITH m, count(distinct a) as numAuth RETURN m.refcode, numAuth ORDER BY numAuth DESC LIMIT 1;",158,2,"[{""m.refcode"": ""JOYKUF"", ""numAuth"": 26}]"
What is the count of synthesis operation conditions that correspond to MOFs named 'MOF-3'?,MATCH (m:MOF)-[:has_publication]->(:Publication)<-[:has_publication]-(s:Synthesis_Procedure)-[:has_operation]->(o:Synthesis_Operation)-[:has_condition]->(c:Synthesis_Operation_Condition) WHERE m.name CONTAINS 'MOF-3' RETURN count(c),111,3,"[{""count(c)"": 14}]"
What is the MOF 'MOF-3' synthesis operation that involves the highest number of conditions?,"MATCH (m:MOF)-[:has_publication]->(:Publication)<-[:has_publication]-(s:Synthesis_Procedure)-[:has_operation]->(o:Synthesis_Operation)-[:has_condition]->(c:Synthesis_Operation_Condition) WHERE m.name CONTAINS 'MOF-3' RETURN o.name, COUNT(c) ORDER BY COUNT(c) DESC LIMIT 1",120,1,"[{""o.name"": ""wait"", ""COUNT(c)"": 6}]"
What is the minimum duration of any synthesis process associated with MOFs named 'MOF-3'?,MATCH (m:MOF)-[:has_publication]->(:Publication)<-[:has_publication]-(s:Synthesis_Procedure)-[:has_time]->(t:Synthesis_Time) WHERE m.name CONTAINS 'MOF-3' RETURN min(t.Value),113,2,"[{""min(t.Value)"": ""48.0""}]"
What is the least value observed for any synthesis property among all the MOFs 'MOF-3'?,"MATCH (m:MOF)-[:has_publication]->(:Publication)<-[:has_publication]-(s:Synthesis_Procedure)-[:has_property]->(p:Synthesis_Property) WHERE m.name CONTAINS 'MOF-3' WITH toFloat(p.value) AS val WITH min(val) as min MATCH (m1:MOF)-[:has_publication]->(:Publication)<-[:has_publication]-(s1:Synthesis_Procedure)-[:has_property]->(p1:Synthesis_Property)  WHERE (m1.name CONTAINS 'MOF-3') and (toFloat(p1.value)=min) RETURN p1.prop_id, p1.prop, p1.value",122,3,"[{""p1.prop_id"": ""MIsyn8200_prop0"", ""p1.prop"": ""yield"", ""p1.value"": ""4.99""}]"
What is the upper limit of temperature used in the synthesis of MOFs 'MOF-3'?,MATCH (m:MOF)-[:has_publication]->(:Publication)<-[:has_publication]-(s:Synthesis_Procedure)-[:has_temperature]->(t:Synthesis_Temperature) WHERE m.name CONTAINS 'MOF-3' RETURN max(t.Value),124,3,"[{""max(t.Value)"": 453.15}]"
How many MOFs in the family 'Cu-Cu paddlewheels'?,MATCH (m:MOF)-[:has_family]->(f:Family) WHERE f.name CONTAINS 'Cu-Cu paddleWheels' RETURN count(m.refcode),4,0,"[{""count(m.refcode)"": 219}]"
How does the color of MOFs 'HKUST-1' change with different lighting conditions?,"MATCH (m:MOF) WHERE m.name CONTAINS 'HKUST-1' RETURN m.refcode, m.name, m.color",49,3,"[{""m.refcode"": ""DOTSOV42"", ""m.name"": ""HKUST-1"", ""m.color"": """"}, {""m.refcode"": ""FIQCEN"", ""m.name"": ""HKUST-1|Teaching Subset: MOFs"", ""m.color"": ""turquoise""}, {""m.refcode"": ""FUNGAZ"", ""m.name"": ""HKUST-1 (as synthesised)"", ""m.color"": ""light blue""}, {""m.refcode"": ""LUDLED"", ""m.name"": ""HKUST-1"", ""m.color"": ""blue""}, {""m.refcode"": ""WULJUJ"", ""m.name"": ""HKUST-1 0.56(dideuteroacetylene)"", ""m.color"": """"}]"
What is the angle between the a-axis and the b-axis of the unit cell of the MOFs 'HKUST-1'?,"MATCH (m:MOF) WHERE m.name CONTAINS 'HKUST-1' RETURN m.refcode, m.name, m.cell_angles",47,0,"[{""m.refcode"": ""DOTSOV42"", ""m.name"": ""HKUST-1"", ""m.cell_angles"": ""CellAngles(alpha=90.0, beta=90.0, gamma=90.0)""}, {""m.refcode"": ""FIQCEN"", ""m.name"": ""HKUST-1|Teaching Subset: MOFs"", ""m.cell_angles"": ""CellAngles(alpha=90.0, beta=90.0, gamma=90.0)""}, {""m.refcode"": ""FUNGAZ"", ""m.name"": ""HKUST-1 (as synthesised)"", ""m.cell_angles"": ""CellAngles(alpha=90.0, beta=90.0, gamma=90.0)""}, {""m.refcode"": ""LUDLED"", ""m.name"": ""HKUST-1"", ""m.cell_angles"": ""CellAngles(alpha=90.0, beta=90.0, gamma=90.0)""}, {""m.refcode"": ""WULJUJ"", ""m.name"": ""HKUST-1 0.56(dideuteroacetylene)"", ""m.cell_angles"": ""CellAngles(alpha=90.0, beta=90.0, gamma=90.0)""}]"
I'm looking for a list of MOF names that have the word 'IRMOF' in them. Could you give that to me?,MATCH (m:MOF) WHERE m.name CONTAINS 'IRMOF' RETURN m.name,5,2,"[{""m.name"": ""Ni-IRMOF-74-II""}, {""m.name"": ""Ni-IRMOF-74-III""}, {""m.name"": ""Ni-IRMOF-74-IV""}, {""m.name"": ""Ni-IRMOF-74-V""}, {""m.name"": ""\u03b1-IRMOF-3-AMPh""}, {""m.name"": ""IRMOF-23terp""}, {""m.name"": ""IRMOF-25terPh""}, {""m.name"": ""IRMOF-pentane""}, {""m.name"": ""IRMOF-61""}, {""m.name"": ""IRMOF-62""}, {""m.name"": ""IRMOF-9""}, {""m.name"": ""IRMOF-74-II""}, {""m.name"": ""IRMOF-74-III""}, {""m.name"": ""IRMOF-74-IV""}, {""m.name"": ""IRMOF-74-V-hex""}, {""m.name"": ""IRMOF-74-VI""}, {""m.name"": ""IRMOF-74-VII""}, {""m.name"": ""IRMOF-74-VI-oeg""}, {""m.name"": ""IRMOF-74-IX""}, {""m.name"": ""IRMOF-74-XI""}, {""m.name"": ""IRMOF-77""}, {""m.name"": ""INT-IRMOF-8-C""}, {""m.name"": ""INT-IRMOF-8-B""}]"
"Name the journal that published the article regarding the synthesis of the MOF that has the Topology with RCSR code ""sra"" and a name containing ""IRMOF"".","MATCH (m:MOF)-[:has_topology]->(t:Topology {rcsr_code: ""pcu""}), (m)-[:has_publication]->(p:Publication)-[:in_journal]->(j:Journal) WHERE m.name CONTAINS ""IRMOF"" RETURN j.name;",156,3,"[{""j.name"": ""Chem.Commun.""}, {""j.name"": ""Inorg.Chem.""}, {""j.name"": ""Isr.J.Chem.""}, {""j.name"": ""Inorg.Chem.""}, {""j.name"": ""Bull.Korean Chem.Soc.""}, {""j.name"": ""Inorg.Chem.""}, {""j.name"": ""J.Am.Chem.Soc.""}, {""j.name"": ""J.Phys.Chem.C""}, {""j.name"": ""Bull.Korean Chem.Soc.""}, {""j.name"": ""J.Phys.Chem.C""}]"
Can you identify the most popular synthesis name in the MOF database?,"MATCH (n:Synthesis_Procedure)-[:has_publication]-() RETURN n.name, count(n) as freq ORDER BY freq DESC LIMIT 1",76,3,"[{""n.name"": """", ""freq"": 1362}]"
What is the value of z_prime for th MOF 'IRMOF'?,"MATCH (m:MOF) WHERE m.name CONTAINS 'IRMOF' RETURN m.refcode, m.name, m.z_prime",16,0,"[{""m.refcode"": ""GINYAG"", ""m.name"": ""Ni-IRMOF-74-II"", ""m.z_prime"": 0.5}, {""m.refcode"": ""GINYIO"", ""m.name"": ""Ni-IRMOF-74-III"", ""m.z_prime"": 0.5}, {""m.refcode"": ""GINYOU"", ""m.name"": ""Ni-IRMOF-74-IV"", ""m.z_prime"": 1.0}, {""m.refcode"": ""GINYUA"", ""m.name"": ""Ni-IRMOF-74-V"", ""m.z_prime"": 1.0}, {""m.refcode"": ""HOLQAC"", ""m.name"": ""\u03b1-IRMOF-3-AMPh"", ""m.z_prime"": 0.33}, {""m.refcode"": ""NODTEH"", ""m.name"": ""IRMOF-23terp"", ""m.z_prime"": 0.04}, {""m.refcode"": ""NODTIL"", ""m.name"": ""IRMOF-25terPh"", ""m.z_prime"": 0.04}, {""m.refcode"": ""NODTOR"", ""m.name"": ""IRMOF-pentane"", ""m.z_prime"": 0.25}, {""m.refcode"": ""NUVYEK"", ""m.name"": ""IRMOF-61"", ""m.z_prime"": 0.25}, {""m.refcode"": ""NUVYIO"", ""m.name"": ""IRMOF-62"", ""m.z_prime"": 1.0}, {""m.refcode"": ""PIWLIT"", ""m.name"": ""IRMOF-9"", ""m.z_prime"": 1.0}, {""m.refcode"": ""RAVVUH"", ""m.name"": ""IRMOF-74-II"", ""m.z_prime"": 0.5}, {""m.refcode"": ""RAVWAO"", ""m.name"": ""IRMOF-74-III"", ""m.z_prime"": 0.5}, {""m.refcode"": ""RAVWES"", ""m.name"": ""IRMOF-74-IV"", ""m.z_prime"": 1.0}, {""m.refcode"": ""RAVWOC"", ""m.name"": ""IRMOF-74-V-hex"", ""m.z_prime"": 0.5}, {""m.refcode"": ""RAVWUI"", ""m.name"": ""IRMOF-74-VI"", ""m.z_prime"": 1.0}, {""m.refcode"": ""RAVXAP"", ""m.name"": ""IRMOF-74-VII"", ""m.z_prime"": 1.0}, {""m.refcode"": ""RAVXET"", ""m.name"": ""IRMOF-74-VI-oeg"", ""m.z_prime"": 0.5}, {""m.refcode"": ""RAVXIX"", ""m.name"": ""IRMOF-74-IX"", ""m.z_prime"": 1.0}, {""m.refcode"": ""RAVXOD"", ""m.name"": ""IRMOF-74-XI"", ""m.z_prime"": 1.0}, {""m.refcode"": ""RUTPAY01"", ""m.name"": ""IRMOF-77"", ""m.z_prime"": 0.33}, {""m.refcode"": ""WORKUL"", ""m.name"": ""INT-IRMOF-8-C"", ""m.z_prime"": 1.0}, {""m.refcode"": ""WORLAS"", ""m.name"": ""INT-IRMOF-8-B"", ""m.z_prime"": 1.0}]"
Which solvent precursor is used in the synthesis of HKUST-1?,MATCH (s:Synthesis_Procedure)-[:has_publication]->(:Publication)<-[:has_publication]-(m:MOF) MATCH (s)-[:has_solvent_precursor]->(mp:Synthesis_Solvent_Precursor) WHERE m.name CONTAINS 'HKUST-1' RETURN mp.name,104,3,"[{""mp.name"": ""N,N-dimethylformamide""}, {""mp.name"": ""/ethanol""}, {""mp.name"": ""DMF""}, {""mp.name"": ""/H2O""}, {""mp.name"": ""N,N-dimethylformamide""}, {""mp.name"": ""/ethanol""}, {""mp.name"": ""DMF""}, {""mp.name"": ""/H2O""}]"
What is the mean value of synthesis properties for MOFs 'MOF-3' for synthesis procedures that include a heat-related operation in their name?,MATCH (m:MOF)-[:has_publication]->(:Publication)<-[:has_publication]-(s:Synthesis_Procedure)-[:has_operation]->(o:Synthesis_Operation) WHERE toLower(o.name) CONTAINS 'heat' MATCH (s)-[:has_property]->(p:Synthesis_Property) WHERE m.name CONTAINS 'MOF-3' RETURN avg(toFloat(p.value)),126,1,"[{""avg(toFloat(p.value))"": 14.995000000000001}]"
Which metal is used in the synthesis of MOF-5?,"MATCH (m:MOF {name: ""MOF-5""})-[:has_metal]->(metal:Metal) RETURN DISTINCT metal.name;",146,1,"[{""metal.name"": ""[Zn][O]([Zn])([Zn])[Zn]""}]"
Give me the symbol used to indicate the synthesis process of HKUST-1.,MATCH (m:MOF)-[:has_publication]-(p:Publication)-[:has_publication]-(s:Synthesis_Procedure) WHERE m.name CONTAINS 'HKUST-1' RETURN s.symbol,99,3,"[{""s.symbol"": """"}, {""s.symbol"": """"}]"
Can you provide the name of the ligand that was utilized to produce MOFs 'MOF-3'?,"MATCH (m:MOF)-[:has_organicLinker]->(l:Organic_Linker) WHERE m.name CONTAINS 'MOF-3' RETURN m.refcode, m.name, l.name",54,2,"[{""m.refcode"": ""CEFNOT"", ""m.name"": ""she-MOF-3"", ""l.name"": ""[O-]C(=O)c1ccc(cc1)C#Cc1ccc(cc1)c1c(c2ccc(cc2)C#Cc2ccc(cc2)C(=O)[O-])c(c2ccc(cc2)C#Cc2ccc(cc2)C(=O)[O-])c(c(c1c1ccc(cc1)C#Cc1ccc(cc1)C(=O)[O-])c1ccc(cc1)C#Cc1ccc(cc1)C(=O)[O-])c1ccc(cc1)C#Cc1ccc(cc1)C(=O)[O-]""}, {""m.refcode"": ""FAYPIG"", ""m.name"": ""DMOF-3"", ""l.name"": ""CC1=CC2=NN=NC2=C[CH]1""}, {""m.refcode"": ""FEYQIK"", ""m.name"": ""GWMOF-3"", ""l.name"": ""[O-]C(=O)CCCCC(=O)[O-]""}, {""m.refcode"": ""HOLQAC"", ""m.name"": ""\u03b1-IRMOF-3-AMPh"", ""l.name"": ""O=C(c1ccccc1)Nc1cc(ccc1C(=O)[O-])C(=O)[O-]""}, {""m.refcode"": ""KITVEQ"", ""m.name"": ""MOF-3"", ""l.name"": ""[O-]C(=O)[C]1[CH][C](OC[C]2C=Cc3c4[C]2C=CC25c4c(cc3)[CH]C5[CH]2)[CH]C(=C1)C(=O)[O-]""}, {""m.refcode"": ""LAJKUE"", ""m.name"": ""CD-MOF-3"", ""l.name"": ""[O]CC1OC2OC3C(C[O])OC(C(C3[O])[O])OC3C(C[O])OC(C(C3[O])[O])OC3C(C[O])OC(C(C3[O])[O])OC3C(OC(OC4C(OC(OC5C(OC(OC6C(OC(OC1C(C2[O])[O])C([O])C6[O])C[O])C([O])C5[O])C[O])C([O])C4[O])C[O])C(C3[O])[O])C[O]""}, {""m.refcode"": ""MIFGEQ"", ""m.name"": ""TMOF-3"", ""l.name"": ""[O]S(Cc1cc(CS([O])([O])[O])c(cc1CS([O])([O])[O])CS([O])([O])[O])([O])[O]""}, {""m.refcode"": ""PIKYAM"", ""m.name"": ""JUST-3|LMOF-311"", ""l.name"": ""O=CN(C)C""}]"
What is the color of MOFs 'HKUST-1' when viewed under various lighting conditions?,"MATCH (m:MOF) WHERE m.name CONTAINS 'HKUST-1' RETURN m.refcode, m.name, m.color",49,2,"[{""m.refcode"": ""DOTSOV42"", ""m.name"": ""HKUST-1"", ""m.color"": """"}, {""m.refcode"": ""FIQCEN"", ""m.name"": ""HKUST-1|Teaching Subset: MOFs"", ""m.color"": ""turquoise""}, {""m.refcode"": ""FUNGAZ"", ""m.name"": ""HKUST-1 (as synthesised)"", ""m.color"": ""light blue""}, {""m.refcode"": ""LUDLED"", ""m.name"": ""HKUST-1"", ""m.color"": ""blue""}, {""m.refcode"": ""WULJUJ"", ""m.name"": ""HKUST-1 0.56(dideuteroacetylene)"", ""m.color"": """"}]"
Give me the unit of the property in the creation of MOF-3.,"MATCH (m:MOF)-[:has_publication]->(:Publication)<-[:has_publication]-(s:Synthesis_Procedure)-[:has_property]->(sp:Synthesis_Property) WHERE m.name CONTAINS 'MOF-3' RETURN sp.value, sp.unit",92,2,"[{""sp.value"": ""25"", ""sp.unit"": ""%1.0""}, {""sp.value"": ""4.99"", ""sp.unit"": ""%1.0""}, {""sp.value"": ""53"", ""sp.unit"": ""%1.0""}, {""sp.value"": ""57"", ""sp.unit"": ""%1.0""}, {""sp.value"": ""46"", ""sp.unit"": ""%1.0""}]"
What is the name of the solvent precursor used in the synthesis of MOF-3?,MATCH (m:MOF)-[:has_publication]->(:Publication)<-[:has_publication]-(s:Synthesis_Procedure)-[:has_solvent_precursor]->(sp:Synthesis_Solvent_Precursor) WHERE m.name CONTAINS 'MOF-3' RETURN DISTINCT sp.name,85,0,"[{""sp.name"": ""DMF""}, {""sp.name"": ""acetonitrile""}, {""sp.name"": ""MeCN""}, {""sp.name"": ""EtOH""}, {""sp.name"": ""ethanol""}, {""sp.name"": ""dimethylformamide""}, {""sp.name"": ""HNO3""}]"
Which publication details the synthesis process and characteristics of HKUST-1?,"MATCH (m:MOF)-[:has_publication]-(p:Publication)-[:has_publication]-(s:Synthesis_Procedure) WHERE m.name CONTAINS 'HKUST-1' RETURN p.year, p.volume,p.doi",96,1,"[{""p.year"": 2009, ""p.volume"": 131, ""p.doi"": ""10.1021/ja904782h""}, {""p.year"": 2009, ""p.volume"": 131, ""p.doi"": ""10.1021/ja904782h""}]"
What are the 5 journals with the highest number of published MOFs?,"MATCH (mof:MOF)-[:has_publication]-(pub:Publication)-[:in_journal]-(j:Journal) RETURN j.name, count(j) as freq ORDER BY freq DESC LIMIT 5",61,1,"[{""j.name"": ""Inorg.Chem."", ""freq"": 1151}, {""j.name"": ""Cryst.Growth Des."", ""freq"": 1084}, {""j.name"": ""CrystEngComm"", ""freq"": 1025}, {""j.name"": ""J.Am.Chem.Soc."", ""freq"": 718}, {""j.name"": ""Chem.Commun."", ""freq"": 607}]"
List IRMOF MOFs that have Sohncke space group.,"MATCH (m:MOF) WHERE (m.name CONTAINS 'IRMOF') and (m.sohncke_space_group = 'Yes') RETURN m.refcode, m.name, m.sohncke_space_group",12,0,"[{""m.refcode"": ""GINYOU"", ""m.name"": ""Ni-IRMOF-74-IV"", ""m.sohncke_space_group"": ""Yes""}, {""m.refcode"": ""GINYUA"", ""m.name"": ""Ni-IRMOF-74-V"", ""m.sohncke_space_group"": ""Yes""}, {""m.refcode"": ""NUVYIO"", ""m.name"": ""IRMOF-62"", ""m.sohncke_space_group"": ""Yes""}, {""m.refcode"": ""RAVWES"", ""m.name"": ""IRMOF-74-IV"", ""m.sohncke_space_group"": ""Yes""}, {""m.refcode"": ""RAVWUI"", ""m.name"": ""IRMOF-74-VI"", ""m.sohncke_space_group"": ""Yes""}, {""m.refcode"": ""RAVXAP"", ""m.name"": ""IRMOF-74-VII"", ""m.sohncke_space_group"": ""Yes""}, {""m.refcode"": ""RAVXIX"", ""m.name"": ""IRMOF-74-IX"", ""m.sohncke_space_group"": ""Yes""}, {""m.refcode"": ""RAVXOD"", ""m.name"": ""IRMOF-74-XI"", ""m.sohncke_space_group"": ""Yes""}]"
List the journal names where the MOF 'MOF-5' was published.,MATCH (mof:MOF {name: 'MOF-5'})-[:has_publication]-(pub:Publication)-[:in_journal]-(j:Journal) RETURN DISTINCT j.name,59,0,"[{""j.name"": ""J.Phys.Chem.C""}, {""j.name"": ""Koord.Khim.""}]"
"Identify the Topology name linked to the MOF having a Metal with the name ""Cu"" and a Crystal_System of ""cubic"".","MATCH (m:MOF)-[:has_metal]->(met: Metal {name: ""[Cu]""}), (m)-[:has_crystalSystem]->(cs:Crystal_System {name: ""cubic""}), (m)-[:has_topology]->(t:Topology) RETURN t.rcsr_code;",155,3,"[{""t.rcsr_code"": ""TIMEOUT""}, {""t.rcsr_code"": ""ERROR""}, {""t.rcsr_code"": ""sod""}, {""t.rcsr_code"": ""fcu""}, {""t.rcsr_code"": ""TIMEOUT""}, {""t.rcsr_code"": ""rho""}, {""t.rcsr_code"": ""lcv""}, {""t.rcsr_code"": ""ctn""}, {""t.rcsr_code"": ""lcv""}, {""t.rcsr_code"": ""sod""}, {""t.rcsr_code"": ""UNKNOWN""}, {""t.rcsr_code"": ""utc""}, {""t.rcsr_code"": ""TIMEOUT""}, {""t.rcsr_code"": ""lcv-f""}, {""t.rcsr_code"": ""gar""}, {""t.rcsr_code"": ""ERROR""}, {""t.rcsr_code"": ""TIMEOUT""}, {""t.rcsr_code"": ""met""}, {""t.rcsr_code"": ""TIMEOUT""}, {""t.rcsr_code"": ""the""}, {""t.rcsr_code"": ""met""}, {""t.rcsr_code"": ""nbo""}, {""t.rcsr_code"": ""TIMEOUT""}, {""t.rcsr_code"": ""UNKNOWN""}]"
What metals are present in MOF-3?,MATCH (m:MOF {name:'MOF-3'})-[p:has_metal]-(t:Metal) RETURN t.name,0,1,"[{""t.name"": ""[Zn]""}]"
Could you provide the density measurement of MOF HKUST-1?,"MATCH (m:MOF) WHERE m.name CONTAINS 'HKUST-1' RETURN m.refcode, m.name, m.density",11,2,"[{""m.refcode"": ""DOTSOV42"", ""m.name"": ""HKUST-1"", ""m.density"": 0.885}, {""m.refcode"": ""FIQCEN"", ""m.name"": ""HKUST-1|Teaching Subset: MOFs"", ""m.density"": 1.219}, {""m.refcode"": ""FUNGAZ"", ""m.name"": ""HKUST-1 (as synthesised)"", ""m.density"": 0.957}, {""m.refcode"": ""LUDLED"", ""m.name"": ""HKUST-1"", ""m.density"": 1.145}, {""m.refcode"": ""WULJUJ"", ""m.name"": ""HKUST-1 0.56(dideuteroacetylene)"", ""m.density"": 0.95}]"
What is the cumulative number of Authors linked to publications about HKUST-1?,"MATCH (m:MOF {name: ""HKUST-1""})-[:has_publication]->(p:Publication)-[:has_author]->(a:Author) RETURN count(distinct a);",157,2,"[{""count(distinct a)"": 11}]"
What is the order of the synthesis operation used in the synthesis of MOF-3?,MATCH (m:MOF)-[:has_publication]->(:Publication)<-[:has_publication]-(s:Synthesis_Procedure)-[:has_operation]->(so:Synthesis_Operation) WHERE m.name CONTAINS 'MOF-3' RETURN so.order,95,0,"[{""so.order"": 1}, {""so.order"": 3}, {""so.order"": 4}, {""so.order"": 2}, {""so.order"": 0}, {""so.order"": 0}, {""so.order"": 2}, {""so.order"": 3}, {""so.order"": 1}, {""so.order"": 1}, {""so.order"": 0}, {""so.order"": 0}, {""so.order"": 1}, {""so.order"": 1}, {""so.order"": 0}]"
Provide the molecular formula for the MOF known as HKUST-1.,"MATCH (m:MOF) WHERE m.name CONTAINS 'HKUST-1' RETURN m.refcode, m.name, m.chemical_formula",6,2,"[{""m.refcode"": ""DOTSOV42"", ""m.name"": ""HKUST-1"", ""m.chemical_formula"": ""(C36 H12 Cu6 O24)n""}, {""m.refcode"": ""FIQCEN"", ""m.name"": ""HKUST-1|Teaching Subset: MOFs"", ""m.chemical_formula"": ""(C18 H12 Cu3 O15)n,10n(H2 O1)""}, {""m.refcode"": ""FUNGAZ"", ""m.name"": ""HKUST-1 (as synthesised)"", ""m.chemical_formula"": ""(C18 H12 Cu3 O15)n""}, {""m.refcode"": ""LUDLED"", ""m.name"": ""HKUST-1"", ""m.chemical_formula"": ""(C18 H12 Cu3 O15)n,7n(H2 O1)""}, {""m.refcode"": ""WULJUJ"", ""m.name"": ""HKUST-1 0.56(dideuteroacetylene)"", ""m.chemical_formula"": ""(C36 H12 Cu6 O24)n,3.4n(C2 D2)""}]"
List the top 5 journals that have the most MOFs published.,"MATCH (mof:MOF)-[:has_publication]-(pub:Publication)-[:in_journal]-(j:Journal) RETURN j.name, count(j) as freq ORDER BY freq DESC LIMIT 5",61,0,"[{""j.name"": ""Inorg.Chem."", ""freq"": 1151}, {""j.name"": ""Cryst.Growth Des."", ""freq"": 1084}, {""j.name"": ""CrystEngComm"", ""freq"": 1025}, {""j.name"": ""J.Am.Chem.Soc."", ""freq"": 718}, {""j.name"": ""Chem.Commun."", ""freq"": 607}]"
What is the rsc code assigned to the topology of MOF-5?,"MATCH (m:MOF {name: ""MOF-5""})-[:has_topology]->(t:Topology) RETURN DISTINCT t.rcsr_code",148,1,"[{""t.rcsr_code"": ""pcu""}]"
What is the last synthesis operation involved in the preparation of MOFs 'MOF-3'?,MATCH (m:MOF)-[:has_publication]->(:Publication)<-[:has_publication]-(s:Synthesis_Procedure)-[:has_operation]->(o:Synthesis_Operation) WHERE m.name CONTAINS 'MOF-3' RETURN o.name ORDER BY o.order DESC LIMIT 1,125,3,"[{""o.name"": ""prepare""}]"
How can the synthesis procedure for MOF-3 be represented by a symbol?,MATCH (m:MOF)-[:has_publication]->(:Publication)<-[:has_publication]-(s:Synthesis_Procedure) WHERE m.name CONTAINS 'MOF-3' RETURN s.symbol,80,2,"[{""s.symbol"": ""[Pr2(C6H8O4)3(H2O)2]\u22c5C10H8N2""}, {""s.symbol"": """"}, {""s.symbol"": ""2""}, {""s.symbol"": ""1""}, {""s.symbol"": ""3""}]"
"Among all synthesis procedures that correspond to MOFs named 'MOF-3', what is the highest temperature employed?",MATCH (m:MOF)-[:has_publication]->(:Publication)<-[:has_publication]-(s:Synthesis_Procedure)-[:has_operation]->(o:Synthesis_Operation)-[:has_condition]->(c:Synthesis_Operation_Condition) WHERE (m.name CONTAINS 'MOF-3') and (c.Property='Temperature') WITH toFloat(c.Value) as val RETURN max(val),117,2,"[{""max(val)"": 293.0}]"
What is the unique SMILES identifier of the organic precursor utilized in the production of HKUST-1?,MATCH (s:Synthesis_Procedure)-[:has_publication]->(:Publication)<-[:has_publication]-(m:MOF) MATCH (s)-[:has_organic_precursor]->(mp:Synthesis_Organic_Precursor) WHERE m.name CONTAINS 'HKUST-1' RETURN mp.smiles,103,1,"[{""mp.smiles"": ""O=C(O)c1cc(C(=O)O)cc(C(=O)O)c1""}, {""mp.smiles"": ""O=C(O)c1cc(C(=O)O)cc(C(=O)O)c1""}]"
What is the count of distinct authors who have written about MOF-5?,MATCH (:MOF {name: 'MOF-5'})-[:has_publication]->(:Publication)-[:has_author]->(a:Author) RETURN COUNT(DISTINCT a.name),133,3,"[{""COUNT(DISTINCT a.name)"": 13}]"
What was the title of the first published paper on MOF-5?,MATCH (:MOF {name: 'MOF-5'})-[:has_publication]->(p:Publication)-[:has_title]-(t:Title) RETURN t.title ORDER BY p.year ASC LIMIT 1,131,2,"[{""t.title"": ""Elucidating Negative Thermal Expansion in MOF-5 Elucidating NTE in MOF-5""}]"
How many researchers have contributed to publications on MOF-5?,MATCH (:MOF {name: 'MOF-5'})-[:has_publication]->(:Publication)-[:has_author]->(a:Author) RETURN COUNT(DISTINCT a.name),133,2,"[{""COUNT(DISTINCT a.name)"": 13}]"
What is the maximum temperature utilized in any synthesis operation linked to MOFs named 'MOF-3'?,MATCH (m:MOF)-[:has_publication]->(:Publication)<-[:has_publication]-(s:Synthesis_Procedure)-[:has_temperature]->(t:Synthesis_Temperature) WHERE m.name CONTAINS 'MOF-3' RETURN max(t.Value),112,1,"[{""max(t.Value)"": 453.15}]"
