question,query,qsq_list_idx,question_idx,answer
"What is the source of the MOFs 'HKUST-1' (e.g., synthetic, natural)?","MATCH (m:MOF) WHERE m.name CONTAINS 'HKUST-1' RETURN m.refcode, m.name, m.source",50,0,"[{""m.refcode"": ""DOTSOV42"", ""m.name"": ""HKUST-1"", ""m.source"": """"}, {""m.refcode"": ""FIQCEN"", ""m.name"": ""HKUST-1|Teaching Subset: MOFs"", ""m.source"": """"}, {""m.refcode"": ""FUNGAZ"", ""m.name"": ""HKUST-1 (as synthesised)"", ""m.source"": """"}, {""m.refcode"": ""LUDLED"", ""m.name"": ""HKUST-1"", ""m.source"": """"}, {""m.refcode"": ""WULJUJ"", ""m.name"": ""HKUST-1 0.56(dideuteroacetylene)"", ""m.source"": """"}]"
What are the names of the databases from which the MOFs 'IRMOF' were obtained?,"MATCH (m:MOF) WHERE m.name CONTAINS 'IRMOF' RETURN m.refcode, m.name, m.database_name",21,0,"[{""m.refcode"": ""GINYAG"", ""m.name"": ""Ni-IRMOF-74-II"", ""m.database_name"": ""as543be_ASER""}, {""m.refcode"": ""GINYIO"", ""m.name"": ""Ni-IRMOF-74-III"", ""m.database_name"": ""as543be_ASER""}, {""m.refcode"": ""GINYOU"", ""m.name"": ""Ni-IRMOF-74-IV"", ""m.database_name"": ""as543be_ASER""}, {""m.refcode"": ""GINYUA"", ""m.name"": ""Ni-IRMOF-74-V"", ""m.database_name"": ""as543be_ASER""}, {""m.refcode"": ""HOLQAC"", ""m.name"": ""\u03b1-IRMOF-3-AMPh"", ""m.database_name"": ""as543be_ASER""}, {""m.refcode"": ""NODTEH"", ""m.name"": ""IRMOF-23terp"", ""m.database_name"": ""as543be_ASER""}, {""m.refcode"": ""NODTIL"", ""m.name"": ""IRMOF-25terPh"", ""m.database_name"": ""as543be_ASER""}, {""m.refcode"": ""NODTOR"", ""m.name"": ""IRMOF-pentane"", ""m.database_name"": ""as543be_ASER""}, {""m.refcode"": ""NUVYEK"", ""m.name"": ""IRMOF-61"", ""m.database_name"": ""as543be_ASER""}, {""m.refcode"": ""NUVYIO"", ""m.name"": ""IRMOF-62"", ""m.database_name"": ""as543be_ASER""}, {""m.refcode"": ""PIWLIT"", ""m.name"": ""IRMOF-9"", ""m.database_name"": ""as543be_ASER""}, {""m.refcode"": ""RAVVUH"", ""m.name"": ""IRMOF-74-II"", ""m.database_name"": ""as543be_ASER""}, {""m.refcode"": ""RAVWAO"", ""m.name"": ""IRMOF-74-III"", ""m.database_name"": ""as543be_ASER""}, {""m.refcode"": ""RAVWES"", ""m.name"": ""IRMOF-74-IV"", ""m.database_name"": ""as543be_ASER""}, {""m.refcode"": ""RAVWOC"", ""m.name"": ""IRMOF-74-V-hex"", ""m.database_name"": ""as543be_ASER""}, {""m.refcode"": ""RAVWUI"", ""m.name"": ""IRMOF-74-VI"", ""m.database_name"": ""as543be_ASER""}, {""m.refcode"": ""RAVXAP"", ""m.name"": ""IRMOF-74-VII"", ""m.database_name"": ""as543be_ASER""}, {""m.refcode"": ""RAVXET"", ""m.name"": ""IRMOF-74-VI-oeg"", ""m.database_name"": ""as543be_ASER""}, {""m.refcode"": ""RAVXIX"", ""m.name"": ""IRMOF-74-IX"", ""m.database_name"": ""as543be_ASER""}, {""m.refcode"": ""RAVXOD"", ""m.name"": ""IRMOF-74-XI"", ""m.database_name"": ""as543be_ASER""}, {""m.refcode"": ""RUTPAY01"", ""m.name"": ""IRMOF-77"", ""m.database_name"": ""as543be_ASER""}, {""m.refcode"": ""WORKUL"", ""m.name"": ""INT-IRMOF-8-C"", ""m.database_name"": ""as543be_ASER""}, {""m.refcode"": ""WORLAS"", ""m.name"": ""INT-IRMOF-8-B"", ""m.database_name"": ""as543be_ASER""}]"
"Can you identify the journal that published the article about the synthesis of the MOF with the Topology having the RCSR code ""sra"" and a name containing ""IRMOF""?","MATCH (m:MOF)-[:has_topology]->(t:Topology {rcsr_code: ""pcu""}), (m)-[:has_publication]->(p:Publication)-[:in_journal]->(j:Journal) WHERE m.name CONTAINS ""IRMOF"" RETURN j.name;",156,1,"[{""j.name"": ""Chem.Commun.""}, {""j.name"": ""Inorg.Chem.""}, {""j.name"": ""Isr.J.Chem.""}, {""j.name"": ""Inorg.Chem.""}, {""j.name"": ""Bull.Korean Chem.Soc.""}, {""j.name"": ""Inorg.Chem.""}, {""j.name"": ""J.Am.Chem.Soc.""}, {""j.name"": ""J.Phys.Chem.C""}, {""j.name"": ""Bull.Korean Chem.Soc.""}, {""j.name"": ""J.Phys.Chem.C""}]"
Can you tell me the name of the synthesis method employed to produce MOF-3?,MATCH (m:MOF)-[:has_publication]->(:Publication)<-[:has_publication]-(s:Synthesis_Procedure) WHERE m.name CONTAINS 'MOF-3' RETURN s.name,79,1,"[{""s.name"": ""GWMOF-6""}, {""s.name"": """"}, {""s.name"": ""[Zn(tcbpe)(DMF)]\u22c5(MeCN)""}, {""s.name"": ""[Cd3(tcbpe)1.5(DMF)(H2O)2]\u22c5(DMF)6\u22c5(EtOH)3""}, {""s.name"": ""[Cd(tcbpe)]\u22c5(MeCN)""}]"
Can you provide information on the source of the MOFs 'HKUST-1'?,"MATCH (m:MOF) WHERE m.name CONTAINS 'HKUST-1' RETURN m.refcode, m.name, m.source",50,1,"[{""m.refcode"": ""DOTSOV42"", ""m.name"": ""HKUST-1"", ""m.source"": """"}, {""m.refcode"": ""FIQCEN"", ""m.name"": ""HKUST-1|Teaching Subset: MOFs"", ""m.source"": """"}, {""m.refcode"": ""FUNGAZ"", ""m.name"": ""HKUST-1 (as synthesised)"", ""m.source"": """"}, {""m.refcode"": ""LUDLED"", ""m.name"": ""HKUST-1"", ""m.source"": """"}, {""m.refcode"": ""WULJUJ"", ""m.name"": ""HKUST-1 0.56(dideuteroacetylene)"", ""m.source"": """"}]"
Which authors are in the top 5 for publishing MOFs?,"MATCH (mof:MOF)-[:has_publication]-(pub:Publication)-[:has_author]-(j:Author) RETURN j.name, count(j) as freq ORDER BY freq DESC LIMIT 5",63,2,"[{""j.name"": ""P.D.C.Dietzel"", ""freq"": 418}, {""j.name"": ""M.H.Rosnes"", ""freq"": 392}, {""j.name"": ""B.Pato-Doldan"", ""freq"": 380}, {""j.name"": ""Jian Zhang"", ""freq"": 231}, {""j.name"": ""Jie-Peng Zhang"", ""freq"": 146}]"
What is the RSC topology code for MOF-5?,"MATCH (m:MOF {name: ""MOF-5""})-[:has_topology]->(t:Topology) RETURN DISTINCT t.rcsr_code",148,3,"[{""t.rcsr_code"": ""pcu""}]"
What is the database name of the MOFs 'HKUST-1'?,"MATCH (m:MOF) WHERE m.name CONTAINS 'HKUST-1' RETURN m.refcode, m.name, m.database_name",37,0,"[{""m.refcode"": ""DOTSOV42"", ""m.name"": ""HKUST-1"", ""m.database_name"": ""as543be_ASER""}, {""m.refcode"": ""FIQCEN"", ""m.name"": ""HKUST-1|Teaching Subset: MOFs"", ""m.database_name"": ""as543be_ASER""}, {""m.refcode"": ""FUNGAZ"", ""m.name"": ""HKUST-1 (as synthesised)"", ""m.database_name"": ""as543be_ASER""}, {""m.refcode"": ""LUDLED"", ""m.name"": ""HKUST-1"", ""m.database_name"": ""as543be_ASER""}, {""m.refcode"": ""WULJUJ"", ""m.name"": ""HKUST-1 0.56(dideuteroacetylene)"", ""m.database_name"": ""as543be_ASER""}]"
What is the designation of the solvent precursor applied in the synthesis of MOF-3?,MATCH (m:MOF)-[:has_publication]->(:Publication)<-[:has_publication]-(s:Synthesis_Procedure)-[:has_solvent_precursor]->(sp:Synthesis_Solvent_Precursor) WHERE m.name CONTAINS 'MOF-3' RETURN DISTINCT sp.name,85,1,"[{""sp.name"": ""DMF""}, {""sp.name"": ""acetonitrile""}, {""sp.name"": ""MeCN""}, {""sp.name"": ""EtOH""}, {""sp.name"": ""ethanol""}, {""sp.name"": ""dimethylformamide""}, {""sp.name"": ""HNO3""}]"
Which elements or compounds form the solvent used in the synthesis of MOF-3?,"MATCH (m:MOF)-[:has_publication]->(:Publication)<-[:has_publication]-(s:Synthesis_Procedure)-[:has_solvent_precursor]->(sp:Synthesis_Solvent_Precursor)-[:has_composition]->(sc:Solvent_Composition) WHERE m.name CONTAINS 'MOF-3' RETURN DISTINCT sc.comp_id, sc.unit, sc.order, sc.value",86,2,"[{""sc.comp_id"": ""MIsyn11347_sprec0_comp0"", ""sc.unit"": ""mL1.0"", ""sc.order"": 0, ""sc.value"": 1.0}, {""sc.comp_id"": ""MIsyn11347_sprec2_comp0"", ""sc.unit"": ""mL1.0"", ""sc.order"": 0, ""sc.value"": 0.5}, {""sc.comp_id"": ""MIsyn11346_sprec3_comp0"", ""sc.unit"": ""mL1.0"", ""sc.order"": 0, ""sc.value"": 0.5}, {""sc.comp_id"": ""MIsyn11346_sprec1_comp0"", ""sc.unit"": ""mL1.0"", ""sc.order"": 0, ""sc.value"": 1.0}, {""sc.comp_id"": ""MIsyn11348_sprec0_comp0"", ""sc.unit"": ""mL1.0"", ""sc.order"": 0, ""sc.value"": 2.0}, {""sc.comp_id"": ""MIsyn11348_sprec1_comp0"", ""sc.unit"": ""mL1.0"", ""sc.order"": 0, ""sc.value"": 1.0}, {""sc.comp_id"": ""MIsyn11348_sprec2_comp1"", ""sc.unit"": ""mol1.0L-1.0"", ""sc.order"": 1, ""sc.value"": 6.0}, {""sc.comp_id"": ""MIsyn11348_sprec2_comp0"", ""sc.unit"": ""mL1.0"", ""sc.order"": 0, ""sc.value"": 0.5}]"
At what temperature was MOF 'HKUST-1' synthesized?,"MATCH (m:MOF) WHERE m.name CONTAINS 'HKUST-1' RETURN m.refcode, m.name, m.temperature",15,3,"[{""m.refcode"": ""DOTSOV42"", ""m.name"": ""HKUST-1"", ""m.temperature"": ""at 4 K""}, {""m.refcode"": ""FIQCEN"", ""m.name"": ""HKUST-1|Teaching Subset: MOFs"", ""m.temperature"": """"}, {""m.refcode"": ""FUNGAZ"", ""m.name"": ""HKUST-1 (as synthesised)"", ""m.temperature"": ""203 K""}, {""m.refcode"": ""LUDLED"", ""m.name"": ""HKUST-1"", ""m.temperature"": ""298 K""}, {""m.refcode"": ""WULJUJ"", ""m.name"": ""HKUST-1 0.56(dideuteroacetylene)"", ""m.temperature"": ""at 4 K""}]"
Could you tell me the name of the file containing data for MOFs 'HKUST-1'?,"MATCH (m:MOF) WHERE m.name CONTAINS 'HKUST-1' RETURN m.refcode, m.name, m.filename",53,1,"[{""m.refcode"": ""DOTSOV42"", ""m.name"": ""HKUST-1"", ""m.filename"": ""dotsov42_P1""}, {""m.refcode"": ""FIQCEN"", ""m.name"": ""HKUST-1|Teaching Subset: MOFs"", ""m.filename"": ""fiqcen_P1_H""}, {""m.refcode"": ""FUNGAZ"", ""m.name"": ""HKUST-1 (as synthesised)"", ""m.filename"": ""fungaz_P1""}, {""m.refcode"": ""LUDLED"", ""m.name"": ""HKUST-1"", ""m.filename"": ""ludled_P1""}, {""m.refcode"": ""WULJUJ"", ""m.name"": ""HKUST-1 0.56(dideuteroacetylene)"", ""m.filename"": ""wuljuj_P1""}]"
What is the specific name of the organic compound used in the synthesis of HKUST-1?,MATCH (s:Synthesis_Procedure)-[:has_publication]->(:Publication)<-[:has_publication]-(m:MOF) MATCH (s)-[:has_organic_precursor]->(mp:Synthesis_Organic_Precursor) WHERE m.name CONTAINS 'HKUST-1' RETURN mp.name,102,2,"[{""mp.name"": ""H3BTC""}, {""mp.name"": ""H3BTC""}]"
What is the numerical value assigned to the angle between the b-axis and c-axis for the unit cell of MOFs 'HKUST-1'?,"MATCH (m:MOF) WHERE m.name CONTAINS 'HKUST-1' RETURN m.refcode, m.name, m.cell_angles",45,2,"[{""m.refcode"": ""DOTSOV42"", ""m.name"": ""HKUST-1"", ""m.cell_angles"": ""CellAngles(alpha=90.0, beta=90.0, gamma=90.0)""}, {""m.refcode"": ""FIQCEN"", ""m.name"": ""HKUST-1|Teaching Subset: MOFs"", ""m.cell_angles"": ""CellAngles(alpha=90.0, beta=90.0, gamma=90.0)""}, {""m.refcode"": ""FUNGAZ"", ""m.name"": ""HKUST-1 (as synthesised)"", ""m.cell_angles"": ""CellAngles(alpha=90.0, beta=90.0, gamma=90.0)""}, {""m.refcode"": ""LUDLED"", ""m.name"": ""HKUST-1"", ""m.cell_angles"": ""CellAngles(alpha=90.0, beta=90.0, gamma=90.0)""}, {""m.refcode"": ""WULJUJ"", ""m.name"": ""HKUST-1 0.56(dideuteroacetylene)"", ""m.cell_angles"": ""CellAngles(alpha=90.0, beta=90.0, gamma=90.0)""}]"
Count the number of distinct Topologies that are common to HKUST-1 and other MOFs that utilize the same Metal.,"MATCH (m1:MOF {name: ""HKUST-1""})-[:has_metal]->(met: Metal), (m1)-[:has_topology]->(t:Topology) MATCH (m2:MOF)-[:has_metal]->(met), (m2)-[:has_topology]->(t) WHERE m2 <> m1 RETURN count(distinct t);",160,1,"[{""count(distinct t)"": 1}]"
Which filenames correspond to the MOFs with the name 'MOF-5'?,"MATCH (m:MOF) WHERE m.name CONTAINS 'MOF-5' RETURN m.refcode, m.name, m.filename",34,3,"[{""m.refcode"": ""FAYPUS"", ""m.name"": ""DMOF-5"", ""m.filename"": ""faypus_P1""}, {""m.refcode"": ""LASYOU"", ""m.name"": ""MOF-505"", ""m.filename"": ""lasyou_P1""}, {""m.refcode"": ""MIBQAR"", ""m.name"": ""MOF-5"", ""m.filename"": ""mibqar_P1""}, {""m.refcode"": ""MIBQAR01"", ""m.name"": ""MOF-5"", ""m.filename"": ""mibqar01_P1""}, {""m.refcode"": ""MIBQAR02"", ""m.name"": ""MOF-5"", ""m.filename"": ""mibqar02_P1""}, {""m.refcode"": ""MIBQAR03"", ""m.name"": ""MOF-5"", ""m.filename"": ""mibqar03_P1""}, {""m.refcode"": ""MIBQAR04"", ""m.name"": ""MOF-5"", ""m.filename"": ""mibqar04_P1""}, {""m.refcode"": ""MIBQAR05"", ""m.name"": ""MOF-5"", ""m.filename"": ""mibqar05_P1""}, {""m.refcode"": ""MIBQAR06"", ""m.name"": ""MOF-5"", ""m.filename"": ""mibqar06_P1""}, {""m.refcode"": ""MIBQAR07"", ""m.name"": ""MOF-5"", ""m.filename"": ""mibqar07_P1""}, {""m.refcode"": ""MIBQAR08"", ""m.name"": ""MOF-5"", ""m.filename"": ""mibqar08_P1""}, {""m.refcode"": ""MIBQAR09"", ""m.name"": ""MOF-5"", ""m.filename"": ""mibqar09_P1""}, {""m.refcode"": ""MIBQAR10"", ""m.name"": ""MOF-5"", ""m.filename"": ""mibqar10_P1""}, {""m.refcode"": ""MIBQAR11"", ""m.name"": ""MOF-5"", ""m.filename"": ""mibqar11_P1""}, {""m.refcode"": ""MIBQAR12"", ""m.name"": ""MOF-5"", ""m.filename"": ""mibqar12_P1""}, {""m.refcode"": ""MIBQAR13"", ""m.name"": ""MOF-5"", ""m.filename"": ""mibqar13_P1""}, {""m.refcode"": ""MIBQAR14"", ""m.name"": ""MOF-5"", ""m.filename"": ""mibqar14_P1""}, {""m.refcode"": ""MIBQAR15"", ""m.name"": ""MOF-5"", ""m.filename"": ""mibqar15_P1""}, {""m.refcode"": ""MIBQAR16"", ""m.name"": ""MOF-5"", ""m.filename"": ""mibqar16_P1""}, {""m.refcode"": ""MIBQAR17"", ""m.name"": ""MOF-5"", ""m.filename"": ""mibqar17_P1""}, {""m.refcode"": ""MIBQAR18"", ""m.name"": ""MOF-5"", ""m.filename"": ""mibqar18_P1""}, {""m.refcode"": ""MIBQAR19"", ""m.name"": ""MOF-5"", ""m.filename"": ""mibqar19_P1""}, {""m.refcode"": ""MIBQAR20"", ""m.name"": ""MOF-5"", ""m.filename"": ""mibqar20_P1""}, {""m.refcode"": ""OFEDAH"", ""m.name"": ""GR-MOF-5"", ""m.filename"": ""ofedah_P1""}, {""m.refcode"": ""OMUKUE"", ""m.name"": ""TPMOF-5"", ""m.filename"": ""omukue_P1_charged""}, {""m.refcode"": ""OTECEX"", ""m.name"": ""\u0394-MOF-520 unknown solvate"", ""m.filename"": ""otecex_P1""}, {""m.refcode"": ""OTECUN"", ""m.name"": ""\u039b-MOF-520 trimesate unknown solvate"", ""m.filename"": ""otecun_P1""}, {""m.refcode"": ""OTEDEY"", ""m.name"": ""\u039b-MOF-520 3-(t-butoxycarbonylamino)propan-1,2-diolato unknown solvate"", ""m.filename"": ""otedey_P1""}, {""m.refcode"": ""OTEDOI"", ""m.name"": ""\u039b-MOF-520 unknown solvate"", ""m.filename"": ""otedoi_P1""}, {""m.refcode"": ""OTEDUO"", ""m.name"": ""\u039b-MOF-520 methanolate unknown solvate"", ""m.filename"": ""oteduo_P1""}, {""m.refcode"": ""QEFWUV"", ""m.name"": ""MOF-545"", ""m.filename"": ""qefwuv_P1_H""}, {""m.refcode"": ""QOXQEC"", ""m.name"": ""-MOF-520-24"", ""m.filename"": ""qoxqec_P1""}, {""m.refcode"": ""QOXQIG"", ""m.name"": ""-MOF-520-25"", ""m.filename"": ""qoxqig_P1""}, {""m.refcode"": ""QOXQUS"", ""m.name"": ""-MOF-520-27"", ""m.filename"": ""qoxqus_P1""}, {""m.refcode"": ""QOXRAZ"", ""m.name"": ""-MOF-520-28"", ""m.filename"": ""qoxraz_P1""}, {""m.refcode"": ""QOXRIH"", ""m.name"": ""-MOF-520-31-activated"", ""m.filename"": ""qoxrih_P1""}, {""m.refcode"": ""QOXRON"", ""m.name"": ""-MOF-520-S-32"", ""m.filename"": ""qoxron_P1_H""}, {""m.refcode"": ""QOXSAA"", ""m.name"": ""-MOF-520-22"", ""m.filename"": ""qoxsaa_P1""}, {""m.refcode"": ""QOXSOO"", ""m.name"": ""-MOF-520-R-32"", ""m.filename"": ""qoxsoo_P1""}, {""m.refcode"": ""QOXSUU"", ""m.name"": ""\u0394-MOF-520-17"", ""m.filename"": ""qoxsuu_P1""}, {""m.refcode"": ""QOXTOP"", ""m.name"": ""\u0394-MOF-520-21"", ""m.filename"": ""qoxtop_P1""}, {""m.refcode"": ""QOXVEH"", ""m.name"": ""-MOF-520 N,N-dimethylformamide solvate"", ""m.filename"": ""qoxveh_P1""}, {""m.refcode"": ""RIXPOF"", ""m.name"": ""MOF-519"", ""m.filename"": ""rixpof_P1_H""}, {""m.refcode"": ""RUVKAV"", ""m.name"": ""catena-[(\u03bc8-5,5'-Buta-1,3-diyne-1,4-diyldibenzene-1,3-dicarboxylato)-diaqua-di-copper(ii) dimethylformamide solvate trihydrate]|MOF-505"", ""m.filename"": ""ruvkav_P1""}, {""m.refcode"": ""SAHYIK"", ""m.name"": ""MOF-5|Teaching Subset: MOFs"", ""m.filename"": ""sahyik_P1""}, {""m.refcode"": ""SUFJEK"", ""m.name"": ""PMOF-55"", ""m.filename"": ""sufjek_P1""}, {""m.refcode"": ""TIHROU"", ""m.name"": ""MOF-591"", ""m.filename"": ""tihrou_P1_charged""}, {""m.refcode"": ""TIHRUA"", ""m.name"": ""MOF-592"", ""m.filename"": ""tihrua_P1_charged""}, {""m.refcode"": ""TIHTUC"", ""m.name"": ""MOF-590"", ""m.filename"": ""tihtuc_P1""}, {""m.refcode"": ""VUSKEA01"", ""m.name"": ""MOF-5"", ""m.filename"": ""vuskea01_P1""}]"
What is the data source for the MOF 'MOF-5'?,"MATCH (m:MOF) WHERE m.name CONTAINS 'MOF-5' RETURN m.refcode, m.name, m.datasource",28,0,"[{""m.refcode"": ""FAYPUS"", ""m.name"": ""DMOF-5"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""LASYOU"", ""m.name"": ""MOF-505"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""MIBQAR"", ""m.name"": ""MOF-5"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""MIBQAR01"", ""m.name"": ""MOF-5"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""MIBQAR02"", ""m.name"": ""MOF-5"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""MIBQAR03"", ""m.name"": ""MOF-5"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""MIBQAR04"", ""m.name"": ""MOF-5"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""MIBQAR05"", ""m.name"": ""MOF-5"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""MIBQAR06"", ""m.name"": ""MOF-5"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""MIBQAR07"", ""m.name"": ""MOF-5"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""MIBQAR08"", ""m.name"": ""MOF-5"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""MIBQAR09"", ""m.name"": ""MOF-5"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""MIBQAR10"", ""m.name"": ""MOF-5"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""MIBQAR11"", ""m.name"": ""MOF-5"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""MIBQAR12"", ""m.name"": ""MOF-5"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""MIBQAR13"", ""m.name"": ""MOF-5"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""MIBQAR14"", ""m.name"": ""MOF-5"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""MIBQAR15"", ""m.name"": ""MOF-5"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""MIBQAR16"", ""m.name"": ""MOF-5"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""MIBQAR17"", ""m.name"": ""MOF-5"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""MIBQAR18"", ""m.name"": ""MOF-5"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""MIBQAR19"", ""m.name"": ""MOF-5"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""MIBQAR20"", ""m.name"": ""MOF-5"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""OFEDAH"", ""m.name"": ""GR-MOF-5"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""OMUKUE"", ""m.name"": ""TPMOF-5"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""OTECEX"", ""m.name"": ""\u0394-MOF-520 unknown solvate"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""OTECUN"", ""m.name"": ""\u039b-MOF-520 trimesate unknown solvate"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""OTEDEY"", ""m.name"": ""\u039b-MOF-520 3-(t-butoxycarbonylamino)propan-1,2-diolato unknown solvate"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""OTEDOI"", ""m.name"": ""\u039b-MOF-520 unknown solvate"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""OTEDUO"", ""m.name"": ""\u039b-MOF-520 methanolate unknown solvate"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""QEFWUV"", ""m.name"": ""MOF-545"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""QOXQEC"", ""m.name"": ""-MOF-520-24"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""QOXQIG"", ""m.name"": ""-MOF-520-25"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""QOXQUS"", ""m.name"": ""-MOF-520-27"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""QOXRAZ"", ""m.name"": ""-MOF-520-28"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""QOXRIH"", ""m.name"": ""-MOF-520-31-activated"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""QOXRON"", ""m.name"": ""-MOF-520-S-32"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""QOXSAA"", ""m.name"": ""-MOF-520-22"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""QOXSOO"", ""m.name"": ""-MOF-520-R-32"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""QOXSUU"", ""m.name"": ""\u0394-MOF-520-17"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""QOXTOP"", ""m.name"": ""\u0394-MOF-520-21"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""QOXVEH"", ""m.name"": ""-MOF-520 N,N-dimethylformamide solvate"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""RIXPOF"", ""m.name"": ""MOF-519"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""RUVKAV"", ""m.name"": ""catena-[(\u03bc8-5,5'-Buta-1,3-diyne-1,4-diyldibenzene-1,3-dicarboxylato)-diaqua-di-copper(ii) dimethylformamide solvate trihydrate]|MOF-505"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""SAHYIK"", ""m.name"": ""MOF-5|Teaching Subset: MOFs"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""SUFJEK"", ""m.name"": ""PMOF-55"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""TIHROU"", ""m.name"": ""MOF-591"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""TIHRUA"", ""m.name"": ""MOF-592"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""TIHTUC"", ""m.name"": ""MOF-590"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""VUSKEA01"", ""m.name"": ""MOF-5"", ""m.datasource"": ""CSD""}]"
At what temperature is MOF-3 synthesized?,"MATCH (m:MOF)-[:has_publication]->(:Publication)<-[:has_publication]-(s:Synthesis_Procedure)-[:has_temperature]->(t:Synthesis_Temperature) WHERE m.name CONTAINS 'MOF-3' RETURN t.Value, t.Unit",87,3,"[{""t.Value"": 393.15, ""t.Unit"": ""K1.0""}, {""t.Value"": 453.15, ""t.Unit"": ""K1.0""}, {""t.Value"": 353.15, ""t.Unit"": ""K1.0""}, {""t.Value"": 353.15, ""t.Unit"": ""K1.0""}, {""t.Value"": 398.15, ""t.Unit"": ""K1.0""}]"
How many different journals have published articles about HKUST-1?,"MATCH (m:MOF {name: ""HKUST-1""})-[:has_publication]->(p:Publication)-[:in_journal]->(j:Journal) RETURN count(distinct j);",159,0,"[{""count(distinct j)"": 2}]"
Can you provide the database name for MOFs with the name 'HKUST-1'?,"MATCH (m:MOF) WHERE m.name CONTAINS 'HKUST-1' RETURN m.refcode, m.name, m.database_name",37,2,"[{""m.refcode"": ""DOTSOV42"", ""m.name"": ""HKUST-1"", ""m.database_name"": ""as543be_ASER""}, {""m.refcode"": ""FIQCEN"", ""m.name"": ""HKUST-1|Teaching Subset: MOFs"", ""m.database_name"": ""as543be_ASER""}, {""m.refcode"": ""FUNGAZ"", ""m.name"": ""HKUST-1 (as synthesised)"", ""m.database_name"": ""as543be_ASER""}, {""m.refcode"": ""LUDLED"", ""m.name"": ""HKUST-1"", ""m.database_name"": ""as543be_ASER""}, {""m.refcode"": ""WULJUJ"", ""m.name"": ""HKUST-1 0.56(dideuteroacetylene)"", ""m.database_name"": ""as543be_ASER""}]"
List the top 5 space groups for MOFs.,"MATCH (m:MOF)-[r:has_spaceGroup]->(c:Space_Group) RETURN c.name, count(c) as freq ORDER BY freq DESC LIMIT 5",74,0,"[{""c.name"": ""C2/c"", ""freq"": 1430}, {""c.name"": ""P-1"", ""freq"": 1280}, {""c.name"": ""P21/c"", ""freq"": 1045}, {""c.name"": ""R-3"", ""freq"": 830}, {""c.name"": ""P21/n"", ""freq"": 665}]"
Which family accounts for the majority of MOFs?,"MATCH (m:MOF)-[r:has_family]->(c:Family) RETURN c.name, count(c) as freq ORDER BY freq DESC LIMIT 1",65,3,"[{""c.name"": ""Zn-oxide/zinc oxide"", ""freq"": 1012}]"
What is the numerical value assigned to the angle between the a-axis and b-axis for the unit cell of MOFs 'HKUST-1'?,"MATCH (m:MOF) WHERE m.name CONTAINS 'HKUST-1' RETURN m.refcode, m.name, m.cell_angles",47,1,"[{""m.refcode"": ""DOTSOV42"", ""m.name"": ""HKUST-1"", ""m.cell_angles"": ""CellAngles(alpha=90.0, beta=90.0, gamma=90.0)""}, {""m.refcode"": ""FIQCEN"", ""m.name"": ""HKUST-1|Teaching Subset: MOFs"", ""m.cell_angles"": ""CellAngles(alpha=90.0, beta=90.0, gamma=90.0)""}, {""m.refcode"": ""FUNGAZ"", ""m.name"": ""HKUST-1 (as synthesised)"", ""m.cell_angles"": ""CellAngles(alpha=90.0, beta=90.0, gamma=90.0)""}, {""m.refcode"": ""LUDLED"", ""m.name"": ""HKUST-1"", ""m.cell_angles"": ""CellAngles(alpha=90.0, beta=90.0, gamma=90.0)""}, {""m.refcode"": ""WULJUJ"", ""m.name"": ""HKUST-1 0.56(dideuteroacetylene)"", ""m.cell_angles"": ""CellAngles(alpha=90.0, beta=90.0, gamma=90.0)""}]"
How long does the synthesis of MOF-3 take?,"MATCH (m:MOF)-[:has_publication]->(:Publication)<-[:has_publication]-(s:Synthesis_Procedure)-[:has_time]->(st:Synthesis_Time) WHERE m.name CONTAINS 'MOF-3' RETURN st.Value, st.Unit",89,1,"[{""st.Value"": ""72"", ""st.Unit"": ""h1.0""}, {""st.Value"": ""72"", ""st.Unit"": ""h1.0""}, {""st.Value"": ""48.0"", ""st.Unit"": ""h1.0""}, {""st.Value"": ""48.0"", ""st.Unit"": ""h1.0""}, {""st.Value"": ""48.0"", ""st.Unit"": ""h1.0""}]"
What is the code for the topology of MOF-5 according to the RSC database?,"MATCH (m:MOF {name: ""MOF-5""})-[:has_topology]->(t:Topology) RETURN DISTINCT t.rcsr_code",148,2,"[{""t.rcsr_code"": ""pcu""}]"
Enumerate the top ten RCSR codes for the MOFs topologies.,"MATCH (m:MOF)-[r:has_topology]->(c:Topology) RETURN c.rcsr_code, count(c) as freq ORDER BY freq DESC LIMIT 10",72,0,"[{""c.rcsr_code"": ""UNKNOWN"", ""freq"": 2960}, {""c.rcsr_code"": ""ERROR"", ""freq"": 2264}, {""c.rcsr_code"": ""pcu"", ""freq"": 715}, {""c.rcsr_code"": ""dia"", ""freq"": 491}, {""c.rcsr_code"": ""sql"", ""freq"": 296}, {""c.rcsr_code"": ""pts"", ""freq"": 195}, {""c.rcsr_code"": ""nbo"", ""freq"": 152}, {""c.rcsr_code"": ""rtl"", ""freq"": 134}, {""c.rcsr_code"": ""ths"", ""freq"": 114}, {""c.rcsr_code"": ""srs"", ""freq"": 112}]"
List the deposit date for the MOFs 'HKUST-1' in the database.,"MATCH (m:MOF) WHERE m.name CONTAINS 'HKUST-1' RETURN m.refcode, m.name, m.deposition_date",48,3,"[{""m.refcode"": ""DOTSOV42"", ""m.name"": ""HKUST-1"", ""m.deposition_date"": ""06/17/2010""}, {""m.refcode"": ""FIQCEN"", ""m.name"": ""HKUST-1|Teaching Subset: MOFs"", ""m.deposition_date"": ""08/13/1999""}, {""m.refcode"": ""FUNGAZ"", ""m.name"": ""HKUST-1 (as synthesised)"", ""m.deposition_date"": ""01/29/2020""}, {""m.refcode"": ""LUDLED"", ""m.name"": ""HKUST-1"", ""m.deposition_date"": ""05/14/2015""}, {""m.refcode"": ""WULJUJ"", ""m.name"": ""HKUST-1 0.56(dideuteroacetylene)"", ""m.deposition_date"": ""06/17/2010""}]"
How many distinct types of organic linkers have been used to synthesize MOF-5?,MATCH (:MOF {name: 'MOF-5'})-[:has_organicLinker]->(ol:Organic_Linker) RETURN count(DISTINCT ol.name),138,2,"[{""count(DISTINCT ol.name)"": 1}]"
List the symbol used to represent the synthetic procedure of HKUST-1.,MATCH (m:MOF)-[:has_publication]-(p:Publication)-[:has_publication]-(s:Synthesis_Procedure) WHERE m.name CONTAINS 'HKUST-1' RETURN s.symbol,99,2,"[{""s.symbol"": """"}, {""s.symbol"": """"}]"
What is the value of z_prime for the MOFs 'HKUST-1'?,"MATCH (m:MOF) WHERE m.name CONTAINS 'HKUST-1' RETURN m.refcode, m.name, m.z_prime",41,0,"[{""m.refcode"": ""DOTSOV42"", ""m.name"": ""HKUST-1"", ""m.z_prime"": 0.04}, {""m.refcode"": ""FIQCEN"", ""m.name"": ""HKUST-1|Teaching Subset: MOFs"", ""m.z_prime"": 0.08}, {""m.refcode"": ""FUNGAZ"", ""m.name"": ""HKUST-1 (as synthesised)"", ""m.z_prime"": 0.08}, {""m.refcode"": ""LUDLED"", ""m.name"": ""HKUST-1"", ""m.z_prime"": 0.08}, {""m.refcode"": ""WULJUJ"", ""m.name"": ""HKUST-1 0.56(dideuteroacetylene)"", ""m.z_prime"": 0.04}]"
What author has written the largest amount of papers on MOF-5?,"MATCH (m:MOF {name: ""MOF-5""})-[:has_publication]->(p:Publication)-[:has_author]->(a:Author) RETURN a.name, count(*) as numArticles ORDER BY numArticles DESC LIMIT 1;",147,2,"[{""a.name"": ""A.J.Bridgeman"", ""numArticles"": 21}]"
Who published the most number of MOFs?,"MATCH (mof:MOF)-[:has_publication]-(pub:Publication)-[:has_author]-(j:Author) RETURN j.name, count(j) as freq ORDER BY freq DESC LIMIT 1",62,0,"[{""j.name"": ""P.D.C.Dietzel"", ""freq"": 418}]"
List the MOFs whose melting point values exist in the database.,"MATCH (m:MOF)  WHERE m.melting_point <> """" RETURN m.refcode, m.name, m.melting_point",10,0,"[{""m.refcode"": ""CEHKUW"", ""m.name"": """", ""m.melting_point"": ""decomposes from about 330 deg.C""}, {""m.refcode"": ""DALCEZ"", ""m.name"": """", ""m.melting_point"": ""170 deg.C(dec.)""}, {""m.refcode"": ""EJOGOZ"", ""m.name"": """", ""m.melting_point"": ""above 270 deg.C""}, {""m.refcode"": ""FIVYUF"", ""m.name"": """", ""m.melting_point"": ""578-580 K""}, {""m.refcode"": ""GERPUP"", ""m.name"": """", ""m.melting_point"": ""decomposes at 216 deg.C""}, {""m.refcode"": ""HEBZAR"", ""m.name"": """", ""m.melting_point"": ""above 650 K""}, {""m.refcode"": ""HEBZEV"", ""m.name"": """", ""m.melting_point"": ""above 650 K""}, {""m.refcode"": ""HONBES"", ""m.name"": """", ""m.melting_point"": ""decomposes above 300 deg.C""}, {""m.refcode"": ""INOVEN"", ""m.name"": """", ""m.melting_point"": ""above 300 deg.C""}, {""m.refcode"": ""KEVLEE"", ""m.name"": """", ""m.melting_point"": ""683 K decomp.""}, {""m.refcode"": ""MUKRIU"", ""m.name"": """", ""m.melting_point"": ""293deg.C(dec)""}, {""m.refcode"": ""MUWQEB"", ""m.name"": """", ""m.melting_point"": ""above 500 K""}, {""m.refcode"": ""NIMKAW"", ""m.name"": """", ""m.melting_point"": ""183-185 deg.C (dec.)""}, {""m.refcode"": ""NOBQEB"", ""m.name"": """", ""m.melting_point"": ""decomposes above 40 deg.C""}, {""m.refcode"": ""OHIQEE"", ""m.name"": """", ""m.melting_point"": ""above 523 K""}, {""m.refcode"": ""OHUKIM"", ""m.name"": """", ""m.melting_point"": ""above 500 K""}, {""m.refcode"": ""OPESOS"", ""m.name"": """", ""m.melting_point"": ""517.15 K""}, {""m.refcode"": ""OXEVOE"", ""m.name"": """", ""m.melting_point"": ""253.8-254.6 deg.C""}, {""m.refcode"": ""QAYTEP"", ""m.name"": """", ""m.melting_point"": ""232-234deg.C""}, {""m.refcode"": ""QEPBEV"", ""m.name"": """", ""m.melting_point"": ""447 K""}, {""m.refcode"": ""SAHDAH"", ""m.name"": """", ""m.melting_point"": ""282deg.C""}, {""m.refcode"": ""TIPRIT01"", ""m.name"": """", ""m.melting_point"": ""493K(dec.)""}, {""m.refcode"": ""TISGUY"", ""m.name"": """", ""m.melting_point"": ""above 220 deg.C""}, {""m.refcode"": ""WEZCIO"", ""m.name"": """", ""m.melting_point"": ""Decomposes at 280 deg.C""}, {""m.refcode"": ""XESCOO"", ""m.name"": """", ""m.melting_point"": ""232deg.C(dec.)""}, {""m.refcode"": ""XEVXUT"", ""m.name"": """", ""m.melting_point"": ""408 K""}, {""m.refcode"": ""XICDUI"", ""m.name"": ""catena-((\u03bc4-letrozole)-copper(i) tetrafluoroborate chloroform solvate)"", ""m.melting_point"": ""decomposes above 250 deg.C""}, {""m.refcode"": ""XIHRIQ"", ""m.name"": """", ""m.melting_point"": ""236-238 deg.C (dec.)""}, {""m.refcode"": ""XODBOI"", ""m.name"": """", ""m.melting_point"": ""254-255 deg.C(dec.)""}, {""m.refcode"": ""ZUBKEO"", ""m.name"": """", ""m.melting_point"": ""593 K""}]"
What is the refcode for MOF-3?,MATCH (m:MOF) WHERE m.name CONTAINS 'MOF-3' RETURN m.refcode,77,0,"[{""m.refcode"": ""CEFNOT""}, {""m.refcode"": ""FAYPIG""}, {""m.refcode"": ""FEYQIK""}, {""m.refcode"": ""HOLQAC""}, {""m.refcode"": ""KITVEQ""}, {""m.refcode"": ""LAJKUE""}, {""m.refcode"": ""MIFGEQ""}, {""m.refcode"": ""PIKYAM""}]"
What is the metallic source applied during the synthesis of MOF-3?,MATCH (m:MOF)-[:has_publication]->(:Publication)<-[:has_publication]-(s:Synthesis_Procedure)-[:has_metal_precursor]->(mp:Synthesis_Metal_Precursor) WHERE m.name CONTAINS 'MOF-3' RETURN mp.name,81,1,"[{""mp.name"": ""GWMOF-3""}, {""mp.name"": ""praseodymium chloride heptahydrate""}, {""mp.name"": ""PrCl3\u22c57H2O""}, {""mp.name"": ""GWMOF-3""}, {""mp.name"": ""praseodymium chloride heptahydrate""}, {""mp.name"": ""PrCl3\u22c57H2O""}, {""mp.name"": ""Zn(NO3)2\u22c56H2O""}, {""mp.name"": ""Cd(NO3)2\u22c54H2O""}, {""mp.name"": ""Cd(NO3)2\u22c54H2O""}]"
What are the notes or comments related to the MOFs with the name 'HKUST-1'?,"MATCH (m:MOF) WHERE m.name CONTAINS 'HKUST-1' RETURN m.refcode, m.name, m.remarks",39,2,"[{""m.refcode"": ""DOTSOV42"", ""m.name"": ""HKUST-1"", ""m.remarks"": """"}, {""m.refcode"": ""FIQCEN"", ""m.name"": ""HKUST-1|Teaching Subset: MOFs"", ""m.remarks"": ""Additional water molecules in the pore channels were not directly located""}, {""m.refcode"": ""FUNGAZ"", ""m.name"": ""HKUST-1 (as synthesised)"", ""m.remarks"": """"}, {""m.refcode"": ""LUDLED"", ""m.name"": ""HKUST-1"", ""m.remarks"": """"}, {""m.refcode"": ""WULJUJ"", ""m.name"": ""HKUST-1 0.56(dideuteroacetylene)"", ""m.remarks"": """"}]"
In which journal are there the most articles published on MOFs with a crystal system akin to MOF-5?,"MATCH (m1:MOF)-[:has_crystalSystem]->(s:Crystal_System)-[:has_crystalSystem]-(m2:MOF)-[:has_publication]-(p)-[:in_journal]-(j) WITH j.name as journalName, count(distinct m2) as numMOFs ORDER BY numMOFs DESC LIMIT 1 RETURN journalName;",144,2,"[{""journalName"": ""Inorg.Chem.""}]"
