question,query,qsq_list_idx,question_idx,answer
List the z value of MOF 'IRMOF'.,"MATCH (m:MOF) WHERE m.name CONTAINS 'IRMOF' RETURN m.refcode, m.name, m.z_value",20,3,"[{""m.refcode"": ""GINYAG"", ""m.name"": ""Ni-IRMOF-74-II"", ""m.z_value"": 9.0}, {""m.refcode"": ""GINYIO"", ""m.name"": ""Ni-IRMOF-74-III"", ""m.z_value"": 9.0}, {""m.refcode"": ""GINYOU"", ""m.name"": ""Ni-IRMOF-74-IV"", ""m.z_value"": 9.0}, {""m.refcode"": ""GINYUA"", ""m.name"": ""Ni-IRMOF-74-V"", ""m.z_value"": 9.0}, {""m.refcode"": ""HOLQAC"", ""m.name"": ""\u03b1-IRMOF-3-AMPh"", ""m.z_value"": 8.0}, {""m.refcode"": ""NODTEH"", ""m.name"": ""IRMOF-23terp"", ""m.z_value"": 8.0}, {""m.refcode"": ""NODTIL"", ""m.name"": ""IRMOF-25terPh"", ""m.z_value"": 8.0}, {""m.refcode"": ""NODTOR"", ""m.name"": ""IRMOF-pentane"", ""m.z_value"": 8.0}, {""m.refcode"": ""NUVYEK"", ""m.name"": ""IRMOF-61"", ""m.z_value"": 4.0}, {""m.refcode"": ""NUVYIO"", ""m.name"": ""IRMOF-62"", ""m.z_value"": 6.0}, {""m.refcode"": ""PIWLIT"", ""m.name"": ""IRMOF-9"", ""m.z_value"": 4.0}, {""m.refcode"": ""RAVVUH"", ""m.name"": ""IRMOF-74-II"", ""m.z_value"": 9.0}, {""m.refcode"": ""RAVWAO"", ""m.name"": ""IRMOF-74-III"", ""m.z_value"": 9.0}, {""m.refcode"": ""RAVWES"", ""m.name"": ""IRMOF-74-IV"", ""m.z_value"": 9.0}, {""m.refcode"": ""RAVWOC"", ""m.name"": ""IRMOF-74-V-hex"", ""m.z_value"": 9.0}, {""m.refcode"": ""RAVWUI"", ""m.name"": ""IRMOF-74-VI"", ""m.z_value"": 9.0}, {""m.refcode"": ""RAVXAP"", ""m.name"": ""IRMOF-74-VII"", ""m.z_value"": 9.0}, {""m.refcode"": ""RAVXET"", ""m.name"": ""IRMOF-74-VI-oeg"", ""m.z_value"": 9.0}, {""m.refcode"": ""RAVXIX"", ""m.name"": ""IRMOF-74-IX"", ""m.z_value"": 9.0}, {""m.refcode"": ""RAVXOD"", ""m.name"": ""IRMOF-74-XI"", ""m.z_value"": 9.0}, {""m.refcode"": ""RUTPAY01"", ""m.name"": ""IRMOF-77"", ""m.z_value"": 12.0}, {""m.refcode"": ""WORKUL"", ""m.name"": ""INT-IRMOF-8-C"", ""m.z_value"": 2.0}, {""m.refcode"": ""WORLAS"", ""m.name"": ""INT-IRMOF-8-B"", ""m.z_value"": 2.0}]"
List the length of the a-axis for the unit cell of MOFs 'HKUST-1'.,"MATCH (m:MOF) WHERE m.name CONTAINS 'HKUST-1' RETURN m.refcode, m.name, m.cell_lengths",42,3,"[{""m.refcode"": ""DOTSOV42"", ""m.name"": ""HKUST-1"", ""m.cell_lengths"": ""CellLengths(a=26.287910000000004, b=26.287910000000004, c=26.287910000000004)""}, {""m.refcode"": ""FIQCEN"", ""m.name"": ""HKUST-1|Teaching Subset: MOFs"", ""m.cell_lengths"": ""CellLengths(a=26.343, b=26.343, c=26.343)""}, {""m.refcode"": ""FUNGAZ"", ""m.name"": ""HKUST-1 (as synthesised)"", ""m.cell_lengths"": ""CellLengths(a=26.3518, b=26.3518, c=26.3518)""}, {""m.refcode"": ""LUDLED"", ""m.name"": ""HKUST-1"", ""m.cell_lengths"": ""CellLengths(a=26.315, b=26.315, c=26.315)""}, {""m.refcode"": ""WULJUJ"", ""m.name"": ""HKUST-1 0.56(dideuteroacetylene)"", ""m.cell_lengths"": ""CellLengths(a=26.3256, b=26.3256, c=26.3256)""}]"
Can you provide the name of the synthetic operation used in creating MOF-3?,MATCH (m:MOF)-[:has_publication]->(:Publication)<-[:has_publication]-(s:Synthesis_Procedure)-[:has_operation]->(so:Synthesis_Operation) WHERE m.name CONTAINS 'MOF-3' RETURN so.name,93,2,"[{""so.name"": ""heat""}, {""so.name"": ""dry""}, {""so.name"": ""prepare""}, {""so.name"": ""wash""}, {""so.name"": ""prepare""}, {""so.name"": ""heat""}, {""so.name"": ""wash""}, {""so.name"": ""dry""}, {""so.name"": ""cool""}, {""so.name"": ""wait""}, {""so.name"": ""prepare""}, {""so.name"": ""prepare""}, {""so.name"": ""wait""}, {""so.name"": ""wait""}, {""so.name"": ""prepare""}]"
Can you identify the bond that is used most frequently across all MOFs?,"MATCH (n:Bond) WITH n.name AS name, count(*) as freq ORDER BY freq LIMIT 1 RETURN name",57,3,"[{""name"": ""Bond(Single Atom(Co1) Atom(N1))""}]"
"Identify the Metal component used in the MOF with the Topology designated by the RCSR code ""rut"".","MATCH (m:MOF)-[:has_topology]->(t:Topology {rcsr_code: ""rut""}), (m)-[:has_metal]->(met: Metal) RETURN met.name;",150,3,[]
Which name is given to the organic precursor used in the synthesis of MOF-3?,MATCH (m:MOF)-[:has_publication]->(:Publication)<-[:has_publication]-(s:Synthesis_Procedure)-[:has_organic_precursor]->(op:Synthesis_Organic_Precursor) WHERE m.name CONTAINS 'MOF-3' RETURN DISTINCT op.name,83,2,"[{""op.name"": ""adipic acid""}, {""op.name"": ""H4tcbpe""}]"
Provide the name of the synthesis protocol that was utilized to synthesize MOF-3.,MATCH (m:MOF)-[:has_publication]->(:Publication)<-[:has_publication]-(s:Synthesis_Procedure) WHERE m.name CONTAINS 'MOF-3' RETURN s.name,79,3,"[{""s.name"": ""GWMOF-6""}, {""s.name"": """"}, {""s.name"": ""[Zn(tcbpe)(DMF)]\u22c5(MeCN)""}, {""s.name"": ""[Cd3(tcbpe)1.5(DMF)(H2O)2]\u22c5(DMF)6\u22c5(EtOH)3""}, {""s.name"": ""[Cd(tcbpe)]\u22c5(MeCN)""}]"
Could you specify the value of z_prime for MOF 'IRMOF'?,"MATCH (m:MOF) WHERE m.name CONTAINS 'IRMOF' RETURN m.refcode, m.name, m.z_prime",16,1,"[{""m.refcode"": ""GINYAG"", ""m.name"": ""Ni-IRMOF-74-II"", ""m.z_prime"": 0.5}, {""m.refcode"": ""GINYIO"", ""m.name"": ""Ni-IRMOF-74-III"", ""m.z_prime"": 0.5}, {""m.refcode"": ""GINYOU"", ""m.name"": ""Ni-IRMOF-74-IV"", ""m.z_prime"": 1.0}, {""m.refcode"": ""GINYUA"", ""m.name"": ""Ni-IRMOF-74-V"", ""m.z_prime"": 1.0}, {""m.refcode"": ""HOLQAC"", ""m.name"": ""\u03b1-IRMOF-3-AMPh"", ""m.z_prime"": 0.33}, {""m.refcode"": ""NODTEH"", ""m.name"": ""IRMOF-23terp"", ""m.z_prime"": 0.04}, {""m.refcode"": ""NODTIL"", ""m.name"": ""IRMOF-25terPh"", ""m.z_prime"": 0.04}, {""m.refcode"": ""NODTOR"", ""m.name"": ""IRMOF-pentane"", ""m.z_prime"": 0.25}, {""m.refcode"": ""NUVYEK"", ""m.name"": ""IRMOF-61"", ""m.z_prime"": 0.25}, {""m.refcode"": ""NUVYIO"", ""m.name"": ""IRMOF-62"", ""m.z_prime"": 1.0}, {""m.refcode"": ""PIWLIT"", ""m.name"": ""IRMOF-9"", ""m.z_prime"": 1.0}, {""m.refcode"": ""RAVVUH"", ""m.name"": ""IRMOF-74-II"", ""m.z_prime"": 0.5}, {""m.refcode"": ""RAVWAO"", ""m.name"": ""IRMOF-74-III"", ""m.z_prime"": 0.5}, {""m.refcode"": ""RAVWES"", ""m.name"": ""IRMOF-74-IV"", ""m.z_prime"": 1.0}, {""m.refcode"": ""RAVWOC"", ""m.name"": ""IRMOF-74-V-hex"", ""m.z_prime"": 0.5}, {""m.refcode"": ""RAVWUI"", ""m.name"": ""IRMOF-74-VI"", ""m.z_prime"": 1.0}, {""m.refcode"": ""RAVXAP"", ""m.name"": ""IRMOF-74-VII"", ""m.z_prime"": 1.0}, {""m.refcode"": ""RAVXET"", ""m.name"": ""IRMOF-74-VI-oeg"", ""m.z_prime"": 0.5}, {""m.refcode"": ""RAVXIX"", ""m.name"": ""IRMOF-74-IX"", ""m.z_prime"": 1.0}, {""m.refcode"": ""RAVXOD"", ""m.name"": ""IRMOF-74-XI"", ""m.z_prime"": 1.0}, {""m.refcode"": ""RUTPAY01"", ""m.name"": ""IRMOF-77"", ""m.z_prime"": 0.33}, {""m.refcode"": ""WORKUL"", ""m.name"": ""INT-IRMOF-8-C"", ""m.z_prime"": 1.0}, {""m.refcode"": ""WORLAS"", ""m.name"": ""INT-IRMOF-8-B"", ""m.z_prime"": 1.0}]"
Can you provide the DOI of the publication that details the synthetic process and characteristics of HKUST-1?,MATCH (m:MOF)-[:has_publication]-(p:Publication)-[:has_publication]-(s:Synthesis_Procedure) WHERE m.name CONTAINS 'HKUST-1' RETURN p.doi,97,1,"[{""p.doi"": ""10.1021/ja904782h""}, {""p.doi"": ""10.1021/ja904782h""}]"
What is the density of the MOF HKUST-1?,"MATCH (m:MOF) WHERE m.name CONTAINS 'HKUST-1' RETURN m.refcode, m.name, m.density",11,0,"[{""m.refcode"": ""DOTSOV42"", ""m.name"": ""HKUST-1"", ""m.density"": 0.885}, {""m.refcode"": ""FIQCEN"", ""m.name"": ""HKUST-1|Teaching Subset: MOFs"", ""m.density"": 1.219}, {""m.refcode"": ""FUNGAZ"", ""m.name"": ""HKUST-1 (as synthesised)"", ""m.density"": 0.957}, {""m.refcode"": ""LUDLED"", ""m.name"": ""HKUST-1"", ""m.density"": 1.145}, {""m.refcode"": ""WULJUJ"", ""m.name"": ""HKUST-1 0.56(dideuteroacetylene)"", ""m.density"": 0.95}]"
What is the largest solvent composition value associated with a synthesis solvent precursor associated with a MOF 'MOF-3'?,MATCH (m:MOF)-[:has_publication]->(:Publication)<-[:has_publication]-(s:Synthesis_Procedure)-[:has_solvent_precursor]->(sp:Synthesis_Solvent_Precursor)-[:has_composition]->(sc:Solvent_Composition) WHERE m.name CONTAINS 'MOF-3' RETURN max(sc.value),119,0,"[{""max(sc.value)"": 6.0}]"
What is the composition of metals in MOF-3?,MATCH (m:MOF {name:'MOF-3'})-[p:has_metal]-(t:Metal) RETURN t.name,0,3,"[{""t.name"": ""[Zn]""}]"
Can you identify the origin of MOF 'IRMOF'?,"MATCH (m:MOF) WHERE m.name CONTAINS 'IRMOF' RETURN m.refcode, m.name, m.source",25,2,"[{""m.refcode"": ""GINYAG"", ""m.name"": ""Ni-IRMOF-74-II"", ""m.source"": """"}, {""m.refcode"": ""GINYIO"", ""m.name"": ""Ni-IRMOF-74-III"", ""m.source"": """"}, {""m.refcode"": ""GINYOU"", ""m.name"": ""Ni-IRMOF-74-IV"", ""m.source"": """"}, {""m.refcode"": ""GINYUA"", ""m.name"": ""Ni-IRMOF-74-V"", ""m.source"": """"}, {""m.refcode"": ""HOLQAC"", ""m.name"": ""\u03b1-IRMOF-3-AMPh"", ""m.source"": """"}, {""m.refcode"": ""NODTEH"", ""m.name"": ""IRMOF-23terp"", ""m.source"": """"}, {""m.refcode"": ""NODTIL"", ""m.name"": ""IRMOF-25terPh"", ""m.source"": """"}, {""m.refcode"": ""NODTOR"", ""m.name"": ""IRMOF-pentane"", ""m.source"": """"}, {""m.refcode"": ""NUVYEK"", ""m.name"": ""IRMOF-61"", ""m.source"": """"}, {""m.refcode"": ""NUVYIO"", ""m.name"": ""IRMOF-62"", ""m.source"": """"}, {""m.refcode"": ""PIWLIT"", ""m.name"": ""IRMOF-9"", ""m.source"": """"}, {""m.refcode"": ""RAVVUH"", ""m.name"": ""IRMOF-74-II"", ""m.source"": """"}, {""m.refcode"": ""RAVWAO"", ""m.name"": ""IRMOF-74-III"", ""m.source"": """"}, {""m.refcode"": ""RAVWES"", ""m.name"": ""IRMOF-74-IV"", ""m.source"": """"}, {""m.refcode"": ""RAVWOC"", ""m.name"": ""IRMOF-74-V-hex"", ""m.source"": """"}, {""m.refcode"": ""RAVWUI"", ""m.name"": ""IRMOF-74-VI"", ""m.source"": """"}, {""m.refcode"": ""RAVXAP"", ""m.name"": ""IRMOF-74-VII"", ""m.source"": """"}, {""m.refcode"": ""RAVXET"", ""m.name"": ""IRMOF-74-VI-oeg"", ""m.source"": """"}, {""m.refcode"": ""RAVXIX"", ""m.name"": ""IRMOF-74-IX"", ""m.source"": """"}, {""m.refcode"": ""RAVXOD"", ""m.name"": ""IRMOF-74-XI"", ""m.source"": """"}, {""m.refcode"": ""RUTPAY01"", ""m.name"": ""IRMOF-77"", ""m.source"": """"}, {""m.refcode"": ""WORKUL"", ""m.name"": ""INT-IRMOF-8-C"", ""m.source"": """"}, {""m.refcode"": ""WORLAS"", ""m.name"": ""INT-IRMOF-8-B"", ""m.source"": """"}]"
Which organic lingand is most typically used to create MOFs?,"MATCH (m:MOF)-[r:has_organicLinker]->(c:Organic_Linker) RETURN c.name, count(c) as freq ORDER BY freq DESC LIMIT 1",69,0,"[{""c.name"": ""[O-]C(=O)c1cc([O])c(cc1[O])C(=O)[O-]"", ""freq"": 510}]"
Where did MOF 'IRMOF' originate from?,"MATCH (m:MOF) WHERE m.name CONTAINS 'IRMOF' RETURN m.refcode, m.name, m.source",25,1,"[{""m.refcode"": ""GINYAG"", ""m.name"": ""Ni-IRMOF-74-II"", ""m.source"": """"}, {""m.refcode"": ""GINYIO"", ""m.name"": ""Ni-IRMOF-74-III"", ""m.source"": """"}, {""m.refcode"": ""GINYOU"", ""m.name"": ""Ni-IRMOF-74-IV"", ""m.source"": """"}, {""m.refcode"": ""GINYUA"", ""m.name"": ""Ni-IRMOF-74-V"", ""m.source"": """"}, {""m.refcode"": ""HOLQAC"", ""m.name"": ""\u03b1-IRMOF-3-AMPh"", ""m.source"": """"}, {""m.refcode"": ""NODTEH"", ""m.name"": ""IRMOF-23terp"", ""m.source"": """"}, {""m.refcode"": ""NODTIL"", ""m.name"": ""IRMOF-25terPh"", ""m.source"": """"}, {""m.refcode"": ""NODTOR"", ""m.name"": ""IRMOF-pentane"", ""m.source"": """"}, {""m.refcode"": ""NUVYEK"", ""m.name"": ""IRMOF-61"", ""m.source"": """"}, {""m.refcode"": ""NUVYIO"", ""m.name"": ""IRMOF-62"", ""m.source"": """"}, {""m.refcode"": ""PIWLIT"", ""m.name"": ""IRMOF-9"", ""m.source"": """"}, {""m.refcode"": ""RAVVUH"", ""m.name"": ""IRMOF-74-II"", ""m.source"": """"}, {""m.refcode"": ""RAVWAO"", ""m.name"": ""IRMOF-74-III"", ""m.source"": """"}, {""m.refcode"": ""RAVWES"", ""m.name"": ""IRMOF-74-IV"", ""m.source"": """"}, {""m.refcode"": ""RAVWOC"", ""m.name"": ""IRMOF-74-V-hex"", ""m.source"": """"}, {""m.refcode"": ""RAVWUI"", ""m.name"": ""IRMOF-74-VI"", ""m.source"": """"}, {""m.refcode"": ""RAVXAP"", ""m.name"": ""IRMOF-74-VII"", ""m.source"": """"}, {""m.refcode"": ""RAVXET"", ""m.name"": ""IRMOF-74-VI-oeg"", ""m.source"": """"}, {""m.refcode"": ""RAVXIX"", ""m.name"": ""IRMOF-74-IX"", ""m.source"": """"}, {""m.refcode"": ""RAVXOD"", ""m.name"": ""IRMOF-74-XI"", ""m.source"": """"}, {""m.refcode"": ""RUTPAY01"", ""m.name"": ""IRMOF-77"", ""m.source"": """"}, {""m.refcode"": ""WORKUL"", ""m.name"": ""INT-IRMOF-8-C"", ""m.source"": """"}, {""m.refcode"": ""WORLAS"", ""m.name"": ""INT-IRMOF-8-B"", ""m.source"": """"}]"
What is the numerical value assigned to the length of the a-axis for the unit cell of MOFs 'HKUST-1'?,"MATCH (m:MOF) WHERE m.name CONTAINS 'HKUST-1' RETURN m.refcode, m.name, m.cell_lengths",42,2,"[{""m.refcode"": ""DOTSOV42"", ""m.name"": ""HKUST-1"", ""m.cell_lengths"": ""CellLengths(a=26.287910000000004, b=26.287910000000004, c=26.287910000000004)""}, {""m.refcode"": ""FIQCEN"", ""m.name"": ""HKUST-1|Teaching Subset: MOFs"", ""m.cell_lengths"": ""CellLengths(a=26.343, b=26.343, c=26.343)""}, {""m.refcode"": ""FUNGAZ"", ""m.name"": ""HKUST-1 (as synthesised)"", ""m.cell_lengths"": ""CellLengths(a=26.3518, b=26.3518, c=26.3518)""}, {""m.refcode"": ""LUDLED"", ""m.name"": ""HKUST-1"", ""m.cell_lengths"": ""CellLengths(a=26.315, b=26.315, c=26.315)""}, {""m.refcode"": ""WULJUJ"", ""m.name"": ""HKUST-1 0.56(dideuteroacetylene)"", ""m.cell_lengths"": ""CellLengths(a=26.3256, b=26.3256, c=26.3256)""}]"
When was the MOFs 'HKUST-1' added to the database?,"MATCH (m:MOF) WHERE m.name CONTAINS 'HKUST-1' RETURN m.refcode, m.name, m.deposition_date",48,1,"[{""m.refcode"": ""DOTSOV42"", ""m.name"": ""HKUST-1"", ""m.deposition_date"": ""06/17/2010""}, {""m.refcode"": ""FIQCEN"", ""m.name"": ""HKUST-1|Teaching Subset: MOFs"", ""m.deposition_date"": ""08/13/1999""}, {""m.refcode"": ""FUNGAZ"", ""m.name"": ""HKUST-1 (as synthesised)"", ""m.deposition_date"": ""01/29/2020""}, {""m.refcode"": ""LUDLED"", ""m.name"": ""HKUST-1"", ""m.deposition_date"": ""05/14/2015""}, {""m.refcode"": ""WULJUJ"", ""m.name"": ""HKUST-1 0.56(dideuteroacetylene)"", ""m.deposition_date"": ""06/17/2010""}]"
What is the maximum time required for any synthesis procedure associated with MOFs named 'MOF-3'?,MATCH (m:MOF)-[:has_publication]->(:Publication)<-[:has_publication]-(s:Synthesis_Procedure)-[:has_operation]->(o:Synthesis_Operation)-[:has_condition]->(c:Synthesis_Operation_Condition) WHERE (m.name CONTAINS 'MOF-3') and (c.Property='Time') WITH toFloat(c.Value) as val RETURN max(val),116,1,"[{""max(val)"": 72.0}]"
Determine the total count of different Topologies that are shared between HKUST-1 and other MOFs that use the same Metal.,"MATCH (m1:MOF {name: ""HKUST-1""})-[:has_metal]->(met: Metal), (m1)-[:has_topology]->(t:Topology) MATCH (m2:MOF)-[:has_metal]->(met), (m2)-[:has_topology]->(t) WHERE m2 <> m1 RETURN count(distinct t);",160,3,"[{""count(distinct t)"": 1}]"
"Among the MOFs 'MOF-3', what is the title of the publication that describes the synthesis procedure with the greatest MOratio?",MATCH (m:MOF)-[:has_publication]->(p:Publication)<-[:has_publication]-(s:Synthesis_Procedure) WHERE m.name CONTAINS 'MOF-3' WITH max(s.MOratio) as max MATCH (m1:MOF)-[:has_publication]->(p1:Publication)<-[:has_publication]-(s1:Synthesis_Procedure) MATCH (p1)-[:has_title]-(t:Title) WHERE (m1.name CONTAINS 'MOF-3') and (s1.MOratio=max) RETURN t.title,128,3,"[{""t.title"": ""Highly Luminescent Metal\u2013Organic Frameworks Based on an Aggregation-Induced Emission Ligand as Chemical Sensors for Nitroaromatic Compounds""}]"
How many distinct publications have included papers on MOFs with the family akin to MOF-5?,MATCH (:MOF {name: 'MOF-5'})-[:has_family]-(f:Family)-[:has_family]-(m:MOF)-[:has_publication]-(p:Publication)-[:in_journal]-(j:Journal) RETURN COUNT(DISTINCT j);,141,2,"[{""COUNT(DISTINCT j)"": 31}]"
Which journal has published the most MOFs?,"MATCH (mof:MOF)-[:has_publication]-(pub:Publication)-[:in_journal]-(j:Journal) RETURN j.name, count(j) as freq ORDER BY freq DESC LIMIT 1",60,2,"[{""j.name"": ""Inorg.Chem."", ""freq"": 1151}]"
"What is the name of the journal that published an article on the synthesis of the MOF that has a Topology with the RCSR code ""sra"" and a name that contains ""IRMOF""?","MATCH (m:MOF)-[:has_topology]->(t:Topology {rcsr_code: ""pcu""}), (m)-[:has_publication]->(p:Publication)-[:in_journal]->(j:Journal) WHERE m.name CONTAINS ""IRMOF"" RETURN j.name;",156,0,"[{""j.name"": ""Chem.Commun.""}, {""j.name"": ""Inorg.Chem.""}, {""j.name"": ""Isr.J.Chem.""}, {""j.name"": ""Inorg.Chem.""}, {""j.name"": ""Bull.Korean Chem.Soc.""}, {""j.name"": ""Inorg.Chem.""}, {""j.name"": ""J.Am.Chem.Soc.""}, {""j.name"": ""J.Phys.Chem.C""}, {""j.name"": ""Bull.Korean Chem.Soc.""}, {""j.name"": ""J.Phys.Chem.C""}]"
What is the number of distinct journals that have reported on HKUST-1?,"MATCH (m:MOF {name: ""HKUST-1""})-[:has_publication]->(p:Publication)-[:in_journal]->(j:Journal) RETURN count(distinct j);",159,2,"[{""count(distinct j)"": 2}]"
What is the most common space group for MOFs?,"MATCH (m:MOF)-[r:has_spaceGroup]->(c:Space_Group) RETURN c.name, count(c) as freq ORDER BY freq DESC LIMIT 1",73,1,"[{""c.name"": ""C2/c"", ""freq"": 1430}]"
"What is the proportion of void area, expressed as a percentage, within the structure of MOF IRMOF-74?","MATCH (m:MOF) WHERE m.name CONTAINS 'IRMOF-74' RETURN m.refcode, m.name, m.percentage_void_space ORDER BY m.percentage_void_space",9,2,"[{""m.refcode"": ""RAVWOC"", ""m.name"": ""IRMOF-74-V-hex"", ""m.percentage_void_space"": 66.164}, {""m.refcode"": ""RAVWAO"", ""m.name"": ""IRMOF-74-III"", ""m.percentage_void_space"": 66.538}, {""m.refcode"": ""RAVVUH"", ""m.name"": ""IRMOF-74-II"", ""m.percentage_void_space"": 67.191}, {""m.refcode"": ""GINYIO"", ""m.name"": ""Ni-IRMOF-74-III"", ""m.percentage_void_space"": 67.223}, {""m.refcode"": ""GINYAG"", ""m.name"": ""Ni-IRMOF-74-II"", ""m.percentage_void_space"": 67.715}, {""m.refcode"": ""RAVWES"", ""m.name"": ""IRMOF-74-IV"", ""m.percentage_void_space"": 72.939}, {""m.refcode"": ""GINYOU"", ""m.name"": ""Ni-IRMOF-74-IV"", ""m.percentage_void_space"": 72.971}, {""m.refcode"": ""RAVXET"", ""m.name"": ""IRMOF-74-VI-oeg"", ""m.percentage_void_space"": 75.375}, {""m.refcode"": ""GINYUA"", ""m.name"": ""Ni-IRMOF-74-V"", ""m.percentage_void_space"": 76.732}, {""m.refcode"": ""RAVXAP"", ""m.name"": ""IRMOF-74-VII"", ""m.percentage_void_space"": 78.578}, {""m.refcode"": ""RAVWUI"", ""m.name"": ""IRMOF-74-VI"", ""m.percentage_void_space"": 79.822}, {""m.refcode"": ""RAVXIX"", ""m.name"": ""IRMOF-74-IX"", ""m.percentage_void_space"": 83.153}, {""m.refcode"": ""RAVXOD"", ""m.name"": ""IRMOF-74-XI"", ""m.percentage_void_space"": 85.617}]"
What is the term used to refer to the operation of synthesizing MOF-3?,MATCH (m:MOF)-[:has_publication]->(:Publication)<-[:has_publication]-(s:Synthesis_Procedure)-[:has_operation]->(so:Synthesis_Operation) WHERE m.name CONTAINS 'MOF-3' RETURN so.name,93,1,"[{""so.name"": ""heat""}, {""so.name"": ""dry""}, {""so.name"": ""prepare""}, {""so.name"": ""wash""}, {""so.name"": ""prepare""}, {""so.name"": ""heat""}, {""so.name"": ""wash""}, {""so.name"": ""dry""}, {""so.name"": ""cool""}, {""so.name"": ""wait""}, {""so.name"": ""prepare""}, {""so.name"": ""prepare""}, {""so.name"": ""wait""}, {""so.name"": ""wait""}, {""so.name"": ""prepare""}]"
