question,query,qsq_list_idx,question_idx,answer
What is the file name for the data associated with MOFs 'HKUST-1'?,"MATCH (m:MOF) WHERE m.name CONTAINS 'HKUST-1' RETURN m.refcode, m.name, m.filename",53,2,"[{""m.refcode"": ""DOTSOV42"", ""m.name"": ""HKUST-1"", ""m.filename"": ""dotsov42_P1""}, {""m.refcode"": ""FIQCEN"", ""m.name"": ""HKUST-1|Teaching Subset: MOFs"", ""m.filename"": ""fiqcen_P1_H""}, {""m.refcode"": ""FUNGAZ"", ""m.name"": ""HKUST-1 (as synthesised)"", ""m.filename"": ""fungaz_P1""}, {""m.refcode"": ""LUDLED"", ""m.name"": ""HKUST-1"", ""m.filename"": ""ludled_P1""}, {""m.refcode"": ""WULJUJ"", ""m.name"": ""HKUST-1 0.56(dideuteroacetylene)"", ""m.filename"": ""wuljuj_P1""}]"
List the filenames of the MOFs 'MOF-5.,"MATCH (m:MOF) WHERE m.name CONTAINS 'MOF-5' RETURN m.refcode, m.name, m.filename",34,0,"[{""m.refcode"": ""FAYPUS"", ""m.name"": ""DMOF-5"", ""m.filename"": ""faypus_P1""}, {""m.refcode"": ""LASYOU"", ""m.name"": ""MOF-505"", ""m.filename"": ""lasyou_P1""}, {""m.refcode"": ""MIBQAR"", ""m.name"": ""MOF-5"", ""m.filename"": ""mibqar_P1""}, {""m.refcode"": ""MIBQAR01"", ""m.name"": ""MOF-5"", ""m.filename"": ""mibqar01_P1""}, {""m.refcode"": ""MIBQAR02"", ""m.name"": ""MOF-5"", ""m.filename"": ""mibqar02_P1""}, {""m.refcode"": ""MIBQAR03"", ""m.name"": ""MOF-5"", ""m.filename"": ""mibqar03_P1""}, {""m.refcode"": ""MIBQAR04"", ""m.name"": ""MOF-5"", ""m.filename"": ""mibqar04_P1""}, {""m.refcode"": ""MIBQAR05"", ""m.name"": ""MOF-5"", ""m.filename"": ""mibqar05_P1""}, {""m.refcode"": ""MIBQAR06"", ""m.name"": ""MOF-5"", ""m.filename"": ""mibqar06_P1""}, {""m.refcode"": ""MIBQAR07"", ""m.name"": ""MOF-5"", ""m.filename"": ""mibqar07_P1""}, {""m.refcode"": ""MIBQAR08"", ""m.name"": ""MOF-5"", ""m.filename"": ""mibqar08_P1""}, {""m.refcode"": ""MIBQAR09"", ""m.name"": ""MOF-5"", ""m.filename"": ""mibqar09_P1""}, {""m.refcode"": ""MIBQAR10"", ""m.name"": ""MOF-5"", ""m.filename"": ""mibqar10_P1""}, {""m.refcode"": ""MIBQAR11"", ""m.name"": ""MOF-5"", ""m.filename"": ""mibqar11_P1""}, {""m.refcode"": ""MIBQAR12"", ""m.name"": ""MOF-5"", ""m.filename"": ""mibqar12_P1""}, {""m.refcode"": ""MIBQAR13"", ""m.name"": ""MOF-5"", ""m.filename"": ""mibqar13_P1""}, {""m.refcode"": ""MIBQAR14"", ""m.name"": ""MOF-5"", ""m.filename"": ""mibqar14_P1""}, {""m.refcode"": ""MIBQAR15"", ""m.name"": ""MOF-5"", ""m.filename"": ""mibqar15_P1""}, {""m.refcode"": ""MIBQAR16"", ""m.name"": ""MOF-5"", ""m.filename"": ""mibqar16_P1""}, {""m.refcode"": ""MIBQAR17"", ""m.name"": ""MOF-5"", ""m.filename"": ""mibqar17_P1""}, {""m.refcode"": ""MIBQAR18"", ""m.name"": ""MOF-5"", ""m.filename"": ""mibqar18_P1""}, {""m.refcode"": ""MIBQAR19"", ""m.name"": ""MOF-5"", ""m.filename"": ""mibqar19_P1""}, {""m.refcode"": ""MIBQAR20"", ""m.name"": ""MOF-5"", ""m.filename"": ""mibqar20_P1""}, {""m.refcode"": ""OFEDAH"", ""m.name"": ""GR-MOF-5"", ""m.filename"": ""ofedah_P1""}, {""m.refcode"": ""OMUKUE"", ""m.name"": ""TPMOF-5"", ""m.filename"": ""omukue_P1_charged""}, {""m.refcode"": ""OTECEX"", ""m.name"": ""\u0394-MOF-520 unknown solvate"", ""m.filename"": ""otecex_P1""}, {""m.refcode"": ""OTECUN"", ""m.name"": ""\u039b-MOF-520 trimesate unknown solvate"", ""m.filename"": ""otecun_P1""}, {""m.refcode"": ""OTEDEY"", ""m.name"": ""\u039b-MOF-520 3-(t-butoxycarbonylamino)propan-1,2-diolato unknown solvate"", ""m.filename"": ""otedey_P1""}, {""m.refcode"": ""OTEDOI"", ""m.name"": ""\u039b-MOF-520 unknown solvate"", ""m.filename"": ""otedoi_P1""}, {""m.refcode"": ""OTEDUO"", ""m.name"": ""\u039b-MOF-520 methanolate unknown solvate"", ""m.filename"": ""oteduo_P1""}, {""m.refcode"": ""QEFWUV"", ""m.name"": ""MOF-545"", ""m.filename"": ""qefwuv_P1_H""}, {""m.refcode"": ""QOXQEC"", ""m.name"": ""-MOF-520-24"", ""m.filename"": ""qoxqec_P1""}, {""m.refcode"": ""QOXQIG"", ""m.name"": ""-MOF-520-25"", ""m.filename"": ""qoxqig_P1""}, {""m.refcode"": ""QOXQUS"", ""m.name"": ""-MOF-520-27"", ""m.filename"": ""qoxqus_P1""}, {""m.refcode"": ""QOXRAZ"", ""m.name"": ""-MOF-520-28"", ""m.filename"": ""qoxraz_P1""}, {""m.refcode"": ""QOXRIH"", ""m.name"": ""-MOF-520-31-activated"", ""m.filename"": ""qoxrih_P1""}, {""m.refcode"": ""QOXRON"", ""m.name"": ""-MOF-520-S-32"", ""m.filename"": ""qoxron_P1_H""}, {""m.refcode"": ""QOXSAA"", ""m.name"": ""-MOF-520-22"", ""m.filename"": ""qoxsaa_P1""}, {""m.refcode"": ""QOXSOO"", ""m.name"": ""-MOF-520-R-32"", ""m.filename"": ""qoxsoo_P1""}, {""m.refcode"": ""QOXSUU"", ""m.name"": ""\u0394-MOF-520-17"", ""m.filename"": ""qoxsuu_P1""}, {""m.refcode"": ""QOXTOP"", ""m.name"": ""\u0394-MOF-520-21"", ""m.filename"": ""qoxtop_P1""}, {""m.refcode"": ""QOXVEH"", ""m.name"": ""-MOF-520 N,N-dimethylformamide solvate"", ""m.filename"": ""qoxveh_P1""}, {""m.refcode"": ""RIXPOF"", ""m.name"": ""MOF-519"", ""m.filename"": ""rixpof_P1_H""}, {""m.refcode"": ""RUVKAV"", ""m.name"": ""catena-[(\u03bc8-5,5'-Buta-1,3-diyne-1,4-diyldibenzene-1,3-dicarboxylato)-diaqua-di-copper(ii) dimethylformamide solvate trihydrate]|MOF-505"", ""m.filename"": ""ruvkav_P1""}, {""m.refcode"": ""SAHYIK"", ""m.name"": ""MOF-5|Teaching Subset: MOFs"", ""m.filename"": ""sahyik_P1""}, {""m.refcode"": ""SUFJEK"", ""m.name"": ""PMOF-55"", ""m.filename"": ""sufjek_P1""}, {""m.refcode"": ""TIHROU"", ""m.name"": ""MOF-591"", ""m.filename"": ""tihrou_P1_charged""}, {""m.refcode"": ""TIHRUA"", ""m.name"": ""MOF-592"", ""m.filename"": ""tihrua_P1_charged""}, {""m.refcode"": ""TIHTUC"", ""m.name"": ""MOF-590"", ""m.filename"": ""tihtuc_P1""}, {""m.refcode"": ""VUSKEA01"", ""m.name"": ""MOF-5"", ""m.filename"": ""vuskea01_P1""}]"
Who is the author with the highest number of publications on MOFs that share the same structure as MOF-5?,"MATCH (:MOF {name: 'MOF-5'})-[:has_topology]-(t:Topology) MATCH (m:MOF)-[:has_topology]-(t) MATCH (m)-[:has_publication]-(p:Publication) MATCH (p)-[:has_author]-(a:Author) RETURN COUNT(DISTINCT p), a.name ORDER BY COUNT(DISTINCT p) DESC LIMIT 1",139,1,"[{""COUNT(DISTINCT p)"": 11, ""a.name"": ""S.Kitagawa""}]"
What are the 'HKUST-1' MOFs that possess structural disorder?,"MATCH (m:MOF) WHERE (m.name CONTAINS 'HKUST-1') and (m.has_disorder = true) RETURN m.refcode, m.name, m.has_disorder",18,3,"[{""m.refcode"": ""FUNGAZ"", ""m.name"": ""HKUST-1 (as synthesised)"", ""m.has_disorder"": true}, {""m.refcode"": ""LUDLED"", ""m.name"": ""HKUST-1"", ""m.has_disorder"": true}, {""m.refcode"": ""WULJUJ"", ""m.name"": ""HKUST-1 0.56(dideuteroacetylene)"", ""m.has_disorder"": true}]"
"Count the number of Authors associated with the publication of the MOF that has the Crystal_System of ""triclinic"" and a name including ""IRMOF"".","MATCH (m:MOF)-[:has_crystalSystem]->(cs:Crystal_System {name: ""triclinic""}), (m)-[:has_publication]->(p:Publication), (p)-[:has_author]->(a:Author) WHERE m.name CONTAINS 'IRMOF' RETURN count(distinct a);",151,2,"[{""count(distinct a)"": 7}]"
"Identify the name of the Organic_Linker utilized in the MOF with the Crystal_System of ""orthorhombic"" and the name including ""IRMOF""?","MATCH (m:MOF)-[:has_crystalSystem]->(cs:Crystal_System {name: ""orthorhombic""}), (m)-[:has_organicLinker]->(ol:Organic_Linker) WHERE m.name CONTAINS 'IRMOF' RETURN ol.name;",154,1,"[{""ol.name"": ""[O-]C(=O)c1ccc(cc1)C(=O)[O-]""}]"
Can you provide the deposition number assigned to the MOFs 'HKUST-1' in the database?,"MATCH (m:MOF) WHERE m.name CONTAINS 'HKUST-1' RETURN m.refcode, m.name, m.deposition_number",52,1,"[{""m.refcode"": ""DOTSOV42"", ""m.name"": ""HKUST-1"", ""m.deposition_number"": 755080.0}, {""m.refcode"": ""FIQCEN"", ""m.name"": ""HKUST-1|Teaching Subset: MOFs"", ""m.deposition_number"": 112954.0}, {""m.refcode"": ""FUNGAZ"", ""m.name"": ""HKUST-1 (as synthesised)"", ""m.deposition_number"": 1950115.0}, {""m.refcode"": ""LUDLED"", ""m.name"": ""HKUST-1"", ""m.deposition_number"": 943962.0}, {""m.refcode"": ""WULJUJ"", ""m.name"": ""HKUST-1 0.56(dideuteroacetylene)"", ""m.deposition_number"": 755081.0}]"
What individual has the highest number of published MOFs?,"MATCH (mof:MOF)-[:has_publication]-(pub:Publication)-[:has_author]-(j:Author) RETURN j.name, count(j) as freq ORDER BY freq DESC LIMIT 1",62,2,"[{""j.name"": ""P.D.C.Dietzel"", ""freq"": 418}]"
Can you provide the title of the article that describes the synthetic procedure and properties of HKUST-1?,"MATCH (m:MOF)-[:has_publication]-(p:Publication)-[:has_publication]-(s:Synthesis_Procedure) WHERE m.name CONTAINS 'HKUST-1' RETURN p.year, p.volume,p.doi",96,2,"[{""p.year"": 2009, ""p.volume"": 131, ""p.doi"": ""10.1021/ja904782h""}, {""p.year"": 2009, ""p.volume"": 131, ""p.doi"": ""10.1021/ja904782h""}]"
"Which MOF with ""MIL"" in its name shares the same structure as MOF-5?",MATCH (m1:MOF {name: 'MOF-5'})-[:has_topology]->(t:Topology) Match (t)-[:has_topology]-(m:MOF) MATCH (m) WHERE m.name CONTAINS 'MIL' RETURN DISTINCT m.name,132,3,"[{""m.name"": ""MIL-59""}]"
"For the MOF named 'MOF-3', which metal precursor is linked to the synthesis procedure with the highest property value?",MATCH (m:MOF)-[:has_publication]->(:Publication)<-[:has_publication]-(s:Synthesis_Procedure)-[:has_metal_precursor]->(mp:Synthesis_Metal_Precursor) MATCH (s)-[:has_property]->(p:Synthesis_Property) WHERE m.name CONTAINS 'MOF-3' WITH max(p.value) as max MATCH (m1:MOF)-[:has_publication]->(:Publication)<-[:has_publication]-(s1:Synthesis_Procedure)-[:has_metal_precursor]->(mp1:Synthesis_Metal_Precursor) MATCH (s1)-[:has_property]->(p1:Synthesis_Property) WHERE (m1.name CONTAINS 'MOF-3') and  (p1.value=max) RETURN mp1.name,115,1,"[{""mp1.name"": ""Cd(NO3)2\u22c54H2O""}]"
What is maximum property value of the synthesis procedures associated with a MOF whose name contains 'MOF-3'?,MATCH (m:MOF)-[:has_publication]->(:Publication)<-[:has_publication]-(s:Synthesis_Procedure)-[:has_property]->(p:Synthesis_Property) WHERE m.name CONTAINS 'MOF-3' RETURN max(p.value),114,0,"[{""max(p.value)"": ""57""}]"
What is the typical amount of atoms found in each MOF-5 structure on average?,"MATCH (m:MOF)-[:has_atom]->(a:Atom) WHERE m.name CONTAINS 'MOF-5'  WITH count(DISTINCT m.name) AS num_mof, count(DISTINCT a.name) AS num_atom RETURN toFloat(num_atom) / toFloat(num_mof)",140,2,"[{""toFloat(num_atom) / toFloat(num_mof)"": 38.827586206896555}]"
What is the mean count of atoms in a single MOF-5 framework?,"MATCH (m:MOF)-[:has_atom]->(a:Atom) WHERE m.name CONTAINS 'MOF-5'  WITH count(DISTINCT m.name) AS num_mof, count(DISTINCT a.name) AS num_atom RETURN toFloat(num_atom) / toFloat(num_mof)",140,1,"[{""toFloat(num_atom) / toFloat(num_mof)"": 38.827586206896555}]"
Which author has published the most MOFs?,"MATCH (mof:MOF)-[:has_publication]-(pub:Publication)-[:has_author]-(j:Author) RETURN j.name, count(j) as freq ORDER BY freq DESC LIMIT 1",62,1,"[{""j.name"": ""P.D.C.Dietzel"", ""freq"": 418}]"
Who are the 5 authors with the highest number of published MOFs?,"MATCH (mof:MOF)-[:has_publication]-(pub:Publication)-[:has_author]-(j:Author) RETURN j.name, count(j) as freq ORDER BY freq DESC LIMIT 5",63,1,"[{""j.name"": ""P.D.C.Dietzel"", ""freq"": 418}, {""j.name"": ""M.H.Rosnes"", ""freq"": 392}, {""j.name"": ""B.Pato-Doldan"", ""freq"": 380}, {""j.name"": ""Jian Zhang"", ""freq"": 231}, {""j.name"": ""Jie-Peng Zhang"", ""freq"": 146}]"
What is the publication date of the most recent research article on the MOF 'MOF-3'?,MATCH (m:MOF)-[:has_publication]->(p:Publication) WHERE m.name CONTAINS 'MOF-3' RETURN max(p.year),109,2,"[{""max(p.year)"": 2018}]"
What is the size of the angle formed between the b-axis and c-axis for the unit cell of MOFs 'HKUST-1'?,"MATCH (m:MOF) WHERE m.name CONTAINS 'HKUST-1' RETURN m.refcode, m.name, m.cell_angles",45,3,"[{""m.refcode"": ""DOTSOV42"", ""m.name"": ""HKUST-1"", ""m.cell_angles"": ""CellAngles(alpha=90.0, beta=90.0, gamma=90.0)""}, {""m.refcode"": ""FIQCEN"", ""m.name"": ""HKUST-1|Teaching Subset: MOFs"", ""m.cell_angles"": ""CellAngles(alpha=90.0, beta=90.0, gamma=90.0)""}, {""m.refcode"": ""FUNGAZ"", ""m.name"": ""HKUST-1 (as synthesised)"", ""m.cell_angles"": ""CellAngles(alpha=90.0, beta=90.0, gamma=90.0)""}, {""m.refcode"": ""LUDLED"", ""m.name"": ""HKUST-1"", ""m.cell_angles"": ""CellAngles(alpha=90.0, beta=90.0, gamma=90.0)""}, {""m.refcode"": ""WULJUJ"", ""m.name"": ""HKUST-1 0.56(dideuteroacetylene)"", ""m.cell_angles"": ""CellAngles(alpha=90.0, beta=90.0, gamma=90.0)""}]"
"Among all MOFs named 'MOF-3', which metal precursor is utilized in the synthesis procedure with the highest value for any property?",MATCH (m:MOF)-[:has_publication]->(:Publication)<-[:has_publication]-(s:Synthesis_Procedure)-[:has_metal_precursor]->(mp:Synthesis_Metal_Precursor) MATCH (s)-[:has_property]->(p:Synthesis_Property) WHERE m.name CONTAINS 'MOF-3' WITH max(p.value) as max MATCH (m1:MOF)-[:has_publication]->(:Publication)<-[:has_publication]-(s1:Synthesis_Procedure)-[:has_metal_precursor]->(mp1:Synthesis_Metal_Precursor) MATCH (s1)-[:has_property]->(p1:Synthesis_Property) WHERE (m1.name CONTAINS 'MOF-3') and  (p1.value=max) RETURN mp1.name,115,3,"[{""mp1.name"": ""Cd(NO3)2\u22c54H2O""}]"
The most common MOF topology has what RCSR code?,"MATCH (m:MOF)-[r:has_topology]->(c:Topology) RETURN c.rcsr_code, count(c) as freq ORDER BY freq DESC LIMIT 1",71,0,"[{""c.rcsr_code"": ""UNKNOWN"", ""freq"": 2960}]"
What is the predominant organic linker employed in the synthesis of MOFs with space group similar to MOF-5?,"MATCH (m1:MOF)-[:has_spaceGroup]->(s:Space_Group)-[:has_spaceGroup]-(m2:MOF)-[:has_organicLinker]->(o) WITH o.name as organicLinker, count(distinct m2) as numSynthesized ORDER BY numSynthesized DESC LIMIT 1 RETURN organicLinker;",143,2,"[{""organicLinker"": ""[O-]C(=O)c1cc([O])c(cc1[O])C(=O)[O-]""}]"
"What is the chemical formula of HKUST-1, an MOF?","MATCH (m:MOF) WHERE m.name CONTAINS 'HKUST-1' RETURN m.refcode, m.name, m.chemical_formula",6,1,"[{""m.refcode"": ""DOTSOV42"", ""m.name"": ""HKUST-1"", ""m.chemical_formula"": ""(C36 H12 Cu6 O24)n""}, {""m.refcode"": ""FIQCEN"", ""m.name"": ""HKUST-1|Teaching Subset: MOFs"", ""m.chemical_formula"": ""(C18 H12 Cu3 O15)n,10n(H2 O1)""}, {""m.refcode"": ""FUNGAZ"", ""m.name"": ""HKUST-1 (as synthesised)"", ""m.chemical_formula"": ""(C18 H12 Cu3 O15)n""}, {""m.refcode"": ""LUDLED"", ""m.name"": ""HKUST-1"", ""m.chemical_formula"": ""(C18 H12 Cu3 O15)n,7n(H2 O1)""}, {""m.refcode"": ""WULJUJ"", ""m.name"": ""HKUST-1 0.56(dideuteroacetylene)"", ""m.chemical_formula"": ""(C36 H12 Cu6 O24)n,3.4n(C2 D2)""}]"
From which databases were the MOFs 'IRMOF' sourced?,"MATCH (m:MOF) WHERE m.name CONTAINS 'IRMOF' RETURN m.refcode, m.name, m.database_name",21,2,"[{""m.refcode"": ""GINYAG"", ""m.name"": ""Ni-IRMOF-74-II"", ""m.database_name"": ""as543be_ASER""}, {""m.refcode"": ""GINYIO"", ""m.name"": ""Ni-IRMOF-74-III"", ""m.database_name"": ""as543be_ASER""}, {""m.refcode"": ""GINYOU"", ""m.name"": ""Ni-IRMOF-74-IV"", ""m.database_name"": ""as543be_ASER""}, {""m.refcode"": ""GINYUA"", ""m.name"": ""Ni-IRMOF-74-V"", ""m.database_name"": ""as543be_ASER""}, {""m.refcode"": ""HOLQAC"", ""m.name"": ""\u03b1-IRMOF-3-AMPh"", ""m.database_name"": ""as543be_ASER""}, {""m.refcode"": ""NODTEH"", ""m.name"": ""IRMOF-23terp"", ""m.database_name"": ""as543be_ASER""}, {""m.refcode"": ""NODTIL"", ""m.name"": ""IRMOF-25terPh"", ""m.database_name"": ""as543be_ASER""}, {""m.refcode"": ""NODTOR"", ""m.name"": ""IRMOF-pentane"", ""m.database_name"": ""as543be_ASER""}, {""m.refcode"": ""NUVYEK"", ""m.name"": ""IRMOF-61"", ""m.database_name"": ""as543be_ASER""}, {""m.refcode"": ""NUVYIO"", ""m.name"": ""IRMOF-62"", ""m.database_name"": ""as543be_ASER""}, {""m.refcode"": ""PIWLIT"", ""m.name"": ""IRMOF-9"", ""m.database_name"": ""as543be_ASER""}, {""m.refcode"": ""RAVVUH"", ""m.name"": ""IRMOF-74-II"", ""m.database_name"": ""as543be_ASER""}, {""m.refcode"": ""RAVWAO"", ""m.name"": ""IRMOF-74-III"", ""m.database_name"": ""as543be_ASER""}, {""m.refcode"": ""RAVWES"", ""m.name"": ""IRMOF-74-IV"", ""m.database_name"": ""as543be_ASER""}, {""m.refcode"": ""RAVWOC"", ""m.name"": ""IRMOF-74-V-hex"", ""m.database_name"": ""as543be_ASER""}, {""m.refcode"": ""RAVWUI"", ""m.name"": ""IRMOF-74-VI"", ""m.database_name"": ""as543be_ASER""}, {""m.refcode"": ""RAVXAP"", ""m.name"": ""IRMOF-74-VII"", ""m.database_name"": ""as543be_ASER""}, {""m.refcode"": ""RAVXET"", ""m.name"": ""IRMOF-74-VI-oeg"", ""m.database_name"": ""as543be_ASER""}, {""m.refcode"": ""RAVXIX"", ""m.name"": ""IRMOF-74-IX"", ""m.database_name"": ""as543be_ASER""}, {""m.refcode"": ""RAVXOD"", ""m.name"": ""IRMOF-74-XI"", ""m.database_name"": ""as543be_ASER""}, {""m.refcode"": ""RUTPAY01"", ""m.name"": ""IRMOF-77"", ""m.database_name"": ""as543be_ASER""}, {""m.refcode"": ""WORKUL"", ""m.name"": ""INT-IRMOF-8-C"", ""m.database_name"": ""as543be_ASER""}, {""m.refcode"": ""WORLAS"", ""m.name"": ""INT-IRMOF-8-B"", ""m.database_name"": ""as543be_ASER""}]"
What is the maximum temperature applied in any synthesis process that is associated with MOFs named 'MOF-3'?,MATCH (m:MOF)-[:has_publication]->(:Publication)<-[:has_publication]-(s:Synthesis_Procedure)-[:has_operation]->(o:Synthesis_Operation)-[:has_condition]->(c:Synthesis_Operation_Condition) WHERE (m.name CONTAINS 'MOF-3') and (c.Property='Temperature') WITH toFloat(c.Value) as val RETURN max(val),117,1,"[{""max(val)"": 293.0}]"
From where was the experimental data collected to determine the structure of MOFs 'HKUST-1'?,"MATCH (m:MOF) WHERE m.name CONTAINS 'HKUST-1' RETURN m.refcode, m.name, m.datasource",51,1,"[{""m.refcode"": ""DOTSOV42"", ""m.name"": ""HKUST-1"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""FIQCEN"", ""m.name"": ""HKUST-1|Teaching Subset: MOFs"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""FUNGAZ"", ""m.name"": ""HKUST-1 (as synthesised)"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""LUDLED"", ""m.name"": ""HKUST-1"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""WULJUJ"", ""m.name"": ""HKUST-1 0.56(dideuteroacetylene)"", ""m.datasource"": ""CSD""}]"
What is the time period for the synthesis of MOF-3?,"MATCH (m:MOF)-[:has_publication]->(:Publication)<-[:has_publication]-(s:Synthesis_Procedure)-[:has_time]->(st:Synthesis_Time) WHERE m.name CONTAINS 'MOF-3' RETURN st.Value, st.Unit",89,3,"[{""st.Value"": ""72"", ""st.Unit"": ""h1.0""}, {""st.Value"": ""72"", ""st.Unit"": ""h1.0""}, {""st.Value"": ""48.0"", ""st.Unit"": ""h1.0""}, {""st.Value"": ""48.0"", ""st.Unit"": ""h1.0""}, {""st.Value"": ""48.0"", ""st.Unit"": ""h1.0""}]"
What is the chemical name of the ligand used to synthesize the MOFs 'MOF-3'?,"MATCH (m:MOF)-[:has_organicLinker]->(l:Organic_Linker) WHERE m.name CONTAINS 'MOF-3' RETURN m.refcode, m.name, l.name",54,0,"[{""m.refcode"": ""CEFNOT"", ""m.name"": ""she-MOF-3"", ""l.name"": ""[O-]C(=O)c1ccc(cc1)C#Cc1ccc(cc1)c1c(c2ccc(cc2)C#Cc2ccc(cc2)C(=O)[O-])c(c2ccc(cc2)C#Cc2ccc(cc2)C(=O)[O-])c(c(c1c1ccc(cc1)C#Cc1ccc(cc1)C(=O)[O-])c1ccc(cc1)C#Cc1ccc(cc1)C(=O)[O-])c1ccc(cc1)C#Cc1ccc(cc1)C(=O)[O-]""}, {""m.refcode"": ""FAYPIG"", ""m.name"": ""DMOF-3"", ""l.name"": ""CC1=CC2=NN=NC2=C[CH]1""}, {""m.refcode"": ""FEYQIK"", ""m.name"": ""GWMOF-3"", ""l.name"": ""[O-]C(=O)CCCCC(=O)[O-]""}, {""m.refcode"": ""HOLQAC"", ""m.name"": ""\u03b1-IRMOF-3-AMPh"", ""l.name"": ""O=C(c1ccccc1)Nc1cc(ccc1C(=O)[O-])C(=O)[O-]""}, {""m.refcode"": ""KITVEQ"", ""m.name"": ""MOF-3"", ""l.name"": ""[O-]C(=O)[C]1[CH][C](OC[C]2C=Cc3c4[C]2C=CC25c4c(cc3)[CH]C5[CH]2)[CH]C(=C1)C(=O)[O-]""}, {""m.refcode"": ""LAJKUE"", ""m.name"": ""CD-MOF-3"", ""l.name"": ""[O]CC1OC2OC3C(C[O])OC(C(C3[O])[O])OC3C(C[O])OC(C(C3[O])[O])OC3C(C[O])OC(C(C3[O])[O])OC3C(OC(OC4C(OC(OC5C(OC(OC6C(OC(OC1C(C2[O])[O])C([O])C6[O])C[O])C([O])C5[O])C[O])C([O])C4[O])C[O])C(C3[O])[O])C[O]""}, {""m.refcode"": ""MIFGEQ"", ""m.name"": ""TMOF-3"", ""l.name"": ""[O]S(Cc1cc(CS([O])([O])[O])c(cc1CS([O])([O])[O])CS([O])([O])[O])([O])[O]""}, {""m.refcode"": ""PIKYAM"", ""m.name"": ""JUST-3|LMOF-311"", ""l.name"": ""O=CN(C)C""}]"
Can you identify the database or publication that provided data for MOF 'MOF-5'?,"MATCH (m:MOF) WHERE m.name CONTAINS 'MOF-5' RETURN m.refcode, m.name, m.datasource",28,2,"[{""m.refcode"": ""FAYPUS"", ""m.name"": ""DMOF-5"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""LASYOU"", ""m.name"": ""MOF-505"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""MIBQAR"", ""m.name"": ""MOF-5"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""MIBQAR01"", ""m.name"": ""MOF-5"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""MIBQAR02"", ""m.name"": ""MOF-5"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""MIBQAR03"", ""m.name"": ""MOF-5"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""MIBQAR04"", ""m.name"": ""MOF-5"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""MIBQAR05"", ""m.name"": ""MOF-5"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""MIBQAR06"", ""m.name"": ""MOF-5"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""MIBQAR07"", ""m.name"": ""MOF-5"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""MIBQAR08"", ""m.name"": ""MOF-5"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""MIBQAR09"", ""m.name"": ""MOF-5"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""MIBQAR10"", ""m.name"": ""MOF-5"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""MIBQAR11"", ""m.name"": ""MOF-5"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""MIBQAR12"", ""m.name"": ""MOF-5"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""MIBQAR13"", ""m.name"": ""MOF-5"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""MIBQAR14"", ""m.name"": ""MOF-5"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""MIBQAR15"", ""m.name"": ""MOF-5"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""MIBQAR16"", ""m.name"": ""MOF-5"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""MIBQAR17"", ""m.name"": ""MOF-5"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""MIBQAR18"", ""m.name"": ""MOF-5"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""MIBQAR19"", ""m.name"": ""MOF-5"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""MIBQAR20"", ""m.name"": ""MOF-5"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""OFEDAH"", ""m.name"": ""GR-MOF-5"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""OMUKUE"", ""m.name"": ""TPMOF-5"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""OTECEX"", ""m.name"": ""\u0394-MOF-520 unknown solvate"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""OTECUN"", ""m.name"": ""\u039b-MOF-520 trimesate unknown solvate"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""OTEDEY"", ""m.name"": ""\u039b-MOF-520 3-(t-butoxycarbonylamino)propan-1,2-diolato unknown solvate"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""OTEDOI"", ""m.name"": ""\u039b-MOF-520 unknown solvate"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""OTEDUO"", ""m.name"": ""\u039b-MOF-520 methanolate unknown solvate"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""QEFWUV"", ""m.name"": ""MOF-545"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""QOXQEC"", ""m.name"": ""-MOF-520-24"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""QOXQIG"", ""m.name"": ""-MOF-520-25"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""QOXQUS"", ""m.name"": ""-MOF-520-27"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""QOXRAZ"", ""m.name"": ""-MOF-520-28"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""QOXRIH"", ""m.name"": ""-MOF-520-31-activated"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""QOXRON"", ""m.name"": ""-MOF-520-S-32"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""QOXSAA"", ""m.name"": ""-MOF-520-22"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""QOXSOO"", ""m.name"": ""-MOF-520-R-32"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""QOXSUU"", ""m.name"": ""\u0394-MOF-520-17"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""QOXTOP"", ""m.name"": ""\u0394-MOF-520-21"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""QOXVEH"", ""m.name"": ""-MOF-520 N,N-dimethylformamide solvate"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""RIXPOF"", ""m.name"": ""MOF-519"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""RUVKAV"", ""m.name"": ""catena-[(\u03bc8-5,5'-Buta-1,3-diyne-1,4-diyldibenzene-1,3-dicarboxylato)-diaqua-di-copper(ii) dimethylformamide solvate trihydrate]|MOF-505"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""SAHYIK"", ""m.name"": ""MOF-5|Teaching Subset: MOFs"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""SUFJEK"", ""m.name"": ""PMOF-55"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""TIHROU"", ""m.name"": ""MOF-591"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""TIHRUA"", ""m.name"": ""MOF-592"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""TIHTUC"", ""m.name"": ""MOF-590"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""VUSKEA01"", ""m.name"": ""MOF-5"", ""m.datasource"": ""CSD""}]"
What is the SMILES code for the organic precursor applied in the synthesis of MOF-3?,MATCH (m:MOF)-[:has_publication]->(:Publication)<-[:has_publication]-(s:Synthesis_Procedure)-[:has_organic_precursor]->(op:Synthesis_Organic_Precursor) WHERE m.name CONTAINS 'MOF-3' RETURN DISTINCT op.smiles,84,2,"[{""op.smiles"": ""O=C(O)CCCCC(=O)O""}, {""op.smiles"": """"}]"
Which families have the highest number of MOFs?,"MATCH (m:MOF)-[r:has_family]->(c:Family) RETURN c.name, count(c) as freq ORDER BY freq DESC LIMIT 5",66,2,"[{""c.name"": ""Zn-oxide/zinc oxide"", ""freq"": 1012}, {""c.name"": ""MOF-74/CPO-27"", ""freq"": 507}, {""c.name"": ""Cu-Cu paddleWheels/HKUST-1"", ""freq"": 218}, {""c.name"": ""Zn-oxide/zinc oxide, IRMOF"", ""freq"": 168}, {""c.name"": ""Zr-oxide/zirconium oxide/UiO-66"", ""freq"": 136}]"
What are the top 10 RCSR codes assigned to the different MOF topologies?,"MATCH (m:MOF)-[r:has_topology]->(c:Topology) RETURN c.rcsr_code, count(c) as freq ORDER BY freq DESC LIMIT 10",72,3,"[{""c.rcsr_code"": ""UNKNOWN"", ""freq"": 2960}, {""c.rcsr_code"": ""ERROR"", ""freq"": 2264}, {""c.rcsr_code"": ""pcu"", ""freq"": 715}, {""c.rcsr_code"": ""dia"", ""freq"": 491}, {""c.rcsr_code"": ""sql"", ""freq"": 296}, {""c.rcsr_code"": ""pts"", ""freq"": 195}, {""c.rcsr_code"": ""nbo"", ""freq"": 152}, {""c.rcsr_code"": ""rtl"", ""freq"": 134}, {""c.rcsr_code"": ""ths"", ""freq"": 114}, {""c.rcsr_code"": ""srs"", ""freq"": 112}]"
Can you tell me the dimension of the a-axis for the unit cell of MOFs 'HKUST-1'?,"MATCH (m:MOF) WHERE m.name CONTAINS 'HKUST-1' RETURN m.refcode, m.name, m.cell_lengths",42,1,"[{""m.refcode"": ""DOTSOV42"", ""m.name"": ""HKUST-1"", ""m.cell_lengths"": ""CellLengths(a=26.287910000000004, b=26.287910000000004, c=26.287910000000004)""}, {""m.refcode"": ""FIQCEN"", ""m.name"": ""HKUST-1|Teaching Subset: MOFs"", ""m.cell_lengths"": ""CellLengths(a=26.343, b=26.343, c=26.343)""}, {""m.refcode"": ""FUNGAZ"", ""m.name"": ""HKUST-1 (as synthesised)"", ""m.cell_lengths"": ""CellLengths(a=26.3518, b=26.3518, c=26.3518)""}, {""m.refcode"": ""LUDLED"", ""m.name"": ""HKUST-1"", ""m.cell_lengths"": ""CellLengths(a=26.315, b=26.315, c=26.315)""}, {""m.refcode"": ""WULJUJ"", ""m.name"": ""HKUST-1 0.56(dideuteroacetylene)"", ""m.cell_lengths"": ""CellLengths(a=26.3256, b=26.3256, c=26.3256)""}]"
What is the numerical value assigned to the unit cell volume of MOF 'IRMOF'?,"MATCH (m:MOF) WHERE m.name CONTAINS 'IRMOF' RETURN m.refcode, m.name, m.cell_volume",19,2,"[{""m.refcode"": ""GINYAG"", ""m.name"": ""Ni-IRMOF-74-II"", ""m.cell_volume"": 7830.333812081704}, {""m.refcode"": ""GINYIO"", ""m.name"": ""Ni-IRMOF-74-III"", ""m.cell_volume"": 12437.013749172813}, {""m.refcode"": ""GINYOU"", ""m.name"": ""Ni-IRMOF-74-IV"", ""m.cell_volume"": 17970.850545481026}, {""m.refcode"": ""GINYUA"", ""m.name"": ""Ni-IRMOF-74-V"", ""m.cell_volume"": 28277.205833670298}, {""m.refcode"": ""HOLQAC"", ""m.name"": ""\u03b1-IRMOF-3-AMPh"", ""m.cell_volume"": 16733.018068609374}, {""m.refcode"": ""NODTEH"", ""m.name"": ""IRMOF-23terp"", ""m.cell_volume"": 16689.48558799738}, {""m.refcode"": ""NODTIL"", ""m.name"": ""IRMOF-25terPh"", ""m.cell_volume"": 16619.052977674055}, {""m.refcode"": ""NODTOR"", ""m.name"": ""IRMOF-pentane"", ""m.cell_volume"": 16911.001339142396}, {""m.refcode"": ""NUVYEK"", ""m.name"": ""IRMOF-61"", ""m.cell_volume"": 15328.107369796588}, {""m.refcode"": ""NUVYIO"", ""m.name"": ""IRMOF-62"", ""m.cell_volume"": 32931.673848748665}, {""m.refcode"": ""PIWLIT"", ""m.name"": ""IRMOF-9"", ""m.cell_volume"": 7119.219717999888}, {""m.refcode"": ""RAVVUH"", ""m.name"": ""IRMOF-74-II"", ""m.cell_volume"": 7795.566443322164}, {""m.refcode"": ""RAVWAO"", ""m.name"": ""IRMOF-74-III"", ""m.cell_volume"": 11780.842833048522}, {""m.refcode"": ""RAVWES"", ""m.name"": ""IRMOF-74-IV"", ""m.cell_volume"": 17942.24811706026}, {""m.refcode"": ""RAVWOC"", ""m.name"": ""IRMOF-74-V-hex"", ""m.cell_volume"": 26610.98899515233}, {""m.refcode"": ""RAVWUI"", ""m.name"": ""IRMOF-74-VI"", ""m.cell_volume"": 36505.4901309066}, {""m.refcode"": ""RAVXAP"", ""m.name"": ""IRMOF-74-VII"", ""m.cell_volume"": 51176.31646333511}, {""m.refcode"": ""RAVXET"", ""m.name"": ""IRMOF-74-VI-oeg"", ""m.cell_volume"": 51947.5784373008}, {""m.refcode"": ""RAVXIX"", ""m.name"": ""IRMOF-74-IX"", ""m.cell_volume"": 77838.75644709257}, {""m.refcode"": ""RAVXOD"", ""m.name"": ""IRMOF-74-XI"", ""m.cell_volume"": 128222.51086634406}, {""m.refcode"": ""RUTPAY01"", ""m.name"": ""IRMOF-77"", ""m.cell_volume"": 59427.41525399425}, {""m.refcode"": ""WORKUL"", ""m.name"": ""INT-IRMOF-8-C"", ""m.cell_volume"": 6482.926841135814}, {""m.refcode"": ""WORLAS"", ""m.name"": ""INT-IRMOF-8-B"", ""m.cell_volume"": 6409.715670913836}]"
"How is 'MOF-3' prepared, and what are the steps involved in its synthesis?","MATCH (m:MOF)-[:has_publication]->(:Publication)<-[:has_publication]-(s:Synthesis_Procedure)-[:has_operation]->(o:Synthesis_Operation) WHERE m.name CONTAINS 'MOF-3' RETURN s.syn_id, o.name, o.order ORDER BY s.syn_id, o.order ASC",130,3,"[{""s.syn_id"": ""MIsyn11346"", ""o.name"": ""prepare"", ""o.order"": 0}, {""s.syn_id"": ""MIsyn11346"", ""o.name"": ""wait"", ""o.order"": 1}, {""s.syn_id"": ""MIsyn11347"", ""o.name"": ""prepare"", ""o.order"": 0}, {""s.syn_id"": ""MIsyn11347"", ""o.name"": ""wait"", ""o.order"": 1}, {""s.syn_id"": ""MIsyn11348"", ""o.name"": ""prepare"", ""o.order"": 0}, {""s.syn_id"": ""MIsyn11348"", ""o.name"": ""wait"", ""o.order"": 1}, {""s.syn_id"": ""MIsyn8200"", ""o.name"": ""heat"", ""o.order"": 0}, {""s.syn_id"": ""MIsyn8200"", ""o.name"": ""cool"", ""o.order"": 1}, {""s.syn_id"": ""MIsyn8200"", ""o.name"": ""wash"", ""o.order"": 2}, {""s.syn_id"": ""MIsyn8200"", ""o.name"": ""dry"", ""o.order"": 3}, {""s.syn_id"": ""MIsyn8201"", ""o.name"": ""prepare"", ""o.order"": 0}, {""s.syn_id"": ""MIsyn8201"", ""o.name"": ""heat"", ""o.order"": 1}, {""s.syn_id"": ""MIsyn8201"", ""o.name"": ""wash"", ""o.order"": 2}, {""s.syn_id"": ""MIsyn8201"", ""o.name"": ""dry"", ""o.order"": 3}, {""s.syn_id"": ""MIsyn8201"", ""o.name"": ""prepare"", ""o.order"": 4}]"
What is the temperature used in the synthesis of MOF-3?,"MATCH (m:MOF)-[:has_publication]->(:Publication)<-[:has_publication]-(s:Synthesis_Procedure)-[:has_temperature]->(t:Synthesis_Temperature) WHERE m.name CONTAINS 'MOF-3' RETURN t.Value, t.Unit",87,0,"[{""t.Value"": 393.15, ""t.Unit"": ""K1.0""}, {""t.Value"": 453.15, ""t.Unit"": ""K1.0""}, {""t.Value"": 353.15, ""t.Unit"": ""K1.0""}, {""t.Value"": 353.15, ""t.Unit"": ""K1.0""}, {""t.Value"": 398.15, ""t.Unit"": ""K1.0""}]"
How many MOF groups have used the metal present in MOF-5 in their synthesis?,MATCH (:MOF {name: 'MOF-5'})-[:has_metal]->(m:Metal)<-[:has_metal]-(:MOF)-[:has_family]->(f:Family) RETURN COUNT(DISTINCT f.name);,135,2,"[{""COUNT(DISTINCT f.name)"": 1}]"
What is the organic composition of the MOF 'MOF-3' with the least value for any synthesis property?,MATCH (m:MOF)-[:has_publication]->(:Publication)<-[:has_publication]-(s:Synthesis_Procedure)-[:has_organic_precursor]->(op:Synthesis_Organic_Precursor)-[:has_composition]->(oc:Organic_Composition) MATCH (s)-[:has_property]->(p:Synthesis_Property) WHERE m.name CONTAINS 'MOF-3' RETURN oc.value ORDER BY p.value ASC LIMIT 1,118,3,"[{""oc.value"": 8.1}]"
