question,query,qsq_list_idx,question_idx,answer
Can you provide the z value for MOF 'IRMOF'?,"MATCH (m:MOF) WHERE m.name CONTAINS 'IRMOF' RETURN m.refcode, m.name, m.z_value",20,2,"[{""m.refcode"": ""GINYAG"", ""m.name"": ""Ni-IRMOF-74-II"", ""m.z_value"": 9.0}, {""m.refcode"": ""GINYIO"", ""m.name"": ""Ni-IRMOF-74-III"", ""m.z_value"": 9.0}, {""m.refcode"": ""GINYOU"", ""m.name"": ""Ni-IRMOF-74-IV"", ""m.z_value"": 9.0}, {""m.refcode"": ""GINYUA"", ""m.name"": ""Ni-IRMOF-74-V"", ""m.z_value"": 9.0}, {""m.refcode"": ""HOLQAC"", ""m.name"": ""\u03b1-IRMOF-3-AMPh"", ""m.z_value"": 8.0}, {""m.refcode"": ""NODTEH"", ""m.name"": ""IRMOF-23terp"", ""m.z_value"": 8.0}, {""m.refcode"": ""NODTIL"", ""m.name"": ""IRMOF-25terPh"", ""m.z_value"": 8.0}, {""m.refcode"": ""NODTOR"", ""m.name"": ""IRMOF-pentane"", ""m.z_value"": 8.0}, {""m.refcode"": ""NUVYEK"", ""m.name"": ""IRMOF-61"", ""m.z_value"": 4.0}, {""m.refcode"": ""NUVYIO"", ""m.name"": ""IRMOF-62"", ""m.z_value"": 6.0}, {""m.refcode"": ""PIWLIT"", ""m.name"": ""IRMOF-9"", ""m.z_value"": 4.0}, {""m.refcode"": ""RAVVUH"", ""m.name"": ""IRMOF-74-II"", ""m.z_value"": 9.0}, {""m.refcode"": ""RAVWAO"", ""m.name"": ""IRMOF-74-III"", ""m.z_value"": 9.0}, {""m.refcode"": ""RAVWES"", ""m.name"": ""IRMOF-74-IV"", ""m.z_value"": 9.0}, {""m.refcode"": ""RAVWOC"", ""m.name"": ""IRMOF-74-V-hex"", ""m.z_value"": 9.0}, {""m.refcode"": ""RAVWUI"", ""m.name"": ""IRMOF-74-VI"", ""m.z_value"": 9.0}, {""m.refcode"": ""RAVXAP"", ""m.name"": ""IRMOF-74-VII"", ""m.z_value"": 9.0}, {""m.refcode"": ""RAVXET"", ""m.name"": ""IRMOF-74-VI-oeg"", ""m.z_value"": 9.0}, {""m.refcode"": ""RAVXIX"", ""m.name"": ""IRMOF-74-IX"", ""m.z_value"": 9.0}, {""m.refcode"": ""RAVXOD"", ""m.name"": ""IRMOF-74-XI"", ""m.z_value"": 9.0}, {""m.refcode"": ""RUTPAY01"", ""m.name"": ""IRMOF-77"", ""m.z_value"": 12.0}, {""m.refcode"": ""WORKUL"", ""m.name"": ""INT-IRMOF-8-C"", ""m.z_value"": 2.0}, {""m.refcode"": ""WORLAS"", ""m.name"": ""INT-IRMOF-8-B"", ""m.z_value"": 2.0}]"
What is the name of the author with the most publications about MOFs that have a similar framework to MOF-5?,"MATCH (:MOF {name: 'MOF-5'})-[:has_topology]-(t:Topology) MATCH (m:MOF)-[:has_topology]-(t) MATCH (m)-[:has_publication]-(p:Publication) MATCH (p)-[:has_author]-(a:Author) RETURN COUNT(DISTINCT p), a.name ORDER BY COUNT(DISTINCT p) DESC LIMIT 1",139,3,"[{""COUNT(DISTINCT p)"": 11, ""a.name"": ""S.Kitagawa""}]"
"Among the synthesis procedures of MOF 'MOF-3', which solvent precursor has the lowest MOratio, and what is it called?",MATCH (m:MOF)-[:has_publication]->(:Publication)<-[:has_publication]-(s:Synthesis_Procedure)-[:has_solvent_precursor]->(sp:Synthesis_Solvent_Precursor) WHERE m.name CONTAINS 'MOF-3' RETURN sp.name ORDER BY s.MOratio ASC LIMIT 1,121,3,"[{""sp.name"": ""DMF""}]"
What is the name of the organic precursor used in the synthesis of HKUST-1?,MATCH (s:Synthesis_Procedure)-[:has_publication]->(:Publication)<-[:has_publication]-(m:MOF) MATCH (s)-[:has_organic_precursor]->(mp:Synthesis_Organic_Precursor) WHERE m.name CONTAINS 'HKUST-1' RETURN mp.name,102,0,"[{""mp.name"": ""H3BTC""}, {""mp.name"": ""H3BTC""}]"
Could you provide information on the disorder detail for the MOFs named 'HKUST-1'?,"MATCH (m:MOF) WHERE m.name CONTAINS 'HKUST-1' RETURN m.refcode, m.name, m.disorder_details",38,1,"[{""m.refcode"": ""DOTSOV42"", ""m.name"": ""HKUST-1"", ""m.disorder_details"": """"}, {""m.refcode"": ""FIQCEN"", ""m.name"": ""HKUST-1|Teaching Subset: MOFs"", ""m.disorder_details"": """"}, {""m.refcode"": ""FUNGAZ"", ""m.name"": ""HKUST-1 (as synthesised)"", ""m.disorder_details"": ""The MASK/OLEX2 program was used to model some disordered solvent.""}, {""m.refcode"": ""LUDLED"", ""m.name"": ""HKUST-1"", ""m.disorder_details"": ""Disordered solvent molecules were not modelled and the disordered density was taken into account using the SQUEEZE/PLATON procedure.""}, {""m.refcode"": ""WULJUJ"", ""m.name"": ""HKUST-1 0.56(dideuteroacetylene)"", ""m.disorder_details"": ""The dideuteroacetylene molecule is disordered by symmetry.""}]"
What is the highest temperature of the synthesis procedures for MOFs 'MOF-3'?,MATCH (m:MOF)-[:has_publication]->(:Publication)<-[:has_publication]-(s:Synthesis_Procedure)-[:has_temperature]->(t:Synthesis_Temperature) WHERE m.name CONTAINS 'MOF-3' RETURN max(t.Value),124,0,"[{""max(t.Value)"": 453.15}]"
What is the most commonly occurring crystal system?,"MATCH (m:MOF)-[r:has_crystalSystem]->(c:Crystal_System) RETURN c.name, count(c) as freq ORDER BY freq DESC LIMIT 1",64,1,"[{""c.name"": ""monoclinic"", ""freq"": 3911}]"
What is the specific name of the solvent used in the synthesis of HKUST-1?,MATCH (s:Synthesis_Procedure)-[:has_publication]->(:Publication)<-[:has_publication]-(m:MOF) MATCH (s)-[:has_solvent_precursor]->(mp:Synthesis_Solvent_Precursor) WHERE m.name CONTAINS 'HKUST-1' RETURN mp.name,104,2,"[{""mp.name"": ""N,N-dimethylformamide""}, {""mp.name"": ""/ethanol""}, {""mp.name"": ""DMF""}, {""mp.name"": ""/H2O""}, {""mp.name"": ""N,N-dimethylformamide""}, {""mp.name"": ""/ethanol""}, {""mp.name"": ""DMF""}, {""mp.name"": ""/H2O""}]"
Give me the value of the property employed during MOF-3's synthesis.,"MATCH (m:MOF)-[:has_publication]->(:Publication)<-[:has_publication]-(s:Synthesis_Procedure)-[:has_property]->(sp:Synthesis_Property) WHERE m.name CONTAINS 'MOF-3' RETURN sp.value, sp.unit",91,1,"[{""sp.value"": ""25"", ""sp.unit"": ""%1.0""}, {""sp.value"": ""4.99"", ""sp.unit"": ""%1.0""}, {""sp.value"": ""53"", ""sp.unit"": ""%1.0""}, {""sp.value"": ""57"", ""sp.unit"": ""%1.0""}, {""sp.value"": ""46"", ""sp.unit"": ""%1.0""}]"
When was MOF 'HKUST-1' added to the database?,"MATCH (m:MOF) WHERE m.name CONTAINS 'HKUST-1' RETURN m.refcode, m.name, m.deposition_date",24,3,"[{""m.refcode"": ""DOTSOV42"", ""m.name"": ""HKUST-1"", ""m.deposition_date"": ""06/17/2010""}, {""m.refcode"": ""FIQCEN"", ""m.name"": ""HKUST-1|Teaching Subset: MOFs"", ""m.deposition_date"": ""08/13/1999""}, {""m.refcode"": ""FUNGAZ"", ""m.name"": ""HKUST-1 (as synthesised)"", ""m.deposition_date"": ""01/29/2020""}, {""m.refcode"": ""LUDLED"", ""m.name"": ""HKUST-1"", ""m.deposition_date"": ""05/14/2015""}, {""m.refcode"": ""WULJUJ"", ""m.name"": ""HKUST-1 0.56(dideuteroacetylene)"", ""m.deposition_date"": ""06/17/2010""}]"
"Among all MOFs 'MOF-3', what is the average value of synthesis properties of the synthesis procedures that have a synthesis operation with a name that contains the word 'heat'?",MATCH (m:MOF)-[:has_publication]->(:Publication)<-[:has_publication]-(s:Synthesis_Procedure)-[:has_operation]->(o:Synthesis_Operation) WHERE toLower(o.name) CONTAINS 'heat' MATCH (s)-[:has_property]->(p:Synthesis_Property) WHERE m.name CONTAINS 'MOF-3' RETURN avg(toFloat(p.value)),126,0,"[{""avg(toFloat(p.value))"": 14.995000000000001}]"
When was the latest study on the MOF 'MOF-3' published?,MATCH (m:MOF)-[:has_publication]->(p:Publication) WHERE m.name CONTAINS 'MOF-3' RETURN max(p.year),109,3,"[{""max(p.year)"": 2018}]"
What is the name of the metal precursor used in the synthesis of HKUST-1?,MATCH (s:Synthesis_Procedure)-[:has_publication]->(:Publication)<-[:has_publication]-(m:MOF) MATCH (s)-[:has_metal_precursor]->(mp:Synthesis_Metal_Precursor) WHERE m.name CONTAINS 'HKUST-1' RETURN mp.name,100,0,"[{""mp.name"": ""Cu(NO3)2\u22c5(H2O)2.5""}, {""mp.name"": ""Cu(NO3)2\u22c5(H2O)2.5""}]"
From which source was the data for MOF 'MOF-5' obtained?,"MATCH (m:MOF) WHERE m.name CONTAINS 'MOF-5' RETURN m.refcode, m.name, m.datasource",28,1,"[{""m.refcode"": ""FAYPUS"", ""m.name"": ""DMOF-5"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""LASYOU"", ""m.name"": ""MOF-505"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""MIBQAR"", ""m.name"": ""MOF-5"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""MIBQAR01"", ""m.name"": ""MOF-5"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""MIBQAR02"", ""m.name"": ""MOF-5"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""MIBQAR03"", ""m.name"": ""MOF-5"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""MIBQAR04"", ""m.name"": ""MOF-5"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""MIBQAR05"", ""m.name"": ""MOF-5"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""MIBQAR06"", ""m.name"": ""MOF-5"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""MIBQAR07"", ""m.name"": ""MOF-5"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""MIBQAR08"", ""m.name"": ""MOF-5"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""MIBQAR09"", ""m.name"": ""MOF-5"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""MIBQAR10"", ""m.name"": ""MOF-5"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""MIBQAR11"", ""m.name"": ""MOF-5"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""MIBQAR12"", ""m.name"": ""MOF-5"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""MIBQAR13"", ""m.name"": ""MOF-5"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""MIBQAR14"", ""m.name"": ""MOF-5"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""MIBQAR15"", ""m.name"": ""MOF-5"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""MIBQAR16"", ""m.name"": ""MOF-5"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""MIBQAR17"", ""m.name"": ""MOF-5"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""MIBQAR18"", ""m.name"": ""MOF-5"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""MIBQAR19"", ""m.name"": ""MOF-5"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""MIBQAR20"", ""m.name"": ""MOF-5"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""OFEDAH"", ""m.name"": ""GR-MOF-5"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""OMUKUE"", ""m.name"": ""TPMOF-5"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""OTECEX"", ""m.name"": ""\u0394-MOF-520 unknown solvate"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""OTECUN"", ""m.name"": ""\u039b-MOF-520 trimesate unknown solvate"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""OTEDEY"", ""m.name"": ""\u039b-MOF-520 3-(t-butoxycarbonylamino)propan-1,2-diolato unknown solvate"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""OTEDOI"", ""m.name"": ""\u039b-MOF-520 unknown solvate"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""OTEDUO"", ""m.name"": ""\u039b-MOF-520 methanolate unknown solvate"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""QEFWUV"", ""m.name"": ""MOF-545"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""QOXQEC"", ""m.name"": ""-MOF-520-24"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""QOXQIG"", ""m.name"": ""-MOF-520-25"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""QOXQUS"", ""m.name"": ""-MOF-520-27"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""QOXRAZ"", ""m.name"": ""-MOF-520-28"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""QOXRIH"", ""m.name"": ""-MOF-520-31-activated"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""QOXRON"", ""m.name"": ""-MOF-520-S-32"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""QOXSAA"", ""m.name"": ""-MOF-520-22"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""QOXSOO"", ""m.name"": ""-MOF-520-R-32"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""QOXSUU"", ""m.name"": ""\u0394-MOF-520-17"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""QOXTOP"", ""m.name"": ""\u0394-MOF-520-21"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""QOXVEH"", ""m.name"": ""-MOF-520 N,N-dimethylformamide solvate"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""RIXPOF"", ""m.name"": ""MOF-519"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""RUVKAV"", ""m.name"": ""catena-[(\u03bc8-5,5'-Buta-1,3-diyne-1,4-diyldibenzene-1,3-dicarboxylato)-diaqua-di-copper(ii) dimethylformamide solvate trihydrate]|MOF-505"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""SAHYIK"", ""m.name"": ""MOF-5|Teaching Subset: MOFs"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""SUFJEK"", ""m.name"": ""PMOF-55"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""TIHROU"", ""m.name"": ""MOF-591"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""TIHRUA"", ""m.name"": ""MOF-592"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""TIHTUC"", ""m.name"": ""MOF-590"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""VUSKEA01"", ""m.name"": ""MOF-5"", ""m.datasource"": ""CSD""}]"
Can you tell me the title of the publication describing MOF-5?,MATCH (m:MOF {name:'MOF-5'})-[r:has_publication]->(c:Publication)-[:has_title]-(t:Title) RETURN DISTINCT t.title,75,1,"[{""t.title"": ""Elucidating Negative Thermal Expansion in MOF-5 Elucidating NTE in MOF-5""}]"
What is the time frame for the creation of HKUST-1?,"MATCH (s:Synthesis_Procedure)-[:has_publication]->(:Publication)<-[:has_publication]-(m:MOF) MATCH (s)-[:has_time]->(t:Synthesis_Time) WHERE s.name CONTAINS 'HKUST-1' RETURN t.Value, t. Unit",107,3,"[{""t.Value"": ""24"", ""t. Unit"": ""h1.0""}, {""t.Value"": ""24"", ""t. Unit"": ""h1.0""}, {""t.Value"": ""20"", ""t. Unit"": ""h1.0""}]"
What is the greatest value attained by any property in synthesis procedures linked to MOFs named 'MOF-3'?,MATCH (m:MOF)-[:has_publication]->(:Publication)<-[:has_publication]-(s:Synthesis_Procedure)-[:has_property]->(p:Synthesis_Property) WHERE m.name CONTAINS 'MOF-3' RETURN max(p.value),114,3,"[{""max(p.value)"": ""57""}]"
Can you tell me the date on which the MOFs 'HKUST-1' was deposited in the database?,"MATCH (m:MOF) WHERE m.name CONTAINS 'HKUST-1' RETURN m.refcode, m.name, m.deposition_date",48,2,"[{""m.refcode"": ""DOTSOV42"", ""m.name"": ""HKUST-1"", ""m.deposition_date"": ""06/17/2010""}, {""m.refcode"": ""FIQCEN"", ""m.name"": ""HKUST-1|Teaching Subset: MOFs"", ""m.deposition_date"": ""08/13/1999""}, {""m.refcode"": ""FUNGAZ"", ""m.name"": ""HKUST-1 (as synthesised)"", ""m.deposition_date"": ""01/29/2020""}, {""m.refcode"": ""LUDLED"", ""m.name"": ""HKUST-1"", ""m.deposition_date"": ""05/14/2015""}, {""m.refcode"": ""WULJUJ"", ""m.name"": ""HKUST-1 0.56(dideuteroacetylene)"", ""m.deposition_date"": ""06/17/2010""}]"
What is the name of the oldest publication associated with MOFs 'MOF-3'?,MATCH (m:MOF)-[:has_publication]->(p:Publication)-[:has_title]-(t:Title) WHERE m.name CONTAINS 'MOF-3' RETURN t.title ORDER BY p.year ASC LIMIT 1,123,2,"[{""t.title"": ""Toward Templated Metal\u2212Organic Frameworks:\u2009 Synthesis, Structures, Thermal Properties, and Luminescence of Three Novel Lanthanide\u2212Adipate Frameworks""}]"
Which metals are typically utilized in MOF synthesis?,"MATCH (m:MOF)-[r:has_metal]->(c:Metal) RETURN c.name, count(c) as freq ORDER BY freq DESC LIMIT 5",68,2,"[{""c.name"": ""[Zn]"", ""freq"": 1179}, {""c.name"": ""[Cu]"", ""freq"": 1068}, {""c.name"": ""[Cd]"", ""freq"": 812}, {""c.name"": ""[Co]"", ""freq"": 807}, {""c.name"": ""*"", ""freq"": 424}]"
What is the name of the metal used in the synthesis of MOF-5?,"MATCH (m:MOF {name: ""MOF-5""})-[:has_metal]->(metal:Metal) RETURN DISTINCT metal.name;",146,0,"[{""metal.name"": ""[Zn][O]([Zn])([Zn])[Zn]""}]"
Do you know the deposition number assigned to the MOFs 'HKUST-1' in the database?,"MATCH (m:MOF) WHERE m.name CONTAINS 'HKUST-1' RETURN m.refcode, m.name, m.deposition_number",52,3,"[{""m.refcode"": ""DOTSOV42"", ""m.name"": ""HKUST-1"", ""m.deposition_number"": 755080.0}, {""m.refcode"": ""FIQCEN"", ""m.name"": ""HKUST-1|Teaching Subset: MOFs"", ""m.deposition_number"": 112954.0}, {""m.refcode"": ""FUNGAZ"", ""m.name"": ""HKUST-1 (as synthesised)"", ""m.deposition_number"": 1950115.0}, {""m.refcode"": ""LUDLED"", ""m.name"": ""HKUST-1"", ""m.deposition_number"": 943962.0}, {""m.refcode"": ""WULJUJ"", ""m.name"": ""HKUST-1 0.56(dideuteroacetylene)"", ""m.deposition_number"": 755081.0}]"
List the name of the organic precursor used in the synthesis of MOF-3.,MATCH (m:MOF)-[:has_publication]->(:Publication)<-[:has_publication]-(s:Synthesis_Procedure)-[:has_organic_precursor]->(op:Synthesis_Organic_Precursor) WHERE m.name CONTAINS 'MOF-3' RETURN DISTINCT op.name,83,3,"[{""op.name"": ""adipic acid""}, {""op.name"": ""H4tcbpe""}]"
Can you provide the specific name of the data file for MOFs 'HKUST-1'?,"MATCH (m:MOF) WHERE m.name CONTAINS 'HKUST-1' RETURN m.refcode, m.name, m.filename",53,3,"[{""m.refcode"": ""DOTSOV42"", ""m.name"": ""HKUST-1"", ""m.filename"": ""dotsov42_P1""}, {""m.refcode"": ""FIQCEN"", ""m.name"": ""HKUST-1|Teaching Subset: MOFs"", ""m.filename"": ""fiqcen_P1_H""}, {""m.refcode"": ""FUNGAZ"", ""m.name"": ""HKUST-1 (as synthesised)"", ""m.filename"": ""fungaz_P1""}, {""m.refcode"": ""LUDLED"", ""m.name"": ""HKUST-1"", ""m.filename"": ""ludled_P1""}, {""m.refcode"": ""WULJUJ"", ""m.name"": ""HKUST-1 0.56(dideuteroacetylene)"", ""m.filename"": ""wuljuj_P1""}]"
Name the top 5 organic linkers that are used in the synthesis of MOFs.,"MATCH (m:MOF)-[r:has_organicLinker]->(c:Organic_Linker) RETURN c.name, count(c) as freq ORDER BY freq DESC LIMIT 5",70,3,"[{""c.name"": ""[O-]C(=O)c1cc([O])c(cc1[O])C(=O)[O-]"", ""freq"": 510}, {""c.name"": ""[O-]C(=O)c1ccc(cc1)C(=O)[O-]"", ""freq"": 383}, {""c.name"": ""[O-]C(=O)c1cc(cc(c1)C(=O)[O-])C(=O)[O-]"", ""freq"": 272}, {""c.name"": ""[O-]C=O"", ""freq"": 259}, {""c.name"": ""[O-]C(=O)C(=O)[O-]"", ""freq"": 245}]"
What is the SMILES code for the organic ligand utilized in the synthesis of HKUST-1?,MATCH (s:Synthesis_Procedure)-[:has_publication]->(:Publication)<-[:has_publication]-(m:MOF) MATCH (s)-[:has_organic_precursor]->(mp:Synthesis_Organic_Precursor) WHERE m.name CONTAINS 'HKUST-1' RETURN mp.smiles,103,2,"[{""mp.smiles"": ""O=C(O)c1cc(C(=O)O)cc(C(=O)O)c1""}, {""mp.smiles"": ""O=C(O)c1cc(C(=O)O)cc(C(=O)O)c1""}]"
What is the publication title of the MOF-5?,MATCH (m:MOF {name:'MOF-5'})-[r:has_publication]->(c:Publication)-[:has_title]-(t:Title) RETURN DISTINCT t.title,75,0,"[{""t.title"": ""Elucidating Negative Thermal Expansion in MOF-5 Elucidating NTE in MOF-5""}]"
List the length of the c-axis for the unit cell of MOFs 'HKUST-1'.,"MATCH (m:MOF) WHERE m.name CONTAINS 'HKUST-1' RETURN m.refcode, m.name, m.cell_lengths",44,3,"[{""m.refcode"": ""DOTSOV42"", ""m.name"": ""HKUST-1"", ""m.cell_lengths"": ""CellLengths(a=26.287910000000004, b=26.287910000000004, c=26.287910000000004)""}, {""m.refcode"": ""FIQCEN"", ""m.name"": ""HKUST-1|Teaching Subset: MOFs"", ""m.cell_lengths"": ""CellLengths(a=26.343, b=26.343, c=26.343)""}, {""m.refcode"": ""FUNGAZ"", ""m.name"": ""HKUST-1 (as synthesised)"", ""m.cell_lengths"": ""CellLengths(a=26.3518, b=26.3518, c=26.3518)""}, {""m.refcode"": ""LUDLED"", ""m.name"": ""HKUST-1"", ""m.cell_lengths"": ""CellLengths(a=26.315, b=26.315, c=26.315)""}, {""m.refcode"": ""WULJUJ"", ""m.name"": ""HKUST-1 0.56(dideuteroacetylene)"", ""m.cell_lengths"": ""CellLengths(a=26.3256, b=26.3256, c=26.3256)""}]"
Name the 5 space groups that are commonly observed in MOFs.,"MATCH (m:MOF)-[r:has_spaceGroup]->(c:Space_Group) RETURN c.name, count(c) as freq ORDER BY freq DESC LIMIT 5",74,3,"[{""c.name"": ""C2/c"", ""freq"": 1430}, {""c.name"": ""P-1"", ""freq"": 1280}, {""c.name"": ""P21/c"", ""freq"": 1045}, {""c.name"": ""R-3"", ""freq"": 830}, {""c.name"": ""P21/n"", ""freq"": 665}]"
Which metal precursor is utilized for the synthesis of MOF-3?,MATCH (m:MOF)-[:has_publication]->(:Publication)<-[:has_publication]-(s:Synthesis_Procedure)-[:has_metal_precursor]->(mp:Synthesis_Metal_Precursor) WHERE m.name CONTAINS 'MOF-3' RETURN mp.name,81,2,"[{""mp.name"": ""GWMOF-3""}, {""mp.name"": ""praseodymium chloride heptahydrate""}, {""mp.name"": ""PrCl3\u22c57H2O""}, {""mp.name"": ""GWMOF-3""}, {""mp.name"": ""praseodymium chloride heptahydrate""}, {""mp.name"": ""PrCl3\u22c57H2O""}, {""mp.name"": ""Zn(NO3)2\u22c56H2O""}, {""mp.name"": ""Cd(NO3)2\u22c54H2O""}, {""mp.name"": ""Cd(NO3)2\u22c54H2O""}]"
In how many journals are there published works on MOFs with a similar family to MOF-5?,MATCH (:MOF {name: 'MOF-5'})-[:has_family]-(f:Family)-[:has_family]-(m:MOF)-[:has_publication]-(p:Publication)-[:in_journal]-(j:Journal) RETURN COUNT(DISTINCT j);,141,3,"[{""COUNT(DISTINCT j)"": 31}]"
What is the number of publications that were released each year?,"MATCH (p:Publication) RETURN p.year, COUNT(p) AS num_publications ORDER BY p.year",58,2,"[{""p.year"": 1959, ""num_publications"": 1}, {""p.year"": 1968, ""num_publications"": 1}, {""p.year"": 1974, ""num_publications"": 1}, {""p.year"": 1978, ""num_publications"": 1}, {""p.year"": 1980, ""num_publications"": 1}, {""p.year"": 1981, ""num_publications"": 1}, {""p.year"": 1982, ""num_publications"": 2}, {""p.year"": 1983, ""num_publications"": 1}, {""p.year"": 1984, ""num_publications"": 3}, {""p.year"": 1985, ""num_publications"": 2}, {""p.year"": 1986, ""num_publications"": 2}, {""p.year"": 1988, ""num_publications"": 3}, {""p.year"": 1989, ""num_publications"": 2}, {""p.year"": 1990, ""num_publications"": 2}, {""p.year"": 1991, ""num_publications"": 3}, {""p.year"": 1992, ""num_publications"": 3}, {""p.year"": 1994, ""num_publications"": 4}, {""p.year"": 1995, ""num_publications"": 1}, {""p.year"": 1996, ""num_publications"": 9}, {""p.year"": 1997, ""num_publications"": 11}, {""p.year"": 1998, ""num_publications"": 14}, {""p.year"": 1999, ""num_publications"": 20}, {""p.year"": 2000, ""num_publications"": 24}, {""p.year"": 2001, ""num_publications"": 40}, {""p.year"": 2002, ""num_publications"": 48}, {""p.year"": 2003, ""num_publications"": 49}, {""p.year"": 2004, ""num_publications"": 68}, {""p.year"": 2005, ""num_publications"": 99}, {""p.year"": 2006, ""num_publications"": 119}, {""p.year"": 2007, ""num_publications"": 138}, {""p.year"": 2008, ""num_publications"": 182}, {""p.year"": 2009, ""num_publications"": 205}, {""p.year"": 2010, ""num_publications"": 272}, {""p.year"": 2011, ""num_publications"": 316}, {""p.year"": 2012, ""num_publications"": 412}, {""p.year"": 2013, ""num_publications"": 411}, {""p.year"": 2014, ""num_publications"": 460}, {""p.year"": 2015, ""num_publications"": 514}, {""p.year"": 2016, ""num_publications"": 484}, {""p.year"": 2017, ""num_publications"": 458}, {""p.year"": 2018, ""num_publications"": 481}, {""p.year"": 2019, ""num_publications"": 491}, {""p.year"": 2020, ""num_publications"": 318}, {""p.year"": 2021, ""num_publications"": 6}]"
What is the cumulative number of operation conditions involved in the synthesis of any MOFs 'MOF-3'?,MATCH (m:MOF)-[:has_publication]->(:Publication)<-[:has_publication]-(s:Synthesis_Procedure)-[:has_operation]->(o:Synthesis_Operation)-[:has_condition]->(c:Synthesis_Operation_Condition) WHERE m.name CONTAINS 'MOF-3' RETURN count(c),129,3,"[{""count(c)"": 14}]"
What is the formula of the metal precursor used in the synthesis of HKUST-1?,MATCH (s:Synthesis_Procedure)-[:has_publication]->(:Publication)<-[:has_publication]-(m:MOF) MATCH (s)-[:has_metal_precursor]->(mp:Synthesis_Metal_Precursor) WHERE m.name CONTAINS 'HKUST-1' RETURN mp.formul,101,0,"[{""mp.formul"": null}, {""mp.formul"": null}]"
How many different organic linkers have been used in the synthesis of MOF-5?,MATCH (:MOF {name: 'MOF-5'})-[:has_organicLinker]->(ol:Organic_Linker) RETURN count(DISTINCT ol.name),138,0,"[{""count(DISTINCT ol.name)"": 1}]"
What is the name of the database that contains information about MOFs named 'HKUST-1'?,"MATCH (m:MOF) WHERE m.name CONTAINS 'HKUST-1' RETURN m.refcode, m.name, m.database_name",37,1,"[{""m.refcode"": ""DOTSOV42"", ""m.name"": ""HKUST-1"", ""m.database_name"": ""as543be_ASER""}, {""m.refcode"": ""FIQCEN"", ""m.name"": ""HKUST-1|Teaching Subset: MOFs"", ""m.database_name"": ""as543be_ASER""}, {""m.refcode"": ""FUNGAZ"", ""m.name"": ""HKUST-1 (as synthesised)"", ""m.database_name"": ""as543be_ASER""}, {""m.refcode"": ""LUDLED"", ""m.name"": ""HKUST-1"", ""m.database_name"": ""as543be_ASER""}, {""m.refcode"": ""WULJUJ"", ""m.name"": ""HKUST-1 0.56(dideuteroacetylene)"", ""m.database_name"": ""as543be_ASER""}]"
What is the chemical composition of the metal precursor used in the synthesis of HKUST-1?,MATCH (s:Synthesis_Procedure)-[:has_publication]->(:Publication)<-[:has_publication]-(m:MOF) MATCH (s)-[:has_metal_precursor]->(mp:Synthesis_Metal_Precursor) WHERE m.name CONTAINS 'HKUST-1' RETURN mp.formul,101,1,"[{""mp.formul"": null}, {""mp.formul"": null}]"
What are the databases that contributed MOFs 'IRMOF'?,"MATCH (m:MOF) WHERE m.name CONTAINS 'IRMOF' RETURN m.refcode, m.name, m.database_name",21,3,"[{""m.refcode"": ""GINYAG"", ""m.name"": ""Ni-IRMOF-74-II"", ""m.database_name"": ""as543be_ASER""}, {""m.refcode"": ""GINYIO"", ""m.name"": ""Ni-IRMOF-74-III"", ""m.database_name"": ""as543be_ASER""}, {""m.refcode"": ""GINYOU"", ""m.name"": ""Ni-IRMOF-74-IV"", ""m.database_name"": ""as543be_ASER""}, {""m.refcode"": ""GINYUA"", ""m.name"": ""Ni-IRMOF-74-V"", ""m.database_name"": ""as543be_ASER""}, {""m.refcode"": ""HOLQAC"", ""m.name"": ""\u03b1-IRMOF-3-AMPh"", ""m.database_name"": ""as543be_ASER""}, {""m.refcode"": ""NODTEH"", ""m.name"": ""IRMOF-23terp"", ""m.database_name"": ""as543be_ASER""}, {""m.refcode"": ""NODTIL"", ""m.name"": ""IRMOF-25terPh"", ""m.database_name"": ""as543be_ASER""}, {""m.refcode"": ""NODTOR"", ""m.name"": ""IRMOF-pentane"", ""m.database_name"": ""as543be_ASER""}, {""m.refcode"": ""NUVYEK"", ""m.name"": ""IRMOF-61"", ""m.database_name"": ""as543be_ASER""}, {""m.refcode"": ""NUVYIO"", ""m.name"": ""IRMOF-62"", ""m.database_name"": ""as543be_ASER""}, {""m.refcode"": ""PIWLIT"", ""m.name"": ""IRMOF-9"", ""m.database_name"": ""as543be_ASER""}, {""m.refcode"": ""RAVVUH"", ""m.name"": ""IRMOF-74-II"", ""m.database_name"": ""as543be_ASER""}, {""m.refcode"": ""RAVWAO"", ""m.name"": ""IRMOF-74-III"", ""m.database_name"": ""as543be_ASER""}, {""m.refcode"": ""RAVWES"", ""m.name"": ""IRMOF-74-IV"", ""m.database_name"": ""as543be_ASER""}, {""m.refcode"": ""RAVWOC"", ""m.name"": ""IRMOF-74-V-hex"", ""m.database_name"": ""as543be_ASER""}, {""m.refcode"": ""RAVWUI"", ""m.name"": ""IRMOF-74-VI"", ""m.database_name"": ""as543be_ASER""}, {""m.refcode"": ""RAVXAP"", ""m.name"": ""IRMOF-74-VII"", ""m.database_name"": ""as543be_ASER""}, {""m.refcode"": ""RAVXET"", ""m.name"": ""IRMOF-74-VI-oeg"", ""m.database_name"": ""as543be_ASER""}, {""m.refcode"": ""RAVXIX"", ""m.name"": ""IRMOF-74-IX"", ""m.database_name"": ""as543be_ASER""}, {""m.refcode"": ""RAVXOD"", ""m.name"": ""IRMOF-74-XI"", ""m.database_name"": ""as543be_ASER""}, {""m.refcode"": ""RUTPAY01"", ""m.name"": ""IRMOF-77"", ""m.database_name"": ""as543be_ASER""}, {""m.refcode"": ""WORKUL"", ""m.name"": ""INT-IRMOF-8-C"", ""m.database_name"": ""as543be_ASER""}, {""m.refcode"": ""WORLAS"", ""m.name"": ""INT-IRMOF-8-B"", ""m.database_name"": ""as543be_ASER""}]"
Which bond is the most common in all MOFs?,"MATCH (n:Bond) WITH n.name AS name, count(*) as freq ORDER BY freq LIMIT 1 RETURN name",57,2,"[{""name"": ""Bond(Single Atom(Co1) Atom(N1))""}]"
Who is the author with the highest number of publications on MOF-5?,"MATCH (m:MOF {name: ""MOF-5""})-[:has_publication]->(p:Publication)-[:has_author]->(a:Author) RETURN a.name, count(*) as numArticles ORDER BY numArticles DESC LIMIT 1;",147,1,"[{""a.name"": ""A.J.Bridgeman"", ""numArticles"": 21}]"
What is the chemical makeup of the solvent used in the production of HKUST-1?,"MATCH (s:Synthesis_Procedure)-[:has_publication]->(:Publication)<-[:has_publication]-(m:MOF) MATCH (s)-[:has_solvent_precursor]->(sp:Synthesis_Solvent_Precursor)-[:has_composition]->(sc:Solvent_Composition) WHERE m.name CONTAINS 'HKUST-1' RETURN sc.comp_id, sc.unit, sc.order, sc.value",105,1,"[{""sc.comp_id"": ""MIsyn3526_sprec2_comp0"", ""sc.unit"": ""mL1.0"", ""sc.order"": 0, ""sc.value"": 6.0}, {""sc.comp_id"": ""MIsyn3526_sprec1_comp0"", ""sc.unit"": ""mL1.0"", ""sc.order"": 0, ""sc.value"": 6.0}, {""sc.comp_id"": ""MIsyn3526_sprec3_comp0"", ""sc.unit"": ""mL1.0"", ""sc.order"": 0, ""sc.value"": 6.0}, {""sc.comp_id"": ""MIsyn3526_sprec2_comp0"", ""sc.unit"": ""mL1.0"", ""sc.order"": 0, ""sc.value"": 6.0}, {""sc.comp_id"": ""MIsyn3526_sprec1_comp0"", ""sc.unit"": ""mL1.0"", ""sc.order"": 0, ""sc.value"": 6.0}, {""sc.comp_id"": ""MIsyn3526_sprec3_comp0"", ""sc.unit"": ""mL1.0"", ""sc.order"": 0, ""sc.value"": 6.0}]"
Can you provide the publication information for the paper detailing the synthesis of MOF-3?,"MATCH (m:MOF)-[:has_publication]->(p:Publication) WHERE m.name CONTAINS 'MOF-3' RETURN p.doi, p.year, p.first_page, p.volume",78,1,"[{""p.doi"": ""10.1039/c6ee02104b"", ""p.year"": 2016, ""p.first_page"": ""3279"", ""p.volume"": 9}, {""p.doi"": ""10.1002/chem.201200696"", ""p.year"": 2012, ""p.first_page"": ""8076"", ""p.volume"": 18}, {""p.doi"": ""10.1021/ic048755k"", ""p.year"": 2005, ""p.first_page"": ""258"", ""p.volume"": 44}, {""p.doi"": ""10.1039/C4CC05265J"", ""p.year"": 2014, ""p.first_page"": ""12154"", ""p.volume"": 50}, {""p.doi"": ""10.1002/chem.201302455"", ""p.year"": 2014, ""p.first_page"": ""2276"", ""p.volume"": 20}, {""p.doi"": ""10.1002/anie.201002343"", ""p.year"": 2010, ""p.first_page"": ""8630"", ""p.volume"": 49}, {""p.doi"": ""10.1021/acscatal.7b04189"", ""p.year"": 2018, ""p.first_page"": ""2519"", ""p.volume"": 8}, {""p.doi"": ""10.1021/acs.cgd.8b00604"", ""p.year"": 2018, ""p.first_page"": ""5166"", ""p.volume"": 18}]"
Which MOFs share the same metal composition with MOF-5?,"MATCH (m1:MOF {name:'MOF-5'})-[p1:has_metal]-(t1:Metal)-[p2:has_metal]-(m2:MOF) RETURN m2.refcode, m2.name LIMIT 25",1,2,"[{""m2.refcode"": ""UWAFUU"", ""m2.name"": """"}, {""m2.refcode"": ""BUKTAE"", ""m2.name"": """"}, {""m2.refcode"": ""UWAGAB04"", ""m2.name"": """"}, {""m2.refcode"": ""OLOGEC"", ""m2.name"": ""NJU-Bai2""}, {""m2.refcode"": ""SAHYIK"", ""m2.name"": ""MOF-5|Teaching Subset: MOFs""}, {""m2.refcode"": ""MIBQAR18"", ""m2.name"": ""MOF-5""}, {""m2.refcode"": ""DARQOF"", ""m2.name"": """"}, {""m2.refcode"": ""FANWOI"", ""m2.name"": """"}, {""m2.refcode"": ""YENTUJ"", ""m2.name"": """"}, {""m2.refcode"": ""ETAXUT"", ""m2.name"": """"}, {""m2.refcode"": ""MIBQAR20"", ""m2.name"": ""MOF-5""}, {""m2.refcode"": ""BUKRUW02"", ""m2.name"": """"}, {""m2.refcode"": ""ROLZAV"", ""m2.name"": """"}, {""m2.refcode"": ""HUDMOK"", ""m2.name"": """"}, {""m2.refcode"": ""SAHYOQ03"", ""m2.name"": """"}, {""m2.refcode"": ""PUGSIV"", ""m2.name"": """"}, {""m2.refcode"": ""LEJCIO"", ""m2.name"": """"}, {""m2.refcode"": ""LEJCAG"", ""m2.name"": """"}, {""m2.refcode"": ""MIBQAR14"", ""m2.name"": ""MOF-5""}, {""m2.refcode"": ""MIBQAR06"", ""m2.name"": ""MOF-5""}, {""m2.refcode"": ""HOLQAC"", ""m2.name"": ""\u03b1-IRMOF-3-AMPh""}, {""m2.refcode"": ""MIBQAR07"", ""m2.name"": ""MOF-5""}, {""m2.refcode"": ""MIBQAR16"", ""m2.name"": ""MOF-5""}, {""m2.refcode"": ""LATFOC"", ""m2.name"": """"}, {""m2.refcode"": ""PIWLIT"", ""m2.name"": ""IRMOF-9""}]"
What year was the publication that described the synthetic procedure and characteristics of HKUST-1 released?,MATCH (m:MOF)-[:has_publication]-(p:Publication)-[:has_publication]-(s:Synthesis_Procedure) WHERE m.name CONTAINS 'HKUST-1' RETURN p.year,98,1,"[{""p.year"": 2009}, {""p.year"": 2009}]"
What is the length of the b-axis of the unit cell of the MOFs 'HKUST-1'?,"MATCH (m:MOF) WHERE m.name CONTAINS 'HKUST-1' RETURN m.refcode, m.name, m.cell_lengths",43,0,"[{""m.refcode"": ""DOTSOV42"", ""m.name"": ""HKUST-1"", ""m.cell_lengths"": ""CellLengths(a=26.287910000000004, b=26.287910000000004, c=26.287910000000004)""}, {""m.refcode"": ""FIQCEN"", ""m.name"": ""HKUST-1|Teaching Subset: MOFs"", ""m.cell_lengths"": ""CellLengths(a=26.343, b=26.343, c=26.343)""}, {""m.refcode"": ""FUNGAZ"", ""m.name"": ""HKUST-1 (as synthesised)"", ""m.cell_lengths"": ""CellLengths(a=26.3518, b=26.3518, c=26.3518)""}, {""m.refcode"": ""LUDLED"", ""m.name"": ""HKUST-1"", ""m.cell_lengths"": ""CellLengths(a=26.315, b=26.315, c=26.315)""}, {""m.refcode"": ""WULJUJ"", ""m.name"": ""HKUST-1 0.56(dideuteroacetylene)"", ""m.cell_lengths"": ""CellLengths(a=26.3256, b=26.3256, c=26.3256)""}]"
What is the duration of the synthesis process for HKUST-1?,"MATCH (s:Synthesis_Procedure)-[:has_publication]->(:Publication)<-[:has_publication]-(m:MOF) MATCH (s)-[:has_time]->(t:Synthesis_Time) WHERE s.name CONTAINS 'HKUST-1' RETURN t.Value, t. Unit",107,1,"[{""t.Value"": ""24"", ""t. Unit"": ""h1.0""}, {""t.Value"": ""24"", ""t. Unit"": ""h1.0""}, {""t.Value"": ""20"", ""t. Unit"": ""h1.0""}]"
