question,query,qsq_list_idx,question_idx,answer
Can you tell me the length of the c-axis for the unit cell of MOFs 'HKUST-1'?,"MATCH (m:MOF) WHERE m.name CONTAINS 'HKUST-1' RETURN m.refcode, m.name, m.cell_lengths",44,1,"[{""m.refcode"": ""DOTSOV42"", ""m.name"": ""HKUST-1"", ""m.cell_lengths"": ""CellLengths(a=26.287910000000004, b=26.287910000000004, c=26.287910000000004)""}, {""m.refcode"": ""FIQCEN"", ""m.name"": ""HKUST-1|Teaching Subset: MOFs"", ""m.cell_lengths"": ""CellLengths(a=26.343, b=26.343, c=26.343)""}, {""m.refcode"": ""FUNGAZ"", ""m.name"": ""HKUST-1 (as synthesised)"", ""m.cell_lengths"": ""CellLengths(a=26.3518, b=26.3518, c=26.3518)""}, {""m.refcode"": ""LUDLED"", ""m.name"": ""HKUST-1"", ""m.cell_lengths"": ""CellLengths(a=26.315, b=26.315, c=26.315)""}, {""m.refcode"": ""WULJUJ"", ""m.name"": ""HKUST-1 0.56(dideuteroacetylene)"", ""m.cell_lengths"": ""CellLengths(a=26.3256, b=26.3256, c=26.3256)""}]"
What is the number of various types of bonds found in MOF-5?,"MATCH (m:MOF {name: ""MOF-5""})-[:has_bond]->(b:Bond) RETURN count(distinct b)",145,3,"[{""count(distinct b)"": 142}]"
What is the value of the edge length for each dimension of the unit cell of MOF 'MOF-3'?,"MATCH (m:MOF) WHERE m.name CONTAINS 'MOF-3' RETURN m.refcode, m.name, m.cell_lengths",22,1,"[{""m.refcode"": ""CEFNOT"", ""m.name"": ""she-MOF-3"", ""m.cell_lengths"": ""CellLengths(a=46.744, b=46.744, c=46.744)""}, {""m.refcode"": ""FAYPIG"", ""m.name"": ""DMOF-3"", ""m.cell_lengths"": ""CellLengths(a=19.562, b=20.85, c=23.573)""}, {""m.refcode"": ""FEYQIK"", ""m.name"": ""GWMOF-3"", ""m.cell_lengths"": ""CellLengths(a=8.655000000000001, b=9.9366, c=11.717)""}, {""m.refcode"": ""HOLQAC"", ""m.name"": ""\u03b1-IRMOF-3-AMPh"", ""m.cell_lengths"": ""CellLengths(a=25.5775, b=25.5775, c=25.5775)""}, {""m.refcode"": ""KITVEQ"", ""m.name"": ""MOF-3"", ""m.cell_lengths"": ""CellLengths(a=15.749, b=16.425, c=15.725)""}, {""m.refcode"": ""LAJKUE"", ""m.name"": ""CD-MOF-3"", ""m.cell_lengths"": ""CellLengths(a=30.868000000000002, b=30.868000000000002, c=30.868000000000002)""}, {""m.refcode"": ""MIFGEQ"", ""m.name"": ""TMOF-3"", ""m.cell_lengths"": ""CellLengths(a=22.2892, b=22.2235, c=15.7911)""}, {""m.refcode"": ""PIKYAM"", ""m.name"": ""JUST-3|LMOF-311"", ""m.cell_lengths"": ""CellLengths(a=17.133, b=42.533, c=33.899300000000004)""}]"
What is the database deposition number for MOFs 'HKUST-1'?,"MATCH (m:MOF) WHERE m.name CONTAINS 'HKUST-1' RETURN m.refcode, m.name, m.deposition_number",52,2,"[{""m.refcode"": ""DOTSOV42"", ""m.name"": ""HKUST-1"", ""m.deposition_number"": 755080.0}, {""m.refcode"": ""FIQCEN"", ""m.name"": ""HKUST-1|Teaching Subset: MOFs"", ""m.deposition_number"": 112954.0}, {""m.refcode"": ""FUNGAZ"", ""m.name"": ""HKUST-1 (as synthesised)"", ""m.deposition_number"": 1950115.0}, {""m.refcode"": ""LUDLED"", ""m.name"": ""HKUST-1"", ""m.deposition_number"": 943962.0}, {""m.refcode"": ""WULJUJ"", ""m.name"": ""HKUST-1 0.56(dideuteroacetylene)"", ""m.deposition_number"": 755081.0}]"
Can you provide the sequence of steps for synthesizing MOF-3?,MATCH (m:MOF)-[:has_publication]->(:Publication)<-[:has_publication]-(s:Synthesis_Procedure)-[:has_operation]->(so:Synthesis_Operation) WHERE m.name CONTAINS 'MOF-3' RETURN so.order,95,1,"[{""so.order"": 1}, {""so.order"": 3}, {""so.order"": 4}, {""so.order"": 2}, {""so.order"": 0}, {""so.order"": 0}, {""so.order"": 2}, {""so.order"": 3}, {""so.order"": 1}, {""so.order"": 1}, {""so.order"": 0}, {""so.order"": 0}, {""so.order"": 1}, {""so.order"": 1}, {""so.order"": 0}]"
List the 'HKUST-1' MOFs that have any disorder present in their structures.,"MATCH (m:MOF) WHERE (m.name CONTAINS 'HKUST-1') and (m.has_disorder = true) RETURN m.refcode, m.name, m.has_disorder",18,0,"[{""m.refcode"": ""FUNGAZ"", ""m.name"": ""HKUST-1 (as synthesised)"", ""m.has_disorder"": true}, {""m.refcode"": ""LUDLED"", ""m.name"": ""HKUST-1"", ""m.has_disorder"": true}, {""m.refcode"": ""WULJUJ"", ""m.name"": ""HKUST-1 0.56(dideuteroacetylene)"", ""m.has_disorder"": true}]"
What is the name of the MIL-type MOF that has a similar topology to MOF-5?,MATCH (m1:MOF {name: 'MOF-5'})-[:has_topology]->(t:Topology) Match (t)-[:has_topology]-(m:MOF) MATCH (m) WHERE m.name CONTAINS 'MIL' RETURN DISTINCT m.name,132,1,"[{""m.name"": ""MIL-59""}]"
What is the numerical value assigned to the z parameter of MOF 'IRMOF'?,"MATCH (m:MOF) WHERE m.name CONTAINS 'IRMOF' RETURN m.refcode, m.name, m.z_value",20,1,"[{""m.refcode"": ""GINYAG"", ""m.name"": ""Ni-IRMOF-74-II"", ""m.z_value"": 9.0}, {""m.refcode"": ""GINYIO"", ""m.name"": ""Ni-IRMOF-74-III"", ""m.z_value"": 9.0}, {""m.refcode"": ""GINYOU"", ""m.name"": ""Ni-IRMOF-74-IV"", ""m.z_value"": 9.0}, {""m.refcode"": ""GINYUA"", ""m.name"": ""Ni-IRMOF-74-V"", ""m.z_value"": 9.0}, {""m.refcode"": ""HOLQAC"", ""m.name"": ""\u03b1-IRMOF-3-AMPh"", ""m.z_value"": 8.0}, {""m.refcode"": ""NODTEH"", ""m.name"": ""IRMOF-23terp"", ""m.z_value"": 8.0}, {""m.refcode"": ""NODTIL"", ""m.name"": ""IRMOF-25terPh"", ""m.z_value"": 8.0}, {""m.refcode"": ""NODTOR"", ""m.name"": ""IRMOF-pentane"", ""m.z_value"": 8.0}, {""m.refcode"": ""NUVYEK"", ""m.name"": ""IRMOF-61"", ""m.z_value"": 4.0}, {""m.refcode"": ""NUVYIO"", ""m.name"": ""IRMOF-62"", ""m.z_value"": 6.0}, {""m.refcode"": ""PIWLIT"", ""m.name"": ""IRMOF-9"", ""m.z_value"": 4.0}, {""m.refcode"": ""RAVVUH"", ""m.name"": ""IRMOF-74-II"", ""m.z_value"": 9.0}, {""m.refcode"": ""RAVWAO"", ""m.name"": ""IRMOF-74-III"", ""m.z_value"": 9.0}, {""m.refcode"": ""RAVWES"", ""m.name"": ""IRMOF-74-IV"", ""m.z_value"": 9.0}, {""m.refcode"": ""RAVWOC"", ""m.name"": ""IRMOF-74-V-hex"", ""m.z_value"": 9.0}, {""m.refcode"": ""RAVWUI"", ""m.name"": ""IRMOF-74-VI"", ""m.z_value"": 9.0}, {""m.refcode"": ""RAVXAP"", ""m.name"": ""IRMOF-74-VII"", ""m.z_value"": 9.0}, {""m.refcode"": ""RAVXET"", ""m.name"": ""IRMOF-74-VI-oeg"", ""m.z_value"": 9.0}, {""m.refcode"": ""RAVXIX"", ""m.name"": ""IRMOF-74-IX"", ""m.z_value"": 9.0}, {""m.refcode"": ""RAVXOD"", ""m.name"": ""IRMOF-74-XI"", ""m.z_value"": 9.0}, {""m.refcode"": ""RUTPAY01"", ""m.name"": ""IRMOF-77"", ""m.z_value"": 12.0}, {""m.refcode"": ""WORKUL"", ""m.name"": ""INT-IRMOF-8-C"", ""m.z_value"": 2.0}, {""m.refcode"": ""WORLAS"", ""m.name"": ""INT-IRMOF-8-B"", ""m.z_value"": 2.0}]"
"In the synthesis of MOF 'MOF-3', which operation has the most extensive set of conditions?","MATCH (m:MOF)-[:has_publication]->(:Publication)<-[:has_publication]-(s:Synthesis_Procedure)-[:has_operation]->(o:Synthesis_Operation)-[:has_condition]->(c:Synthesis_Operation_Condition) WHERE m.name CONTAINS 'MOF-3' RETURN o.name, COUNT(c) ORDER BY COUNT(c) DESC LIMIT 1",120,3,"[{""o.name"": ""wait"", ""COUNT(c)"": 6}]"
What is the filename of the data file for the MOFs 'HKUST-1'?,"MATCH (m:MOF) WHERE m.name CONTAINS 'HKUST-1' RETURN m.refcode, m.name, m.filename",53,0,"[{""m.refcode"": ""DOTSOV42"", ""m.name"": ""HKUST-1"", ""m.filename"": ""dotsov42_P1""}, {""m.refcode"": ""FIQCEN"", ""m.name"": ""HKUST-1|Teaching Subset: MOFs"", ""m.filename"": ""fiqcen_P1_H""}, {""m.refcode"": ""FUNGAZ"", ""m.name"": ""HKUST-1 (as synthesised)"", ""m.filename"": ""fungaz_P1""}, {""m.refcode"": ""LUDLED"", ""m.name"": ""HKUST-1"", ""m.filename"": ""ludled_P1""}, {""m.refcode"": ""WULJUJ"", ""m.name"": ""HKUST-1 0.56(dideuteroacetylene)"", ""m.filename"": ""wuljuj_P1""}]"
"Among all the MOFs 'MOF-3', what is the total number of operation conditions required for the synthesis procedures?",MATCH (m:MOF)-[:has_publication]->(:Publication)<-[:has_publication]-(s:Synthesis_Procedure)-[:has_operation]->(o:Synthesis_Operation)-[:has_condition]->(c:Synthesis_Operation_Condition) WHERE m.name CONTAINS 'MOF-3' RETURN count(c),129,2,"[{""count(c)"": 14}]"
Which bond type is the most abundant in MOF-5?,"MATCH (:MOF {name: 'MOF-5'})-[:has_bond]->(b:Bond) RETURN b.name, COUNT(DISTINCT b.name) ORDER BY COUNT(DISTINCT b.name) DESC LIMIT 1",137,2,"[{""b.name"": ""Bond(Aromatic Atom(C2S) Atom(C3NB))"", ""COUNT(DISTINCT b.name)"": 1}]"
In which journal are the majority of the papers about MOF-5 published?,"MATCH (:MOF {name: 'MOF-5'})-[:has_publication]->(p:Publication)-[:in_journal]-(j:Journal) RETURN j.name, COUNT(j) ORDER BY COUNT(j) DESC LIMIT 1;",134,3,"[{""j.name"": ""J.Phys.Chem.C"", ""COUNT(j)"": 21}]"
Which space group is most frequently observed in MOFs?,"MATCH (m:MOF)-[r:has_spaceGroup]->(c:Space_Group) RETURN c.name, count(c) as freq ORDER BY freq DESC LIMIT 1",73,2,"[{""c.name"": ""C2/c"", ""freq"": 1430}]"
Could you provide the value of the r_factor for MOF 'MOF-5'?,"MATCH (m:MOF) WHERE m.name CONTAINS 'MOF-5' RETURN m.refcode, m.name, m.r_factor",35,1,"[{""m.refcode"": ""FAYPUS"", ""m.name"": ""DMOF-5"", ""m.r_factor"": 10.93}, {""m.refcode"": ""LASYOU"", ""m.name"": ""MOF-505"", ""m.r_factor"": 3.61}, {""m.refcode"": ""MIBQAR"", ""m.name"": ""MOF-5"", ""m.r_factor"": 4.88}, {""m.refcode"": ""MIBQAR01"", ""m.name"": ""MOF-5"", ""m.r_factor"": 4.05}, {""m.refcode"": ""MIBQAR02"", ""m.name"": ""MOF-5"", ""m.r_factor"": 3.61}, {""m.refcode"": ""MIBQAR03"", ""m.name"": ""MOF-5"", ""m.r_factor"": 3.3000000000000003}, {""m.refcode"": ""MIBQAR04"", ""m.name"": ""MOF-5"", ""m.r_factor"": 2.97}, {""m.refcode"": ""MIBQAR05"", ""m.name"": ""MOF-5"", ""m.r_factor"": 3.14}, {""m.refcode"": ""MIBQAR06"", ""m.name"": ""MOF-5"", ""m.r_factor"": 2.97}, {""m.refcode"": ""MIBQAR07"", ""m.name"": ""MOF-5"", ""m.r_factor"": 3.11}, {""m.refcode"": ""MIBQAR08"", ""m.name"": ""MOF-5"", ""m.r_factor"": 3.34}, {""m.refcode"": ""MIBQAR09"", ""m.name"": ""MOF-5"", ""m.r_factor"": 3.15}, {""m.refcode"": ""MIBQAR10"", ""m.name"": ""MOF-5"", ""m.r_factor"": 3.14}, {""m.refcode"": ""MIBQAR11"", ""m.name"": ""MOF-5"", ""m.r_factor"": 3.13}, {""m.refcode"": ""MIBQAR12"", ""m.name"": ""MOF-5"", ""m.r_factor"": 3.13}, {""m.refcode"": ""MIBQAR13"", ""m.name"": ""MOF-5"", ""m.r_factor"": 3.26}, {""m.refcode"": ""MIBQAR14"", ""m.name"": ""MOF-5"", ""m.r_factor"": 3.21}, {""m.refcode"": ""MIBQAR15"", ""m.name"": ""MOF-5"", ""m.r_factor"": 3.09}, {""m.refcode"": ""MIBQAR16"", ""m.name"": ""MOF-5"", ""m.r_factor"": 3.6}, {""m.refcode"": ""MIBQAR17"", ""m.name"": ""MOF-5"", ""m.r_factor"": 3.28}, {""m.refcode"": ""MIBQAR18"", ""m.name"": ""MOF-5"", ""m.r_factor"": 6.9}, {""m.refcode"": ""MIBQAR19"", ""m.name"": ""MOF-5"", ""m.r_factor"": 3.1}, {""m.refcode"": ""MIBQAR20"", ""m.name"": ""MOF-5"", ""m.r_factor"": 3.46}, {""m.refcode"": ""OFEDAH"", ""m.name"": ""GR-MOF-5"", ""m.r_factor"": 4.45}, {""m.refcode"": ""OMUKUE"", ""m.name"": ""TPMOF-5"", ""m.r_factor"": 5.0600000000000005}, {""m.refcode"": ""OTECEX"", ""m.name"": ""\u0394-MOF-520 unknown solvate"", ""m.r_factor"": 3.39}, {""m.refcode"": ""OTECUN"", ""m.name"": ""\u039b-MOF-520 trimesate unknown solvate"", ""m.r_factor"": 6.2}, {""m.refcode"": ""OTEDEY"", ""m.name"": ""\u039b-MOF-520 3-(t-butoxycarbonylamino)propan-1,2-diolato unknown solvate"", ""m.r_factor"": 5.23}, {""m.refcode"": ""OTEDOI"", ""m.name"": ""\u039b-MOF-520 unknown solvate"", ""m.r_factor"": 2.9}, {""m.refcode"": ""OTEDUO"", ""m.name"": ""\u039b-MOF-520 methanolate unknown solvate"", ""m.r_factor"": 3.34}, {""m.refcode"": ""QEFWUV"", ""m.name"": ""MOF-545"", ""m.r_factor"": 7.58}, {""m.refcode"": ""QOXQEC"", ""m.name"": ""-MOF-520-24"", ""m.r_factor"": 3.54}, {""m.refcode"": ""QOXQIG"", ""m.name"": ""-MOF-520-25"", ""m.r_factor"": 4.76}, {""m.refcode"": ""QOXQUS"", ""m.name"": ""-MOF-520-27"", ""m.r_factor"": 4.91}, {""m.refcode"": ""QOXRAZ"", ""m.name"": ""-MOF-520-28"", ""m.r_factor"": 5.5600000000000005}, {""m.refcode"": ""QOXRIH"", ""m.name"": ""-MOF-520-31-activated"", ""m.r_factor"": 5.32}, {""m.refcode"": ""QOXRON"", ""m.name"": ""-MOF-520-S-32"", ""m.r_factor"": 7.95}, {""m.refcode"": ""QOXSAA"", ""m.name"": ""-MOF-520-22"", ""m.r_factor"": 2.54}, {""m.refcode"": ""QOXSOO"", ""m.name"": ""-MOF-520-R-32"", ""m.r_factor"": 8.73}, {""m.refcode"": ""QOXSUU"", ""m.name"": ""\u0394-MOF-520-17"", ""m.r_factor"": 4.94}, {""m.refcode"": ""QOXTOP"", ""m.name"": ""\u0394-MOF-520-21"", ""m.r_factor"": 6.54}, {""m.refcode"": ""QOXVEH"", ""m.name"": ""-MOF-520 N,N-dimethylformamide solvate"", ""m.r_factor"": 6.82}, {""m.refcode"": ""RIXPOF"", ""m.name"": ""MOF-519"", ""m.r_factor"": 11.12}, {""m.refcode"": ""RUVKAV"", ""m.name"": ""catena-[(\u03bc8-5,5'-Buta-1,3-diyne-1,4-diyldibenzene-1,3-dicarboxylato)-diaqua-di-copper(ii) dimethylformamide solvate trihydrate]|MOF-505"", ""m.r_factor"": 6.2700000000000005}, {""m.refcode"": ""SAHYIK"", ""m.name"": ""MOF-5|Teaching Subset: MOFs"", ""m.r_factor"": 10.99}, {""m.refcode"": ""SUFJEK"", ""m.name"": ""PMOF-55"", ""m.r_factor"": 4.17}, {""m.refcode"": ""TIHROU"", ""m.name"": ""MOF-591"", ""m.r_factor"": 8.71}, {""m.refcode"": ""TIHRUA"", ""m.name"": ""MOF-592"", ""m.r_factor"": 5.66}, {""m.refcode"": ""TIHTUC"", ""m.name"": ""MOF-590"", ""m.r_factor"": 6.03}, {""m.refcode"": ""VUSKEA01"", ""m.name"": ""MOF-5"", ""m.r_factor"": 5.86}]"
Could you provide the numerical value assigned to the angle between the a-axis and c-axis for the unit cell of MOFs 'HKUST-1'?,"MATCH (m:MOF) WHERE m.name CONTAINS 'HKUST-1' RETURN m.refcode, m.name, m.cell_angles",46,2,"[{""m.refcode"": ""DOTSOV42"", ""m.name"": ""HKUST-1"", ""m.cell_angles"": ""CellAngles(alpha=90.0, beta=90.0, gamma=90.0)""}, {""m.refcode"": ""FIQCEN"", ""m.name"": ""HKUST-1|Teaching Subset: MOFs"", ""m.cell_angles"": ""CellAngles(alpha=90.0, beta=90.0, gamma=90.0)""}, {""m.refcode"": ""FUNGAZ"", ""m.name"": ""HKUST-1 (as synthesised)"", ""m.cell_angles"": ""CellAngles(alpha=90.0, beta=90.0, gamma=90.0)""}, {""m.refcode"": ""LUDLED"", ""m.name"": ""HKUST-1"", ""m.cell_angles"": ""CellAngles(alpha=90.0, beta=90.0, gamma=90.0)""}, {""m.refcode"": ""WULJUJ"", ""m.name"": ""HKUST-1 0.56(dideuteroacetylene)"", ""m.cell_angles"": ""CellAngles(alpha=90.0, beta=90.0, gamma=90.0)""}]"
What is the reference code for MOF-3?,MATCH (m:MOF) WHERE m.name CONTAINS 'MOF-3' RETURN m.refcode,77,2,"[{""m.refcode"": ""CEFNOT""}, {""m.refcode"": ""FAYPIG""}, {""m.refcode"": ""FEYQIK""}, {""m.refcode"": ""HOLQAC""}, {""m.refcode"": ""KITVEQ""}, {""m.refcode"": ""LAJKUE""}, {""m.refcode"": ""MIFGEQ""}, {""m.refcode"": ""PIKYAM""}]"
Can you provide the measurement unit of the property employed during MOF-3's synthesis?,"MATCH (m:MOF)-[:has_publication]->(:Publication)<-[:has_publication]-(s:Synthesis_Procedure)-[:has_property]->(sp:Synthesis_Property) WHERE m.name CONTAINS 'MOF-3' RETURN sp.value, sp.unit",92,1,"[{""sp.value"": ""25"", ""sp.unit"": ""%1.0""}, {""sp.value"": ""4.99"", ""sp.unit"": ""%1.0""}, {""sp.value"": ""53"", ""sp.unit"": ""%1.0""}, {""sp.value"": ""57"", ""sp.unit"": ""%1.0""}, {""sp.value"": ""46"", ""sp.unit"": ""%1.0""}]"
What is the color of the MOFs 'HKUST-1' under different lighting conditions?,"MATCH (m:MOF) WHERE m.name CONTAINS 'HKUST-1' RETURN m.refcode, m.name, m.color",49,0,"[{""m.refcode"": ""DOTSOV42"", ""m.name"": ""HKUST-1"", ""m.color"": """"}, {""m.refcode"": ""FIQCEN"", ""m.name"": ""HKUST-1|Teaching Subset: MOFs"", ""m.color"": ""turquoise""}, {""m.refcode"": ""FUNGAZ"", ""m.name"": ""HKUST-1 (as synthesised)"", ""m.color"": ""light blue""}, {""m.refcode"": ""LUDLED"", ""m.name"": ""HKUST-1"", ""m.color"": ""blue""}, {""m.refcode"": ""WULJUJ"", ""m.name"": ""HKUST-1 0.56(dideuteroacetylene)"", ""m.color"": """"}]"
What is the prevalent type of chemical bond found in MOF-5?,"MATCH (:MOF {name: 'MOF-5'})-[:has_bond]->(b:Bond) RETURN b.name, COUNT(DISTINCT b.name) ORDER BY COUNT(DISTINCT b.name) DESC LIMIT 1",137,1,"[{""b.name"": ""Bond(Aromatic Atom(C2S) Atom(C3NB))"", ""COUNT(DISTINCT b.name)"": 1}]"
What is the measurement unit for the temperature applied in the synthesis of MOF-3?,"MATCH (m:MOF)-[:has_publication]->(:Publication)<-[:has_publication]-(s:Synthesis_Procedure)-[:has_temperature]->(t:Synthesis_Temperature) WHERE m.name CONTAINS 'MOF-3' RETURN t.Value, t.Unit",88,1,"[{""t.Value"": 393.15, ""t.Unit"": ""K1.0""}, {""t.Value"": 453.15, ""t.Unit"": ""K1.0""}, {""t.Value"": 353.15, ""t.Unit"": ""K1.0""}, {""t.Value"": 353.15, ""t.Unit"": ""K1.0""}, {""t.Value"": 398.15, ""t.Unit"": ""K1.0""}]"
What is the z_prime value of MOF 'IRMOF'?,"MATCH (m:MOF) WHERE m.name CONTAINS 'IRMOF' RETURN m.refcode, m.name, m.z_prime",16,3,"[{""m.refcode"": ""GINYAG"", ""m.name"": ""Ni-IRMOF-74-II"", ""m.z_prime"": 0.5}, {""m.refcode"": ""GINYIO"", ""m.name"": ""Ni-IRMOF-74-III"", ""m.z_prime"": 0.5}, {""m.refcode"": ""GINYOU"", ""m.name"": ""Ni-IRMOF-74-IV"", ""m.z_prime"": 1.0}, {""m.refcode"": ""GINYUA"", ""m.name"": ""Ni-IRMOF-74-V"", ""m.z_prime"": 1.0}, {""m.refcode"": ""HOLQAC"", ""m.name"": ""\u03b1-IRMOF-3-AMPh"", ""m.z_prime"": 0.33}, {""m.refcode"": ""NODTEH"", ""m.name"": ""IRMOF-23terp"", ""m.z_prime"": 0.04}, {""m.refcode"": ""NODTIL"", ""m.name"": ""IRMOF-25terPh"", ""m.z_prime"": 0.04}, {""m.refcode"": ""NODTOR"", ""m.name"": ""IRMOF-pentane"", ""m.z_prime"": 0.25}, {""m.refcode"": ""NUVYEK"", ""m.name"": ""IRMOF-61"", ""m.z_prime"": 0.25}, {""m.refcode"": ""NUVYIO"", ""m.name"": ""IRMOF-62"", ""m.z_prime"": 1.0}, {""m.refcode"": ""PIWLIT"", ""m.name"": ""IRMOF-9"", ""m.z_prime"": 1.0}, {""m.refcode"": ""RAVVUH"", ""m.name"": ""IRMOF-74-II"", ""m.z_prime"": 0.5}, {""m.refcode"": ""RAVWAO"", ""m.name"": ""IRMOF-74-III"", ""m.z_prime"": 0.5}, {""m.refcode"": ""RAVWES"", ""m.name"": ""IRMOF-74-IV"", ""m.z_prime"": 1.0}, {""m.refcode"": ""RAVWOC"", ""m.name"": ""IRMOF-74-V-hex"", ""m.z_prime"": 0.5}, {""m.refcode"": ""RAVWUI"", ""m.name"": ""IRMOF-74-VI"", ""m.z_prime"": 1.0}, {""m.refcode"": ""RAVXAP"", ""m.name"": ""IRMOF-74-VII"", ""m.z_prime"": 1.0}, {""m.refcode"": ""RAVXET"", ""m.name"": ""IRMOF-74-VI-oeg"", ""m.z_prime"": 0.5}, {""m.refcode"": ""RAVXIX"", ""m.name"": ""IRMOF-74-IX"", ""m.z_prime"": 1.0}, {""m.refcode"": ""RAVXOD"", ""m.name"": ""IRMOF-74-XI"", ""m.z_prime"": 1.0}, {""m.refcode"": ""RUTPAY01"", ""m.name"": ""IRMOF-77"", ""m.z_prime"": 0.33}, {""m.refcode"": ""WORKUL"", ""m.name"": ""INT-IRMOF-8-C"", ""m.z_prime"": 1.0}, {""m.refcode"": ""WORLAS"", ""m.name"": ""INT-IRMOF-8-B"", ""m.z_prime"": 1.0}]"
List the unit of the property in MOF-3's synthesis.,"MATCH (m:MOF)-[:has_publication]->(:Publication)<-[:has_publication]-(s:Synthesis_Procedure)-[:has_property]->(sp:Synthesis_Property) WHERE m.name CONTAINS 'MOF-3' RETURN sp.value, sp.unit",92,3,"[{""sp.value"": ""25"", ""sp.unit"": ""%1.0""}, {""sp.value"": ""4.99"", ""sp.unit"": ""%1.0""}, {""sp.value"": ""53"", ""sp.unit"": ""%1.0""}, {""sp.value"": ""57"", ""sp.unit"": ""%1.0""}, {""sp.value"": ""46"", ""sp.unit"": ""%1.0""}]"
What is the name of the metal utilized to make MOF-5?,"MATCH (m:MOF {name: ""MOF-5""})-[:has_metal]->(metal:Metal) RETURN DISTINCT metal.name;",146,3,"[{""metal.name"": ""[Zn][O]([Zn])([Zn])[Zn]""}]"
Which journals are in the top 5 for publishing MOFs?,"MATCH (mof:MOF)-[:has_publication]-(pub:Publication)-[:in_journal]-(j:Journal) RETURN j.name, count(j) as freq ORDER BY freq DESC LIMIT 5",61,2,"[{""j.name"": ""Inorg.Chem."", ""freq"": 1151}, {""j.name"": ""Cryst.Growth Des."", ""freq"": 1084}, {""j.name"": ""CrystEngComm"", ""freq"": 1025}, {""j.name"": ""J.Am.Chem.Soc."", ""freq"": 718}, {""j.name"": ""Chem.Commun."", ""freq"": 607}]"
"For any MOF 'MOF-3', what is the name of the solvent precursor used in the synthesis process with the smallest MOratio?",MATCH (m:MOF)-[:has_publication]->(:Publication)<-[:has_publication]-(s:Synthesis_Procedure)-[:has_solvent_precursor]->(sp:Synthesis_Solvent_Precursor) WHERE m.name CONTAINS 'MOF-3' RETURN sp.name ORDER BY s.MOratio ASC LIMIT 1,121,1,"[{""sp.name"": ""DMF""}]"
Which database or experimental technique was utilized to determine the structure of MOFs 'HKUST-1'?,"MATCH (m:MOF) WHERE m.name CONTAINS 'HKUST-1' RETURN m.refcode, m.name, m.datasource",51,3,"[{""m.refcode"": ""DOTSOV42"", ""m.name"": ""HKUST-1"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""FIQCEN"", ""m.name"": ""HKUST-1|Teaching Subset: MOFs"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""FUNGAZ"", ""m.name"": ""HKUST-1 (as synthesised)"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""LUDLED"", ""m.name"": ""HKUST-1"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""WULJUJ"", ""m.name"": ""HKUST-1 0.56(dideuteroacetylene)"", ""m.datasource"": ""CSD""}]"
"Can you tell me the name of the Metal used in the MOF that has the Topology identified by the RCSR code ""rut""?","MATCH (m:MOF)-[:has_topology]->(t:Topology {rcsr_code: ""rut""}), (m)-[:has_metal]->(met: Metal) RETURN met.name;",150,1,[]
"Among all the publications related to MOFs 'MOF-3', which one has the earliest title?",MATCH (m:MOF)-[:has_publication]->(p:Publication)-[:has_title]-(t:Title) WHERE m.name CONTAINS 'MOF-3' RETURN t.title ORDER BY p.year ASC LIMIT 1,123,1,"[{""t.title"": ""Toward Templated Metal\u2212Organic Frameworks:\u2009 Synthesis, Structures, Thermal Properties, and Luminescence of Three Novel Lanthanide\u2212Adipate Frameworks""}]"
"Among all MOFs whose name contains 'MOF-3', which synthesis procedure has the lowest MOratio?","MATCH (m:MOF)-[:has_publication]->(:Publication)<-[:has_publication]-(s:Synthesis_Procedure) WHERE m.name CONTAINS 'MOF-3' WITH min(s.MOratio) as min MATCH (m1:MOF)-[:has_publication]->(:Publication)<-[:has_publication]-(s1:Synthesis_Procedure) WHERE (m1.name CONTAINS 'MOF-3') and (s1.MOratio=min) RETURN s1.syn_id, s1.name, s1.symbol, s1.method, s1.MOratio",110,0,"[{""s1.syn_id"": ""MIsyn11347"", ""s1.name"": ""[Zn(tcbpe)(DMF)]\u22c5(MeCN)"", ""s1.symbol"": ""2"", ""s1.method"": """", ""s1.MOratio"": 2.0}, {""s1.syn_id"": ""MIsyn11346"", ""s1.name"": ""[Cd3(tcbpe)1.5(DMF)(H2O)2]\u22c5(DMF)6\u22c5(EtOH)3"", ""s1.symbol"": ""1"", ""s1.method"": """", ""s1.MOratio"": 2.0}]"
Which temperature is utilized during the synthesis of MOF-3?,"MATCH (m:MOF)-[:has_publication]->(:Publication)<-[:has_publication]-(s:Synthesis_Procedure)-[:has_temperature]->(t:Synthesis_Temperature) WHERE m.name CONTAINS 'MOF-3' RETURN t.Value, t.Unit",87,2,"[{""t.Value"": 393.15, ""t.Unit"": ""K1.0""}, {""t.Value"": 453.15, ""t.Unit"": ""K1.0""}, {""t.Value"": 353.15, ""t.Unit"": ""K1.0""}, {""t.Value"": 353.15, ""t.Unit"": ""K1.0""}, {""t.Value"": 398.15, ""t.Unit"": ""K1.0""}]"
What is the measurement and unit of the critical property used in the synthesis of HKUST-1?,"MATCH (s:Synthesis_Procedure)-[:has_publication]->(:Publication)<-[:has_publication]-(m:MOF) MATCH (s)-[:has_property]->(sp:Synthesis_Property) WHERE m.name CONTAINS 'MOF-5' RETURN sp.value, sp.unit",108,2,"[{""sp.value"": ""86"", ""sp.unit"": ""%1.0""}, {""sp.value"": ""60"", ""sp.unit"": ""%1.0""}, {""sp.value"": ""60"", ""sp.unit"": ""%1.0""}, {""sp.value"": ""60"", ""sp.unit"": ""%1.0""}, {""sp.value"": ""60"", ""sp.unit"": ""%1.0""}, {""sp.value"": ""81"", ""sp.unit"": ""%1.0""}, {""sp.value"": ""77"", ""sp.unit"": ""%1.0""}, {""sp.value"": ""83"", ""sp.unit"": ""%1.0""}, {""sp.value"": ""74"", ""sp.unit"": ""%1.0""}, {""sp.value"": ""65"", ""sp.unit"": ""%1.0""}, {""sp.value"": ""64"", ""sp.unit"": ""%1.0""}]"
What is the number of MOFs within the 'Cu-Cu paddlewheels' group?,MATCH (m:MOF)-[:has_family]->(f:Family) WHERE f.name CONTAINS 'Cu-Cu paddleWheels' RETURN count(m.refcode),4,3,"[{""count(m.refcode)"": 219}]"
"What is the Metal type present in the MOF having the Topology with RCSR code ""rut""?","MATCH (m:MOF)-[:has_topology]->(t:Topology {rcsr_code: ""rut""}), (m)-[:has_metal]->(met: Metal) RETURN met.name;",150,2,[]
What is the synthesis temperature of MOF 'HKUST-1'?,"MATCH (m:MOF) WHERE m.name CONTAINS 'HKUST-1' RETURN m.refcode, m.name, m.temperature",15,2,"[{""m.refcode"": ""DOTSOV42"", ""m.name"": ""HKUST-1"", ""m.temperature"": ""at 4 K""}, {""m.refcode"": ""FIQCEN"", ""m.name"": ""HKUST-1|Teaching Subset: MOFs"", ""m.temperature"": """"}, {""m.refcode"": ""FUNGAZ"", ""m.name"": ""HKUST-1 (as synthesised)"", ""m.temperature"": ""203 K""}, {""m.refcode"": ""LUDLED"", ""m.name"": ""HKUST-1"", ""m.temperature"": ""298 K""}, {""m.refcode"": ""WULJUJ"", ""m.name"": ""HKUST-1 0.56(dideuteroacetylene)"", ""m.temperature"": ""at 4 K""}]"
What is the name of the published paper that discusses the synthesis process and properties of HKUST-1?,"MATCH (m:MOF)-[:has_publication]-(p:Publication)-[:has_publication]-(s:Synthesis_Procedure) WHERE m.name CONTAINS 'HKUST-1' RETURN p.year, p.volume,p.doi",96,3,"[{""p.year"": 2009, ""p.volume"": 131, ""p.doi"": ""10.1021/ja904782h""}, {""p.year"": 2009, ""p.volume"": 131, ""p.doi"": ""10.1021/ja904782h""}]"
"Name the Organic_Linker present in the MOF having the name including ""IRMOF"" and the Crystal_System of ""orthorhombic"".","MATCH (m:MOF)-[:has_crystalSystem]->(cs:Crystal_System {name: ""orthorhombic""}), (m)-[:has_organicLinker]->(ol:Organic_Linker) WHERE m.name CONTAINS 'IRMOF' RETURN ol.name;",154,3,"[{""ol.name"": ""[O-]C(=O)c1ccc(cc1)C(=O)[O-]""}]"
What is the value of the property used in the synthesis of MOF-3?,"MATCH (m:MOF)-[:has_publication]->(:Publication)<-[:has_publication]-(s:Synthesis_Procedure)-[:has_property]->(sp:Synthesis_Property) WHERE m.name CONTAINS 'MOF-3' RETURN sp.value, sp.unit",91,0,"[{""sp.value"": ""25"", ""sp.unit"": ""%1.0""}, {""sp.value"": ""4.99"", ""sp.unit"": ""%1.0""}, {""sp.value"": ""53"", ""sp.unit"": ""%1.0""}, {""sp.value"": ""57"", ""sp.unit"": ""%1.0""}, {""sp.value"": ""46"", ""sp.unit"": ""%1.0""}]"
Can you provide the symbol used to denote the synthetic process of HKUST-1?,MATCH (m:MOF)-[:has_publication]-(p:Publication)-[:has_publication]-(s:Synthesis_Procedure) WHERE m.name CONTAINS 'HKUST-1' RETURN s.symbol,99,1,"[{""s.symbol"": """"}, {""s.symbol"": """"}]"
What is the unit for the time used in the synthesis of MOF-3?,"MATCH (m:MOF)-[:has_publication]->(:Publication)<-[:has_publication]-(s:Synthesis_Procedure)-[:has_time]->(st:Synthesis_Time) WHERE m.name CONTAINS 'MOF-3' RETURN st.Value, st.Unit",90,0,"[{""st.Value"": ""72"", ""st.Unit"": ""h1.0""}, {""st.Value"": ""72"", ""st.Unit"": ""h1.0""}, {""st.Value"": ""48.0"", ""st.Unit"": ""h1.0""}, {""st.Value"": ""48.0"", ""st.Unit"": ""h1.0""}, {""st.Value"": ""48.0"", ""st.Unit"": ""h1.0""}]"
What is the organic ligand employed in the creation of HKUST-1?,MATCH (s:Synthesis_Procedure)-[:has_publication]->(:Publication)<-[:has_publication]-(m:MOF) MATCH (s)-[:has_organic_precursor]->(mp:Synthesis_Organic_Precursor) WHERE m.name CONTAINS 'HKUST-1' RETURN mp.name,102,1,"[{""mp.name"": ""H3BTC""}, {""mp.name"": ""H3BTC""}]"
What is the numerical value assigned to the length of the c-axis for the unit cell of MOFs 'HKUST-1'?,"MATCH (m:MOF) WHERE m.name CONTAINS 'HKUST-1' RETURN m.refcode, m.name, m.cell_lengths",44,2,"[{""m.refcode"": ""DOTSOV42"", ""m.name"": ""HKUST-1"", ""m.cell_lengths"": ""CellLengths(a=26.287910000000004, b=26.287910000000004, c=26.287910000000004)""}, {""m.refcode"": ""FIQCEN"", ""m.name"": ""HKUST-1|Teaching Subset: MOFs"", ""m.cell_lengths"": ""CellLengths(a=26.343, b=26.343, c=26.343)""}, {""m.refcode"": ""FUNGAZ"", ""m.name"": ""HKUST-1 (as synthesised)"", ""m.cell_lengths"": ""CellLengths(a=26.3518, b=26.3518, c=26.3518)""}, {""m.refcode"": ""LUDLED"", ""m.name"": ""HKUST-1"", ""m.cell_lengths"": ""CellLengths(a=26.315, b=26.315, c=26.315)""}, {""m.refcode"": ""WULJUJ"", ""m.name"": ""HKUST-1 0.56(dideuteroacetylene)"", ""m.cell_lengths"": ""CellLengths(a=26.3256, b=26.3256, c=26.3256)""}]"
"Identify the Topology name that corresponds to the MOF containing a Metal identified as ""Zn"" and a Crystal_System of ""tetragonal"".","MATCH (m:MOF)-[:has_metal]->(met: Metal {name: ""[Zn]""}), (m)-[:has_crystalSystem]->(cs:Crystal_System {name: ""tetragonal""}), (m)-[:has_topology]->(t:Topology) RETURN t.rcsr_code;",152,1,"[{""t.rcsr_code"": ""deh""}, {""t.rcsr_code"": ""UNKNOWN""}, {""t.rcsr_code"": ""ERROR""}, {""t.rcsr_code"": ""pts""}, {""t.rcsr_code"": ""tfi""}, {""t.rcsr_code"": ""sql""}, {""t.rcsr_code"": ""lig""}, {""t.rcsr_code"": ""dia""}, {""t.rcsr_code"": ""sql""}, {""t.rcsr_code"": ""ERROR""}, {""t.rcsr_code"": ""rtl""}, {""t.rcsr_code"": ""UNKNOWN""}, {""t.rcsr_code"": ""UNKNOWN""}, {""t.rcsr_code"": ""ERROR""}, {""t.rcsr_code"": ""dia""}, {""t.rcsr_code"": ""UNKNOWN""}, {""t.rcsr_code"": ""lvt""}, {""t.rcsr_code"": ""sql""}, {""t.rcsr_code"": ""dia""}, {""t.rcsr_code"": ""UNKNOWN""}, {""t.rcsr_code"": ""UNKNOWN""}, {""t.rcsr_code"": ""dia""}, {""t.rcsr_code"": ""gis""}, {""t.rcsr_code"": ""lvt""}, {""t.rcsr_code"": ""mer""}, {""t.rcsr_code"": ""UNKNOWN""}, {""t.rcsr_code"": ""ant""}, {""t.rcsr_code"": ""UNKNOWN""}, {""t.rcsr_code"": ""dia""}, {""t.rcsr_code"": ""lvt""}, {""t.rcsr_code"": ""pcb""}, {""t.rcsr_code"": ""dia""}, {""t.rcsr_code"": ""rtl""}, {""t.rcsr_code"": ""ERROR""}, {""t.rcsr_code"": ""UNKNOWN""}, {""t.rcsr_code"": ""rtl""}, {""t.rcsr_code"": ""UNKNOWN""}, {""t.rcsr_code"": ""UNKNOWN""}, {""t.rcsr_code"": ""dia""}, {""t.rcsr_code"": ""UNKNOWN""}, {""t.rcsr_code"": ""gis""}, {""t.rcsr_code"": ""utg""}, {""t.rcsr_code"": ""sql""}, {""t.rcsr_code"": ""UNKNOWN""}, {""t.rcsr_code"": ""dia""}, {""t.rcsr_code"": ""UNKNOWN""}, {""t.rcsr_code"": ""ERROR""}, {""t.rcsr_code"": ""pts""}, {""t.rcsr_code"": ""ant""}, {""t.rcsr_code"": ""gis""}, {""t.rcsr_code"": ""ERROR""}, {""t.rcsr_code"": ""pts""}, {""t.rcsr_code"": ""lig""}, {""t.rcsr_code"": ""pcb""}, {""t.rcsr_code"": ""UNKNOWN""}, {""t.rcsr_code"": ""UNKNOWN""}, {""t.rcsr_code"": ""ERROR""}, {""t.rcsr_code"": ""deh""}, {""t.rcsr_code"": ""dia""}, {""t.rcsr_code"": ""UNKNOWN""}, {""t.rcsr_code"": ""UNKNOWN""}, {""t.rcsr_code"": ""ERROR""}, {""t.rcsr_code"": ""ERROR""}, {""t.rcsr_code"": ""ERROR""}, {""t.rcsr_code"": ""UNKNOWN""}, {""t.rcsr_code"": ""rtl""}, {""t.rcsr_code"": ""pts""}, {""t.rcsr_code"": ""UNKNOWN""}, {""t.rcsr_code"": ""ERROR""}, {""t.rcsr_code"": ""sql""}, {""t.rcsr_code"": ""dmd""}, {""t.rcsr_code"": ""gis""}, {""t.rcsr_code"": ""srs""}, {""t.rcsr_code"": ""mot-e""}, {""t.rcsr_code"": ""mjb""}, {""t.rcsr_code"": ""UNKNOWN""}, {""t.rcsr_code"": ""gis""}, {""t.rcsr_code"": ""dia""}, {""t.rcsr_code"": ""ERROR""}, {""t.rcsr_code"": ""UNKNOWN""}, {""t.rcsr_code"": ""gis""}, {""t.rcsr_code"": ""ERROR""}, {""t.rcsr_code"": ""UNKNOWN""}, {""t.rcsr_code"": ""dia""}, {""t.rcsr_code"": ""ant""}, {""t.rcsr_code"": ""deh""}, {""t.rcsr_code"": ""rtl""}, {""t.rcsr_code"": ""UNKNOWN""}, {""t.rcsr_code"": ""UNKNOWN""}, {""t.rcsr_code"": ""UNKNOWN""}, {""t.rcsr_code"": ""UNKNOWN""}, {""t.rcsr_code"": ""UNKNOWN""}, {""t.rcsr_code"": ""ant""}, {""t.rcsr_code"": ""ERROR""}, {""t.rcsr_code"": ""UNKNOWN""}, {""t.rcsr_code"": ""UNKNOWN""}, {""t.rcsr_code"": ""pts""}, {""t.rcsr_code"": ""sod""}, {""t.rcsr_code"": ""ant""}, {""t.rcsr_code"": ""dia""}, {""t.rcsr_code"": ""ERROR""}, {""t.rcsr_code"": ""dia""}, {""t.rcsr_code"": ""UNKNOWN""}, {""t.rcsr_code"": ""zni""}, {""t.rcsr_code"": ""dia""}]"
How long does it take to synthesize HKUST-1?,"MATCH (s:Synthesis_Procedure)-[:has_publication]->(:Publication)<-[:has_publication]-(m:MOF) MATCH (s)-[:has_time]->(t:Synthesis_Time) WHERE s.name CONTAINS 'HKUST-1' RETURN t.Value, t. Unit",107,2,"[{""t.Value"": ""24"", ""t. Unit"": ""h1.0""}, {""t.Value"": ""24"", ""t. Unit"": ""h1.0""}, {""t.Value"": ""20"", ""t. Unit"": ""h1.0""}]"
What is the highest value for any metal composition of the metal precursors for the synthesis procedures with a synthesis operation that has the name 'prepare' for any MOF 'MOF-3'?,MATCH (m:MOF)-[:has_publication]->(:Publication)<-[:has_publication]-(s:Synthesis_Procedure)-[:has_metal_precursor]->(mp:Synthesis_Metal_Precursor)-[:has_composition]->(mc:Metal_Composition) MATCH (s)-[:has_operation]->(p:Synthesis_Operation) WHERE m.name CONTAINS 'MOF-3' AND toLower(p.name) CONTAINS 'prepare' RETURN max(mc.value) ORDER BY max(mc.value) DESC LIMIT 1,127,0,"[{""max(mc.value)"": 12.3}]"
