question,query,qsq_list_idx,question_idx,answer
What is the origin of the information on MOF 'MOF-5'?,"MATCH (m:MOF) WHERE m.name CONTAINS 'MOF-5' RETURN m.refcode, m.name, m.datasource",28,3,"[{""m.refcode"": ""FAYPUS"", ""m.name"": ""DMOF-5"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""LASYOU"", ""m.name"": ""MOF-505"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""MIBQAR"", ""m.name"": ""MOF-5"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""MIBQAR01"", ""m.name"": ""MOF-5"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""MIBQAR02"", ""m.name"": ""MOF-5"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""MIBQAR03"", ""m.name"": ""MOF-5"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""MIBQAR04"", ""m.name"": ""MOF-5"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""MIBQAR05"", ""m.name"": ""MOF-5"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""MIBQAR06"", ""m.name"": ""MOF-5"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""MIBQAR07"", ""m.name"": ""MOF-5"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""MIBQAR08"", ""m.name"": ""MOF-5"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""MIBQAR09"", ""m.name"": ""MOF-5"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""MIBQAR10"", ""m.name"": ""MOF-5"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""MIBQAR11"", ""m.name"": ""MOF-5"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""MIBQAR12"", ""m.name"": ""MOF-5"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""MIBQAR13"", ""m.name"": ""MOF-5"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""MIBQAR14"", ""m.name"": ""MOF-5"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""MIBQAR15"", ""m.name"": ""MOF-5"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""MIBQAR16"", ""m.name"": ""MOF-5"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""MIBQAR17"", ""m.name"": ""MOF-5"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""MIBQAR18"", ""m.name"": ""MOF-5"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""MIBQAR19"", ""m.name"": ""MOF-5"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""MIBQAR20"", ""m.name"": ""MOF-5"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""OFEDAH"", ""m.name"": ""GR-MOF-5"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""OMUKUE"", ""m.name"": ""TPMOF-5"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""OTECEX"", ""m.name"": ""\u0394-MOF-520 unknown solvate"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""OTECUN"", ""m.name"": ""\u039b-MOF-520 trimesate unknown solvate"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""OTEDEY"", ""m.name"": ""\u039b-MOF-520 3-(t-butoxycarbonylamino)propan-1,2-diolato unknown solvate"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""OTEDOI"", ""m.name"": ""\u039b-MOF-520 unknown solvate"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""OTEDUO"", ""m.name"": ""\u039b-MOF-520 methanolate unknown solvate"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""QEFWUV"", ""m.name"": ""MOF-545"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""QOXQEC"", ""m.name"": ""-MOF-520-24"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""QOXQIG"", ""m.name"": ""-MOF-520-25"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""QOXQUS"", ""m.name"": ""-MOF-520-27"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""QOXRAZ"", ""m.name"": ""-MOF-520-28"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""QOXRIH"", ""m.name"": ""-MOF-520-31-activated"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""QOXRON"", ""m.name"": ""-MOF-520-S-32"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""QOXSAA"", ""m.name"": ""-MOF-520-22"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""QOXSOO"", ""m.name"": ""-MOF-520-R-32"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""QOXSUU"", ""m.name"": ""\u0394-MOF-520-17"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""QOXTOP"", ""m.name"": ""\u0394-MOF-520-21"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""QOXVEH"", ""m.name"": ""-MOF-520 N,N-dimethylformamide solvate"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""RIXPOF"", ""m.name"": ""MOF-519"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""RUVKAV"", ""m.name"": ""catena-[(\u03bc8-5,5'-Buta-1,3-diyne-1,4-diyldibenzene-1,3-dicarboxylato)-diaqua-di-copper(ii) dimethylformamide solvate trihydrate]|MOF-505"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""SAHYIK"", ""m.name"": ""MOF-5|Teaching Subset: MOFs"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""SUFJEK"", ""m.name"": ""PMOF-55"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""TIHROU"", ""m.name"": ""MOF-591"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""TIHRUA"", ""m.name"": ""MOF-592"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""TIHTUC"", ""m.name"": ""MOF-590"", ""m.datasource"": ""CSD""}, {""m.refcode"": ""VUSKEA01"", ""m.name"": ""MOF-5"", ""m.datasource"": ""CSD""}]"
What are the filenames associated with the MOFs named 'MOF-5'?,"MATCH (m:MOF) WHERE m.name CONTAINS 'MOF-5' RETURN m.refcode, m.name, m.filename",34,2,"[{""m.refcode"": ""FAYPUS"", ""m.name"": ""DMOF-5"", ""m.filename"": ""faypus_P1""}, {""m.refcode"": ""LASYOU"", ""m.name"": ""MOF-505"", ""m.filename"": ""lasyou_P1""}, {""m.refcode"": ""MIBQAR"", ""m.name"": ""MOF-5"", ""m.filename"": ""mibqar_P1""}, {""m.refcode"": ""MIBQAR01"", ""m.name"": ""MOF-5"", ""m.filename"": ""mibqar01_P1""}, {""m.refcode"": ""MIBQAR02"", ""m.name"": ""MOF-5"", ""m.filename"": ""mibqar02_P1""}, {""m.refcode"": ""MIBQAR03"", ""m.name"": ""MOF-5"", ""m.filename"": ""mibqar03_P1""}, {""m.refcode"": ""MIBQAR04"", ""m.name"": ""MOF-5"", ""m.filename"": ""mibqar04_P1""}, {""m.refcode"": ""MIBQAR05"", ""m.name"": ""MOF-5"", ""m.filename"": ""mibqar05_P1""}, {""m.refcode"": ""MIBQAR06"", ""m.name"": ""MOF-5"", ""m.filename"": ""mibqar06_P1""}, {""m.refcode"": ""MIBQAR07"", ""m.name"": ""MOF-5"", ""m.filename"": ""mibqar07_P1""}, {""m.refcode"": ""MIBQAR08"", ""m.name"": ""MOF-5"", ""m.filename"": ""mibqar08_P1""}, {""m.refcode"": ""MIBQAR09"", ""m.name"": ""MOF-5"", ""m.filename"": ""mibqar09_P1""}, {""m.refcode"": ""MIBQAR10"", ""m.name"": ""MOF-5"", ""m.filename"": ""mibqar10_P1""}, {""m.refcode"": ""MIBQAR11"", ""m.name"": ""MOF-5"", ""m.filename"": ""mibqar11_P1""}, {""m.refcode"": ""MIBQAR12"", ""m.name"": ""MOF-5"", ""m.filename"": ""mibqar12_P1""}, {""m.refcode"": ""MIBQAR13"", ""m.name"": ""MOF-5"", ""m.filename"": ""mibqar13_P1""}, {""m.refcode"": ""MIBQAR14"", ""m.name"": ""MOF-5"", ""m.filename"": ""mibqar14_P1""}, {""m.refcode"": ""MIBQAR15"", ""m.name"": ""MOF-5"", ""m.filename"": ""mibqar15_P1""}, {""m.refcode"": ""MIBQAR16"", ""m.name"": ""MOF-5"", ""m.filename"": ""mibqar16_P1""}, {""m.refcode"": ""MIBQAR17"", ""m.name"": ""MOF-5"", ""m.filename"": ""mibqar17_P1""}, {""m.refcode"": ""MIBQAR18"", ""m.name"": ""MOF-5"", ""m.filename"": ""mibqar18_P1""}, {""m.refcode"": ""MIBQAR19"", ""m.name"": ""MOF-5"", ""m.filename"": ""mibqar19_P1""}, {""m.refcode"": ""MIBQAR20"", ""m.name"": ""MOF-5"", ""m.filename"": ""mibqar20_P1""}, {""m.refcode"": ""OFEDAH"", ""m.name"": ""GR-MOF-5"", ""m.filename"": ""ofedah_P1""}, {""m.refcode"": ""OMUKUE"", ""m.name"": ""TPMOF-5"", ""m.filename"": ""omukue_P1_charged""}, {""m.refcode"": ""OTECEX"", ""m.name"": ""\u0394-MOF-520 unknown solvate"", ""m.filename"": ""otecex_P1""}, {""m.refcode"": ""OTECUN"", ""m.name"": ""\u039b-MOF-520 trimesate unknown solvate"", ""m.filename"": ""otecun_P1""}, {""m.refcode"": ""OTEDEY"", ""m.name"": ""\u039b-MOF-520 3-(t-butoxycarbonylamino)propan-1,2-diolato unknown solvate"", ""m.filename"": ""otedey_P1""}, {""m.refcode"": ""OTEDOI"", ""m.name"": ""\u039b-MOF-520 unknown solvate"", ""m.filename"": ""otedoi_P1""}, {""m.refcode"": ""OTEDUO"", ""m.name"": ""\u039b-MOF-520 methanolate unknown solvate"", ""m.filename"": ""oteduo_P1""}, {""m.refcode"": ""QEFWUV"", ""m.name"": ""MOF-545"", ""m.filename"": ""qefwuv_P1_H""}, {""m.refcode"": ""QOXQEC"", ""m.name"": ""-MOF-520-24"", ""m.filename"": ""qoxqec_P1""}, {""m.refcode"": ""QOXQIG"", ""m.name"": ""-MOF-520-25"", ""m.filename"": ""qoxqig_P1""}, {""m.refcode"": ""QOXQUS"", ""m.name"": ""-MOF-520-27"", ""m.filename"": ""qoxqus_P1""}, {""m.refcode"": ""QOXRAZ"", ""m.name"": ""-MOF-520-28"", ""m.filename"": ""qoxraz_P1""}, {""m.refcode"": ""QOXRIH"", ""m.name"": ""-MOF-520-31-activated"", ""m.filename"": ""qoxrih_P1""}, {""m.refcode"": ""QOXRON"", ""m.name"": ""-MOF-520-S-32"", ""m.filename"": ""qoxron_P1_H""}, {""m.refcode"": ""QOXSAA"", ""m.name"": ""-MOF-520-22"", ""m.filename"": ""qoxsaa_P1""}, {""m.refcode"": ""QOXSOO"", ""m.name"": ""-MOF-520-R-32"", ""m.filename"": ""qoxsoo_P1""}, {""m.refcode"": ""QOXSUU"", ""m.name"": ""\u0394-MOF-520-17"", ""m.filename"": ""qoxsuu_P1""}, {""m.refcode"": ""QOXTOP"", ""m.name"": ""\u0394-MOF-520-21"", ""m.filename"": ""qoxtop_P1""}, {""m.refcode"": ""QOXVEH"", ""m.name"": ""-MOF-520 N,N-dimethylformamide solvate"", ""m.filename"": ""qoxveh_P1""}, {""m.refcode"": ""RIXPOF"", ""m.name"": ""MOF-519"", ""m.filename"": ""rixpof_P1_H""}, {""m.refcode"": ""RUVKAV"", ""m.name"": ""catena-[(\u03bc8-5,5'-Buta-1,3-diyne-1,4-diyldibenzene-1,3-dicarboxylato)-diaqua-di-copper(ii) dimethylformamide solvate trihydrate]|MOF-505"", ""m.filename"": ""ruvkav_P1""}, {""m.refcode"": ""SAHYIK"", ""m.name"": ""MOF-5|Teaching Subset: MOFs"", ""m.filename"": ""sahyik_P1""}, {""m.refcode"": ""SUFJEK"", ""m.name"": ""PMOF-55"", ""m.filename"": ""sufjek_P1""}, {""m.refcode"": ""TIHROU"", ""m.name"": ""MOF-591"", ""m.filename"": ""tihrou_P1_charged""}, {""m.refcode"": ""TIHRUA"", ""m.name"": ""MOF-592"", ""m.filename"": ""tihrua_P1_charged""}, {""m.refcode"": ""TIHTUC"", ""m.name"": ""MOF-590"", ""m.filename"": ""tihtuc_P1""}, {""m.refcode"": ""VUSKEA01"", ""m.name"": ""MOF-5"", ""m.filename"": ""vuskea01_P1""}]"
Which organic precursor is used in the synthesis of HKUST-1?,MATCH (s:Synthesis_Procedure)-[:has_publication]->(:Publication)<-[:has_publication]-(m:MOF) MATCH (s)-[:has_organic_precursor]->(mp:Synthesis_Organic_Precursor) WHERE m.name CONTAINS 'HKUST-1' RETURN mp.name,102,3,"[{""mp.name"": ""H3BTC""}, {""mp.name"": ""H3BTC""}]"
What factors were considered during the creation of MOF-3?,"MATCH (m:MOF)-[:has_publication]->(:Publication)<-[:has_publication]-(s:Synthesis_Procedure)-[:has_operation]->(so:Synthesis_Operation)-[:has_condition]->(soc:Synthesis_Operation_Condition) WHERE m.name CONTAINS 'MOF-3' RETURN soc.Property, soc.Value, soc.Unit, soc.order",94,2,"[{""soc.Property"": ""Time"", ""soc.Value"": ""72"", ""soc.Unit"": ""h1.0"", ""soc.order"": 1}, {""soc.Property"": ""Temperature"", ""soc.Value"": ""120"", ""soc.Unit"": ""\u00b0C1.0"", ""soc.order"": 0}, {""soc.Property"": ""Temperature"", ""soc.Value"": ""293"", ""soc.Unit"": ""K1.0"", ""soc.order"": 0}, {""soc.Property"": ""Time"", ""soc.Value"": ""72"", ""soc.Unit"": ""h1.0"", ""soc.order"": 1}, {""soc.Property"": ""Temperature"", ""soc.Value"": ""180"", ""soc.Unit"": ""\u00b0C1.0"", ""soc.order"": 0}, {""soc.Property"": ""Temperature"", ""soc.Value"": ""293"", ""soc.Unit"": ""K1.0"", ""soc.order"": 0}, {""soc.Property"": ""Time"", ""soc.Value"": ""3"", ""soc.Unit"": ""days1.0"", ""soc.order"": 0}, {""soc.Property"": ""Temperature"", ""soc.Value"": ""293"", ""soc.Unit"": ""K1.0"", ""soc.order"": 1}, {""soc.Property"": ""Time"", ""soc.Value"": ""2"", ""soc.Unit"": ""days1.0"", ""soc.order"": 1}, {""soc.Property"": ""Temperature"", ""soc.Value"": ""80"", ""soc.Unit"": ""\u00b0C1.0"", ""soc.order"": 0}, {""soc.Property"": ""Temperature"", ""soc.Value"": ""80"", ""soc.Unit"": ""\u00b0C1.0"", ""soc.order"": 0}, {""soc.Property"": ""Time"", ""soc.Value"": ""2"", ""soc.Unit"": ""days1.0"", ""soc.order"": 1}, {""soc.Property"": ""Time"", ""soc.Value"": ""2"", ""soc.Unit"": ""days1.0"", ""soc.order"": 1}, {""soc.Property"": ""Temperature"", ""soc.Value"": ""125"", ""soc.Unit"": ""\u00b0C1.0"", ""soc.order"": 0}]"
What is the unique identifier for the publication that discusses the synthesis process and properties of HKUST-1?,MATCH (m:MOF)-[:has_publication]-(p:Publication)-[:has_publication]-(s:Synthesis_Procedure) WHERE m.name CONTAINS 'HKUST-1' RETURN p.doi,97,3,"[{""p.doi"": ""10.1021/ja904782h""}, {""p.doi"": ""10.1021/ja904782h""}]"
Which crystal system has the highest occurrence rate?,"MATCH (m:MOF)-[r:has_crystalSystem]->(c:Crystal_System) RETURN c.name, count(c) as freq ORDER BY freq DESC LIMIT 1",64,3,"[{""c.name"": ""monoclinic"", ""freq"": 3911}]"
What is the formula of the chemical compound utilized as the ligand in MOFs 'MOF-3'?,"MATCH (m:MOF)-[:has_organicLinker]->(l:Organic_Linker) WHERE m.name CONTAINS 'MOF-3' RETURN m.refcode, m.name, l.name",55,2,"[{""m.refcode"": ""CEFNOT"", ""m.name"": ""she-MOF-3"", ""l.name"": ""[O-]C(=O)c1ccc(cc1)C#Cc1ccc(cc1)c1c(c2ccc(cc2)C#Cc2ccc(cc2)C(=O)[O-])c(c2ccc(cc2)C#Cc2ccc(cc2)C(=O)[O-])c(c(c1c1ccc(cc1)C#Cc1ccc(cc1)C(=O)[O-])c1ccc(cc1)C#Cc1ccc(cc1)C(=O)[O-])c1ccc(cc1)C#Cc1ccc(cc1)C(=O)[O-]""}, {""m.refcode"": ""FAYPIG"", ""m.name"": ""DMOF-3"", ""l.name"": ""CC1=CC2=NN=NC2=C[CH]1""}, {""m.refcode"": ""FEYQIK"", ""m.name"": ""GWMOF-3"", ""l.name"": ""[O-]C(=O)CCCCC(=O)[O-]""}, {""m.refcode"": ""HOLQAC"", ""m.name"": ""\u03b1-IRMOF-3-AMPh"", ""l.name"": ""O=C(c1ccccc1)Nc1cc(ccc1C(=O)[O-])C(=O)[O-]""}, {""m.refcode"": ""KITVEQ"", ""m.name"": ""MOF-3"", ""l.name"": ""[O-]C(=O)[C]1[CH][C](OC[C]2C=Cc3c4[C]2C=CC25c4c(cc3)[CH]C5[CH]2)[CH]C(=C1)C(=O)[O-]""}, {""m.refcode"": ""LAJKUE"", ""m.name"": ""CD-MOF-3"", ""l.name"": ""[O]CC1OC2OC3C(C[O])OC(C(C3[O])[O])OC3C(C[O])OC(C(C3[O])[O])OC3C(C[O])OC(C(C3[O])[O])OC3C(OC(OC4C(OC(OC5C(OC(OC6C(OC(OC1C(C2[O])[O])C([O])C6[O])C[O])C([O])C5[O])C[O])C([O])C4[O])C[O])C(C3[O])[O])C[O]""}, {""m.refcode"": ""MIFGEQ"", ""m.name"": ""TMOF-3"", ""l.name"": ""[O]S(Cc1cc(CS([O])([O])[O])c(cc1CS([O])([O])[O])CS([O])([O])[O])([O])[O]""}, {""m.refcode"": ""PIKYAM"", ""m.name"": ""JUST-3|LMOF-311"", ""l.name"": ""O=CN(C)C""}]"
How many different families of MOFs use the same metal as MOF-5?,MATCH (:MOF {name: 'MOF-5'})-[:has_metal]->(m:Metal)<-[:has_metal]-(:MOF)-[:has_family]->(f:Family)  RETURN COUNT(DISTINCT f.name);,135,0,"[{""COUNT(DISTINCT f.name)"": 1}]"
Does the molecular framework of MOF 'ZIF-1' have a 3D arrangement?,"MATCH (m:MOF) WHERE m.name CONTAINS 'ZIF-1' RETURN m.refcode, m.name, m.has_3d_structure",17,3,"[{""m.refcode"": ""BIHQAM"", ""m.name"": ""MOZIF-1"", ""m.has_3d_structure"": true}, {""m.refcode"": ""VEJYEP"", ""m.name"": ""ZIF-1"", ""m.has_3d_structure"": true}]"
What is the chemical formula of the ligand?,"MATCH (m:MOF)-[:has_organicLinker]->(l:Organic_Linker) WHERE m.name CONTAINS 'MOF-3' RETURN m.refcode, m.name, l.name",55,0,"[{""m.refcode"": ""CEFNOT"", ""m.name"": ""she-MOF-3"", ""l.name"": ""[O-]C(=O)c1ccc(cc1)C#Cc1ccc(cc1)c1c(c2ccc(cc2)C#Cc2ccc(cc2)C(=O)[O-])c(c2ccc(cc2)C#Cc2ccc(cc2)C(=O)[O-])c(c(c1c1ccc(cc1)C#Cc1ccc(cc1)C(=O)[O-])c1ccc(cc1)C#Cc1ccc(cc1)C(=O)[O-])c1ccc(cc1)C#Cc1ccc(cc1)C(=O)[O-]""}, {""m.refcode"": ""FAYPIG"", ""m.name"": ""DMOF-3"", ""l.name"": ""CC1=CC2=NN=NC2=C[CH]1""}, {""m.refcode"": ""FEYQIK"", ""m.name"": ""GWMOF-3"", ""l.name"": ""[O-]C(=O)CCCCC(=O)[O-]""}, {""m.refcode"": ""HOLQAC"", ""m.name"": ""\u03b1-IRMOF-3-AMPh"", ""l.name"": ""O=C(c1ccccc1)Nc1cc(ccc1C(=O)[O-])C(=O)[O-]""}, {""m.refcode"": ""KITVEQ"", ""m.name"": ""MOF-3"", ""l.name"": ""[O-]C(=O)[C]1[CH][C](OC[C]2C=Cc3c4[C]2C=CC25c4c(cc3)[CH]C5[CH]2)[CH]C(=C1)C(=O)[O-]""}, {""m.refcode"": ""LAJKUE"", ""m.name"": ""CD-MOF-3"", ""l.name"": ""[O]CC1OC2OC3C(C[O])OC(C(C3[O])[O])OC3C(C[O])OC(C(C3[O])[O])OC3C(C[O])OC(C(C3[O])[O])OC3C(OC(OC4C(OC(OC5C(OC(OC6C(OC(OC1C(C2[O])[O])C([O])C6[O])C[O])C([O])C5[O])C[O])C([O])C4[O])C[O])C(C3[O])[O])C[O]""}, {""m.refcode"": ""MIFGEQ"", ""m.name"": ""TMOF-3"", ""l.name"": ""[O]S(Cc1cc(CS([O])([O])[O])c(cc1CS([O])([O])[O])CS([O])([O])[O])([O])[O]""}, {""m.refcode"": ""PIKYAM"", ""m.name"": ""JUST-3|LMOF-311"", ""l.name"": ""O=CN(C)C""}]"
"For the synthesis of MOF 'MOF-3', what is the largest value of solvent composition associated with any solvent precursor?",MATCH (m:MOF)-[:has_publication]->(:Publication)<-[:has_publication]-(s:Synthesis_Procedure)-[:has_solvent_precursor]->(sp:Synthesis_Solvent_Precursor)-[:has_composition]->(sc:Solvent_Composition) WHERE m.name CONTAINS 'MOF-3' RETURN max(sc.value),119,3,"[{""max(sc.value)"": 6.0}]"
"What is the total number of Authors linked to the publication of the MOF with a name containing ""IRMOF"" and Crystal_System of ""triclinic""?","MATCH (m:MOF)-[:has_crystalSystem]->(cs:Crystal_System {name: ""triclinic""}), (m)-[:has_publication]->(p:Publication), (p)-[:has_author]->(a:Author) WHERE m.name CONTAINS 'IRMOF' RETURN count(distinct a);",151,1,"[{""count(distinct a)"": 7}]"
What is the synthesis procedure with the smallest MOratio among all MOFs that have 'MOF-3' in their names?,"MATCH (m:MOF)-[:has_publication]->(:Publication)<-[:has_publication]-(s:Synthesis_Procedure) WHERE m.name CONTAINS 'MOF-3' WITH min(s.MOratio) as min MATCH (m1:MOF)-[:has_publication]->(:Publication)<-[:has_publication]-(s1:Synthesis_Procedure) WHERE (m1.name CONTAINS 'MOF-3') and (s1.MOratio=min) RETURN s1.syn_id, s1.name, s1.symbol, s1.method, s1.MOratio",110,1,"[{""s1.syn_id"": ""MIsyn11347"", ""s1.name"": ""[Zn(tcbpe)(DMF)]\u22c5(MeCN)"", ""s1.symbol"": ""2"", ""s1.method"": """", ""s1.MOratio"": 2.0}, {""s1.syn_id"": ""MIsyn11346"", ""s1.name"": ""[Cd3(tcbpe)1.5(DMF)(H2O)2]\u22c5(DMF)6\u22c5(EtOH)3"", ""s1.symbol"": ""1"", ""s1.method"": """", ""s1.MOratio"": 2.0}]"
What is the level of temperature applied in the synthesis of MOF-3?,"MATCH (m:MOF)-[:has_publication]->(:Publication)<-[:has_publication]-(s:Synthesis_Procedure)-[:has_temperature]->(t:Synthesis_Temperature) WHERE m.name CONTAINS 'MOF-3' RETURN t.Value, t.Unit",87,1,"[{""t.Value"": 393.15, ""t.Unit"": ""K1.0""}, {""t.Value"": 453.15, ""t.Unit"": ""K1.0""}, {""t.Value"": 353.15, ""t.Unit"": ""K1.0""}, {""t.Value"": 353.15, ""t.Unit"": ""K1.0""}, {""t.Value"": 398.15, ""t.Unit"": ""K1.0""}]"
What is the size of the angle formed between the a-axis and b-axis for the unit cell of MOFs 'HKUST-1'?,"MATCH (m:MOF) WHERE m.name CONTAINS 'HKUST-1' RETURN m.refcode, m.name, m.cell_angles",47,3,"[{""m.refcode"": ""DOTSOV42"", ""m.name"": ""HKUST-1"", ""m.cell_angles"": ""CellAngles(alpha=90.0, beta=90.0, gamma=90.0)""}, {""m.refcode"": ""FIQCEN"", ""m.name"": ""HKUST-1|Teaching Subset: MOFs"", ""m.cell_angles"": ""CellAngles(alpha=90.0, beta=90.0, gamma=90.0)""}, {""m.refcode"": ""FUNGAZ"", ""m.name"": ""HKUST-1 (as synthesised)"", ""m.cell_angles"": ""CellAngles(alpha=90.0, beta=90.0, gamma=90.0)""}, {""m.refcode"": ""LUDLED"", ""m.name"": ""HKUST-1"", ""m.cell_angles"": ""CellAngles(alpha=90.0, beta=90.0, gamma=90.0)""}, {""m.refcode"": ""WULJUJ"", ""m.name"": ""HKUST-1 0.56(dideuteroacetylene)"", ""m.cell_angles"": ""CellAngles(alpha=90.0, beta=90.0, gamma=90.0)""}]"
Who tops the list for the highest number of MOFs published?,"MATCH (mof:MOF)-[:has_publication]-(pub:Publication)-[:has_author]-(j:Author) RETURN j.name, count(j) as freq ORDER BY freq DESC LIMIT 1",62,3,"[{""j.name"": ""P.D.C.Dietzel"", ""freq"": 418}]"
What is the rsc code of the topology of MOF-5?,"MATCH (m:MOF {name: ""MOF-5""})-[:has_topology]->(t:Topology) RETURN DISTINCT t.rcsr_code",148,0,"[{""t.rcsr_code"": ""pcu""}]"
What was the arrangement of the synthetic processes used in the creation of MOF-3?,MATCH (m:MOF)-[:has_publication]->(:Publication)<-[:has_publication]-(s:Synthesis_Procedure)-[:has_operation]->(so:Synthesis_Operation) WHERE m.name CONTAINS 'MOF-3' RETURN so.order,95,3,"[{""so.order"": 1}, {""so.order"": 3}, {""so.order"": 4}, {""so.order"": 2}, {""so.order"": 0}, {""so.order"": 0}, {""so.order"": 2}, {""so.order"": 3}, {""so.order"": 1}, {""so.order"": 1}, {""so.order"": 0}, {""so.order"": 0}, {""so.order"": 1}, {""so.order"": 1}, {""so.order"": 0}]"
What is the metal source utilized for the creation of HKUST-1?,MATCH (s:Synthesis_Procedure)-[:has_publication]->(:Publication)<-[:has_publication]-(m:MOF) MATCH (s)-[:has_metal_precursor]->(mp:Synthesis_Metal_Precursor) WHERE m.name CONTAINS 'HKUST-1' RETURN mp.name,100,1,"[{""mp.name"": ""Cu(NO3)2\u22c5(H2O)2.5""}, {""mp.name"": ""Cu(NO3)2\u22c5(H2O)2.5""}]"
Can you enumerate the 10 RCSR codes that are associated with MOF topologies?,"MATCH (m:MOF)-[r:has_topology]->(c:Topology) RETURN c.rcsr_code, count(c) as freq ORDER BY freq DESC LIMIT 10",72,1,"[{""c.rcsr_code"": ""UNKNOWN"", ""freq"": 2960}, {""c.rcsr_code"": ""ERROR"", ""freq"": 2264}, {""c.rcsr_code"": ""pcu"", ""freq"": 715}, {""c.rcsr_code"": ""dia"", ""freq"": 491}, {""c.rcsr_code"": ""sql"", ""freq"": 296}, {""c.rcsr_code"": ""pts"", ""freq"": 195}, {""c.rcsr_code"": ""nbo"", ""freq"": 152}, {""c.rcsr_code"": ""rtl"", ""freq"": 134}, {""c.rcsr_code"": ""ths"", ""freq"": 114}, {""c.rcsr_code"": ""srs"", ""freq"": 112}]"
"Determine the number of atoms present in the MOF having the name containing ""IRMOF"" and a Space_Group designated as ""P6/mmm"".","MATCH (m:MOF)-[:has_spaceGroup]->(sg:Space_Group {name: ""P6/mmm""}), (m)-[:has_atom]->(a:Atom) WHERE m.name CONTAINS 'IRMOF' RETURN count(distinct a);",153,2,"[{""count(distinct a)"": 0}]"
What is the maximum temperature used in the synthesis process of MOFs 'MOF-3'?,MATCH (m:MOF)-[:has_publication]->(:Publication)<-[:has_publication]-(s:Synthesis_Procedure)-[:has_temperature]->(t:Synthesis_Temperature) WHERE m.name CONTAINS 'MOF-3' RETURN max(t.Value),124,1,"[{""max(t.Value)"": 453.15}]"
What is the journal that has the largest count of publications on MOFs with the same crystal system as MOF-5?,"MATCH (m1:MOF)-[:has_crystalSystem]->(s:Crystal_System)-[:has_crystalSystem]-(m2:MOF)-[:has_publication]-(p)-[:in_journal]-(j) WITH j.name as journalName, count(distinct m2) as numMOFs ORDER BY numMOFs DESC LIMIT 1 RETURN journalName;",144,1,"[{""journalName"": ""Inorg.Chem.""}]"
Can you provide the refcode assigned to MOF-3?,MATCH (m:MOF) WHERE m.name CONTAINS 'MOF-3' RETURN m.refcode,77,1,"[{""m.refcode"": ""CEFNOT""}, {""m.refcode"": ""FAYPIG""}, {""m.refcode"": ""FEYQIK""}, {""m.refcode"": ""HOLQAC""}, {""m.refcode"": ""KITVEQ""}, {""m.refcode"": ""LAJKUE""}, {""m.refcode"": ""MIFGEQ""}, {""m.refcode"": ""PIKYAM""}]"
How many distinct types of bonds exist in the MOF-5 framework?,"MATCH (m:MOF {name: ""MOF-5""})-[:has_bond]->(b:Bond) RETURN count(distinct b)",145,2,"[{""count(distinct b)"": 142}]"
What ligand has the highest frequency of use in MOF synthesis?,"MATCH (m:MOF)-[r:has_organicLinker]->(c:Organic_Linker) RETURN c.name, count(c) as freq ORDER BY freq DESC LIMIT 1",69,3,"[{""c.name"": ""[O-]C(=O)c1cc([O])c(cc1[O])C(=O)[O-]"", ""freq"": 510}]"
"How many individuals contributed to the publication of the MOF that has the name containing ""IRMOF"" and a Crystal_System of ""triclinic""?","MATCH (m:MOF)-[:has_crystalSystem]->(cs:Crystal_System {name: ""triclinic""}), (m)-[:has_publication]->(p:Publication), (p)-[:has_author]->(a:Author) WHERE m.name CONTAINS 'IRMOF' RETURN count(distinct a);",151,3,"[{""count(distinct a)"": 7}]"
"Among MOFs with the same crystal system as MOF-5, which metal is the rarest?","MATCH (:MOF {name: 'MOF-5'})-[:has_crystalSystem]->(c:Crystal_System)<-[:has_crystalSystem]-(mof:MOF)-[:has_metal]->(mm:Metal) RETURN mm.name, COUNT(DISTINCT mm.name) ORDER BY COUNT(DISTINCT mm.name) ASC LIMIT 1;",136,1,"[{""mm.name"": ""[K]"", ""COUNT(DISTINCT mm.name)"": 1}]"
What is the atom that is most commonly found in all MOFs?,"MATCH (n:Atom) WITH n.name AS name, count(*) as freq ORDER BY freq LIMIT 1 RETURN name",56,1,"[{""name"": ""Atom(Co1)""}]"
What is the numerical value assigned to the r_factor for MOF 'MOF-5'?,"MATCH (m:MOF) WHERE m.name CONTAINS 'MOF-5' RETURN m.refcode, m.name, m.r_factor",35,2,"[{""m.refcode"": ""FAYPUS"", ""m.name"": ""DMOF-5"", ""m.r_factor"": 10.93}, {""m.refcode"": ""LASYOU"", ""m.name"": ""MOF-505"", ""m.r_factor"": 3.61}, {""m.refcode"": ""MIBQAR"", ""m.name"": ""MOF-5"", ""m.r_factor"": 4.88}, {""m.refcode"": ""MIBQAR01"", ""m.name"": ""MOF-5"", ""m.r_factor"": 4.05}, {""m.refcode"": ""MIBQAR02"", ""m.name"": ""MOF-5"", ""m.r_factor"": 3.61}, {""m.refcode"": ""MIBQAR03"", ""m.name"": ""MOF-5"", ""m.r_factor"": 3.3000000000000003}, {""m.refcode"": ""MIBQAR04"", ""m.name"": ""MOF-5"", ""m.r_factor"": 2.97}, {""m.refcode"": ""MIBQAR05"", ""m.name"": ""MOF-5"", ""m.r_factor"": 3.14}, {""m.refcode"": ""MIBQAR06"", ""m.name"": ""MOF-5"", ""m.r_factor"": 2.97}, {""m.refcode"": ""MIBQAR07"", ""m.name"": ""MOF-5"", ""m.r_factor"": 3.11}, {""m.refcode"": ""MIBQAR08"", ""m.name"": ""MOF-5"", ""m.r_factor"": 3.34}, {""m.refcode"": ""MIBQAR09"", ""m.name"": ""MOF-5"", ""m.r_factor"": 3.15}, {""m.refcode"": ""MIBQAR10"", ""m.name"": ""MOF-5"", ""m.r_factor"": 3.14}, {""m.refcode"": ""MIBQAR11"", ""m.name"": ""MOF-5"", ""m.r_factor"": 3.13}, {""m.refcode"": ""MIBQAR12"", ""m.name"": ""MOF-5"", ""m.r_factor"": 3.13}, {""m.refcode"": ""MIBQAR13"", ""m.name"": ""MOF-5"", ""m.r_factor"": 3.26}, {""m.refcode"": ""MIBQAR14"", ""m.name"": ""MOF-5"", ""m.r_factor"": 3.21}, {""m.refcode"": ""MIBQAR15"", ""m.name"": ""MOF-5"", ""m.r_factor"": 3.09}, {""m.refcode"": ""MIBQAR16"", ""m.name"": ""MOF-5"", ""m.r_factor"": 3.6}, {""m.refcode"": ""MIBQAR17"", ""m.name"": ""MOF-5"", ""m.r_factor"": 3.28}, {""m.refcode"": ""MIBQAR18"", ""m.name"": ""MOF-5"", ""m.r_factor"": 6.9}, {""m.refcode"": ""MIBQAR19"", ""m.name"": ""MOF-5"", ""m.r_factor"": 3.1}, {""m.refcode"": ""MIBQAR20"", ""m.name"": ""MOF-5"", ""m.r_factor"": 3.46}, {""m.refcode"": ""OFEDAH"", ""m.name"": ""GR-MOF-5"", ""m.r_factor"": 4.45}, {""m.refcode"": ""OMUKUE"", ""m.name"": ""TPMOF-5"", ""m.r_factor"": 5.0600000000000005}, {""m.refcode"": ""OTECEX"", ""m.name"": ""\u0394-MOF-520 unknown solvate"", ""m.r_factor"": 3.39}, {""m.refcode"": ""OTECUN"", ""m.name"": ""\u039b-MOF-520 trimesate unknown solvate"", ""m.r_factor"": 6.2}, {""m.refcode"": ""OTEDEY"", ""m.name"": ""\u039b-MOF-520 3-(t-butoxycarbonylamino)propan-1,2-diolato unknown solvate"", ""m.r_factor"": 5.23}, {""m.refcode"": ""OTEDOI"", ""m.name"": ""\u039b-MOF-520 unknown solvate"", ""m.r_factor"": 2.9}, {""m.refcode"": ""OTEDUO"", ""m.name"": ""\u039b-MOF-520 methanolate unknown solvate"", ""m.r_factor"": 3.34}, {""m.refcode"": ""QEFWUV"", ""m.name"": ""MOF-545"", ""m.r_factor"": 7.58}, {""m.refcode"": ""QOXQEC"", ""m.name"": ""-MOF-520-24"", ""m.r_factor"": 3.54}, {""m.refcode"": ""QOXQIG"", ""m.name"": ""-MOF-520-25"", ""m.r_factor"": 4.76}, {""m.refcode"": ""QOXQUS"", ""m.name"": ""-MOF-520-27"", ""m.r_factor"": 4.91}, {""m.refcode"": ""QOXRAZ"", ""m.name"": ""-MOF-520-28"", ""m.r_factor"": 5.5600000000000005}, {""m.refcode"": ""QOXRIH"", ""m.name"": ""-MOF-520-31-activated"", ""m.r_factor"": 5.32}, {""m.refcode"": ""QOXRON"", ""m.name"": ""-MOF-520-S-32"", ""m.r_factor"": 7.95}, {""m.refcode"": ""QOXSAA"", ""m.name"": ""-MOF-520-22"", ""m.r_factor"": 2.54}, {""m.refcode"": ""QOXSOO"", ""m.name"": ""-MOF-520-R-32"", ""m.r_factor"": 8.73}, {""m.refcode"": ""QOXSUU"", ""m.name"": ""\u0394-MOF-520-17"", ""m.r_factor"": 4.94}, {""m.refcode"": ""QOXTOP"", ""m.name"": ""\u0394-MOF-520-21"", ""m.r_factor"": 6.54}, {""m.refcode"": ""QOXVEH"", ""m.name"": ""-MOF-520 N,N-dimethylformamide solvate"", ""m.r_factor"": 6.82}, {""m.refcode"": ""RIXPOF"", ""m.name"": ""MOF-519"", ""m.r_factor"": 11.12}, {""m.refcode"": ""RUVKAV"", ""m.name"": ""catena-[(\u03bc8-5,5'-Buta-1,3-diyne-1,4-diyldibenzene-1,3-dicarboxylato)-diaqua-di-copper(ii) dimethylformamide solvate trihydrate]|MOF-505"", ""m.r_factor"": 6.2700000000000005}, {""m.refcode"": ""SAHYIK"", ""m.name"": ""MOF-5|Teaching Subset: MOFs"", ""m.r_factor"": 10.99}, {""m.refcode"": ""SUFJEK"", ""m.name"": ""PMOF-55"", ""m.r_factor"": 4.17}, {""m.refcode"": ""TIHROU"", ""m.name"": ""MOF-591"", ""m.r_factor"": 8.71}, {""m.refcode"": ""TIHRUA"", ""m.name"": ""MOF-592"", ""m.r_factor"": 5.66}, {""m.refcode"": ""TIHTUC"", ""m.name"": ""MOF-590"", ""m.r_factor"": 6.03}, {""m.refcode"": ""VUSKEA01"", ""m.name"": ""MOF-5"", ""m.r_factor"": 5.86}]"
What publication has the highest count of MOFs?,"MATCH (m:MOF)-[:has_publication]-(p:Publication) RETURN count(m), p.doi ORDER BY count(m) DESC LIMIT 1",142,1,"[{""count(m)"": 379, ""p.doi"": ""10.1002/cssc.201601752""}]"
What is the name of the synthesis procedure used to make MOF-3?,MATCH (m:MOF)-[:has_publication]->(:Publication)<-[:has_publication]-(s:Synthesis_Procedure) WHERE m.name CONTAINS 'MOF-3' RETURN s.name,79,0,"[{""s.name"": ""GWMOF-6""}, {""s.name"": """"}, {""s.name"": ""[Zn(tcbpe)(DMF)]\u22c5(MeCN)""}, {""s.name"": ""[Cd3(tcbpe)1.5(DMF)(H2O)2]\u22c5(DMF)6\u22c5(EtOH)3""}, {""s.name"": ""[Cd(tcbpe)]\u22c5(MeCN)""}]"
List the source of the MOFs 'HKUST-1'.,"MATCH (m:MOF) WHERE m.name CONTAINS 'HKUST-1' RETURN m.refcode, m.name, m.source",50,3,"[{""m.refcode"": ""DOTSOV42"", ""m.name"": ""HKUST-1"", ""m.source"": """"}, {""m.refcode"": ""FIQCEN"", ""m.name"": ""HKUST-1|Teaching Subset: MOFs"", ""m.source"": """"}, {""m.refcode"": ""FUNGAZ"", ""m.name"": ""HKUST-1 (as synthesised)"", ""m.source"": """"}, {""m.refcode"": ""LUDLED"", ""m.name"": ""HKUST-1"", ""m.source"": """"}, {""m.refcode"": ""WULJUJ"", ""m.name"": ""HKUST-1 0.56(dideuteroacetylene)"", ""m.source"": """"}]"
What is the least frequently used metal in MOFs with the same framework as MOF-5?,"MATCH (:MOF {name: 'MOF-5'})-[:has_crystalSystem]->(c:Crystal_System)<-[:has_crystalSystem]-(mof:MOF)-[:has_metal]->(mm:Metal) RETURN mm.name, COUNT(DISTINCT mm.name) ORDER BY COUNT(DISTINCT mm.name) ASC LIMIT 1;",136,2,"[{""mm.name"": ""[K]"", ""COUNT(DISTINCT mm.name)"": 1}]"
Count the total number of Authors associated with publications on HKUST-1.,"MATCH (m:MOF {name: ""HKUST-1""})-[:has_publication]->(p:Publication)-[:has_author]->(a:Author) RETURN count(distinct a);",157,1,"[{""count(distinct a)"": 11}]"
Could you provide a list of journals that have published research on MOF 'MOF-5'?,MATCH (mof:MOF {name: 'MOF-5'})-[:has_publication]-(pub:Publication)-[:in_journal]-(j:Journal) RETURN DISTINCT j.name,59,2,"[{""j.name"": ""J.Phys.Chem.C""}, {""j.name"": ""Koord.Khim.""}]"
What is the specific metallic source used in the synthesis of HKUST-1?,MATCH (s:Synthesis_Procedure)-[:has_publication]->(:Publication)<-[:has_publication]-(m:MOF) MATCH (s)-[:has_metal_precursor]->(mp:Synthesis_Metal_Precursor) WHERE m.name CONTAINS 'HKUST-1' RETURN mp.name,100,2,"[{""mp.name"": ""Cu(NO3)2\u22c5(H2O)2.5""}, {""mp.name"": ""Cu(NO3)2\u22c5(H2O)2.5""}]"
Which metal precursor is employed in the synthesis of HKUST-1?,MATCH (s:Synthesis_Procedure)-[:has_publication]->(:Publication)<-[:has_publication]-(m:MOF) MATCH (s)-[:has_metal_precursor]->(mp:Synthesis_Metal_Precursor) WHERE m.name CONTAINS 'HKUST-1' RETURN mp.name,100,3,"[{""mp.name"": ""Cu(NO3)2\u22c5(H2O)2.5""}, {""mp.name"": ""Cu(NO3)2\u22c5(H2O)2.5""}]"
Which unit is utilized to measure the temperature during the synthesis of MOF-3?,"MATCH (m:MOF)-[:has_publication]->(:Publication)<-[:has_publication]-(s:Synthesis_Procedure)-[:has_temperature]->(t:Synthesis_Temperature) WHERE m.name CONTAINS 'MOF-3' RETURN t.Value, t.Unit",88,2,"[{""t.Value"": 393.15, ""t.Unit"": ""K1.0""}, {""t.Value"": 453.15, ""t.Unit"": ""K1.0""}, {""t.Value"": 353.15, ""t.Unit"": ""K1.0""}, {""t.Value"": 353.15, ""t.Unit"": ""K1.0""}, {""t.Value"": 398.15, ""t.Unit"": ""K1.0""}]"
