question,query,qsq_list_idx,question_idx,answer
Can you specify the solvents employed in the recrystallization process of MOF 'IRMOF'?,"MATCH (m:MOF) WHERE m.name CONTAINS 'IRMOF' RETURN m.refcode, m.name, m.solvent",13,2,"[{""m.refcode"": ""GINYAG"", ""m.name"": ""Ni-IRMOF-74-II"", ""m.solvent"": """"}, {""m.refcode"": ""GINYIO"", ""m.name"": ""Ni-IRMOF-74-III"", ""m.solvent"": """"}, {""m.refcode"": ""GINYOU"", ""m.name"": ""Ni-IRMOF-74-IV"", ""m.solvent"": """"}, {""m.refcode"": ""GINYUA"", ""m.name"": ""Ni-IRMOF-74-V"", ""m.solvent"": """"}, {""m.refcode"": ""HOLQAC"", ""m.name"": ""\u03b1-IRMOF-3-AMPh"", ""m.solvent"": """"}, {""m.refcode"": ""NODTEH"", ""m.name"": ""IRMOF-23terp"", ""m.solvent"": """"}, {""m.refcode"": ""NODTIL"", ""m.name"": ""IRMOF-25terPh"", ""m.solvent"": """"}, {""m.refcode"": ""NODTOR"", ""m.name"": ""IRMOF-pentane"", ""m.solvent"": """"}, {""m.refcode"": ""NUVYEK"", ""m.name"": ""IRMOF-61"", ""m.solvent"": """"}, {""m.refcode"": ""NUVYIO"", ""m.name"": ""IRMOF-62"", ""m.solvent"": """"}, {""m.refcode"": ""PIWLIT"", ""m.name"": ""IRMOF-9"", ""m.solvent"": """"}, {""m.refcode"": ""RAVVUH"", ""m.name"": ""IRMOF-74-II"", ""m.solvent"": """"}, {""m.refcode"": ""RAVWAO"", ""m.name"": ""IRMOF-74-III"", ""m.solvent"": """"}, {""m.refcode"": ""RAVWES"", ""m.name"": ""IRMOF-74-IV"", ""m.solvent"": """"}, {""m.refcode"": ""RAVWOC"", ""m.name"": ""IRMOF-74-V-hex"", ""m.solvent"": """"}, {""m.refcode"": ""RAVWUI"", ""m.name"": ""IRMOF-74-VI"", ""m.solvent"": """"}, {""m.refcode"": ""RAVXAP"", ""m.name"": ""IRMOF-74-VII"", ""m.solvent"": """"}, {""m.refcode"": ""RAVXET"", ""m.name"": ""IRMOF-74-VI-oeg"", ""m.solvent"": """"}, {""m.refcode"": ""RAVXIX"", ""m.name"": ""IRMOF-74-IX"", ""m.solvent"": """"}, {""m.refcode"": ""RAVXOD"", ""m.name"": ""IRMOF-74-XI"", ""m.solvent"": """"}, {""m.refcode"": ""RUTPAY01"", ""m.name"": ""IRMOF-77"", ""m.solvent"": """"}, {""m.refcode"": ""WORKUL"", ""m.name"": ""INT-IRMOF-8-C"", ""m.solvent"": ""ethanol""}, {""m.refcode"": ""WORLAS"", ""m.name"": ""INT-IRMOF-8-B"", ""m.solvent"": ""N,N-dimethylformamide/ formic acid""}]"
"For a MOF named 'MOF-3', how many synthesis operation conditions exist?",MATCH (m:MOF)-[:has_publication]->(:Publication)<-[:has_publication]-(s:Synthesis_Procedure)-[:has_operation]->(o:Synthesis_Operation)-[:has_condition]->(c:Synthesis_Operation_Condition) WHERE m.name CONTAINS 'MOF-3' RETURN count(c),111,2,"[{""count(c)"": 14}]"
What is the name of the organic precursor used in the synthesis of MOF-3?,MATCH (m:MOF)-[:has_publication]->(:Publication)<-[:has_publication]-(s:Synthesis_Procedure)-[:has_organic_precursor]->(op:Synthesis_Organic_Precursor) WHERE m.name CONTAINS 'MOF-3' RETURN DISTINCT op.name,83,0,"[{""op.name"": ""adipic acid""}, {""op.name"": ""H4tcbpe""}]"
"What is the Topology name of the MOF having a Metal with the name ""Zn"" and a Crystal_System of ""tetragonal""?","MATCH (m:MOF)-[:has_metal]->(met: Metal {name: ""[Zn]""}), (m)-[:has_crystalSystem]->(cs:Crystal_System {name: ""tetragonal""}), (m)-[:has_topology]->(t:Topology) RETURN t.rcsr_code;",152,2,"[{""t.rcsr_code"": ""deh""}, {""t.rcsr_code"": ""UNKNOWN""}, {""t.rcsr_code"": ""ERROR""}, {""t.rcsr_code"": ""pts""}, {""t.rcsr_code"": ""tfi""}, {""t.rcsr_code"": ""sql""}, {""t.rcsr_code"": ""lig""}, {""t.rcsr_code"": ""dia""}, {""t.rcsr_code"": ""sql""}, {""t.rcsr_code"": ""ERROR""}, {""t.rcsr_code"": ""rtl""}, {""t.rcsr_code"": ""UNKNOWN""}, {""t.rcsr_code"": ""UNKNOWN""}, {""t.rcsr_code"": ""ERROR""}, {""t.rcsr_code"": ""dia""}, {""t.rcsr_code"": ""UNKNOWN""}, {""t.rcsr_code"": ""lvt""}, {""t.rcsr_code"": ""sql""}, {""t.rcsr_code"": ""dia""}, {""t.rcsr_code"": ""UNKNOWN""}, {""t.rcsr_code"": ""UNKNOWN""}, {""t.rcsr_code"": ""dia""}, {""t.rcsr_code"": ""gis""}, {""t.rcsr_code"": ""lvt""}, {""t.rcsr_code"": ""mer""}, {""t.rcsr_code"": ""UNKNOWN""}, {""t.rcsr_code"": ""ant""}, {""t.rcsr_code"": ""UNKNOWN""}, {""t.rcsr_code"": ""dia""}, {""t.rcsr_code"": ""lvt""}, {""t.rcsr_code"": ""pcb""}, {""t.rcsr_code"": ""dia""}, {""t.rcsr_code"": ""rtl""}, {""t.rcsr_code"": ""ERROR""}, {""t.rcsr_code"": ""UNKNOWN""}, {""t.rcsr_code"": ""rtl""}, {""t.rcsr_code"": ""UNKNOWN""}, {""t.rcsr_code"": ""UNKNOWN""}, {""t.rcsr_code"": ""dia""}, {""t.rcsr_code"": ""UNKNOWN""}, {""t.rcsr_code"": ""gis""}, {""t.rcsr_code"": ""utg""}, {""t.rcsr_code"": ""sql""}, {""t.rcsr_code"": ""UNKNOWN""}, {""t.rcsr_code"": ""dia""}, {""t.rcsr_code"": ""UNKNOWN""}, {""t.rcsr_code"": ""ERROR""}, {""t.rcsr_code"": ""pts""}, {""t.rcsr_code"": ""ant""}, {""t.rcsr_code"": ""gis""}, {""t.rcsr_code"": ""ERROR""}, {""t.rcsr_code"": ""pts""}, {""t.rcsr_code"": ""lig""}, {""t.rcsr_code"": ""pcb""}, {""t.rcsr_code"": ""UNKNOWN""}, {""t.rcsr_code"": ""UNKNOWN""}, {""t.rcsr_code"": ""ERROR""}, {""t.rcsr_code"": ""deh""}, {""t.rcsr_code"": ""dia""}, {""t.rcsr_code"": ""UNKNOWN""}, {""t.rcsr_code"": ""UNKNOWN""}, {""t.rcsr_code"": ""ERROR""}, {""t.rcsr_code"": ""ERROR""}, {""t.rcsr_code"": ""ERROR""}, {""t.rcsr_code"": ""UNKNOWN""}, {""t.rcsr_code"": ""rtl""}, {""t.rcsr_code"": ""pts""}, {""t.rcsr_code"": ""UNKNOWN""}, {""t.rcsr_code"": ""ERROR""}, {""t.rcsr_code"": ""sql""}, {""t.rcsr_code"": ""dmd""}, {""t.rcsr_code"": ""gis""}, {""t.rcsr_code"": ""srs""}, {""t.rcsr_code"": ""mot-e""}, {""t.rcsr_code"": ""mjb""}, {""t.rcsr_code"": ""UNKNOWN""}, {""t.rcsr_code"": ""gis""}, {""t.rcsr_code"": ""dia""}, {""t.rcsr_code"": ""ERROR""}, {""t.rcsr_code"": ""UNKNOWN""}, {""t.rcsr_code"": ""gis""}, {""t.rcsr_code"": ""ERROR""}, {""t.rcsr_code"": ""UNKNOWN""}, {""t.rcsr_code"": ""dia""}, {""t.rcsr_code"": ""ant""}, {""t.rcsr_code"": ""deh""}, {""t.rcsr_code"": ""rtl""}, {""t.rcsr_code"": ""UNKNOWN""}, {""t.rcsr_code"": ""UNKNOWN""}, {""t.rcsr_code"": ""UNKNOWN""}, {""t.rcsr_code"": ""UNKNOWN""}, {""t.rcsr_code"": ""UNKNOWN""}, {""t.rcsr_code"": ""ant""}, {""t.rcsr_code"": ""ERROR""}, {""t.rcsr_code"": ""UNKNOWN""}, {""t.rcsr_code"": ""UNKNOWN""}, {""t.rcsr_code"": ""pts""}, {""t.rcsr_code"": ""sod""}, {""t.rcsr_code"": ""ant""}, {""t.rcsr_code"": ""dia""}, {""t.rcsr_code"": ""ERROR""}, {""t.rcsr_code"": ""dia""}, {""t.rcsr_code"": ""UNKNOWN""}, {""t.rcsr_code"": ""zni""}, {""t.rcsr_code"": ""dia""}]"
In what way is the synthesis procedure for MOF-3 represented by a symbol?,MATCH (m:MOF)-[:has_publication]->(:Publication)<-[:has_publication]-(s:Synthesis_Procedure) WHERE m.name CONTAINS 'MOF-3' RETURN s.symbol,80,1,"[{""s.symbol"": ""[Pr2(C6H8O4)3(H2O)2]\u22c5C10H8N2""}, {""s.symbol"": """"}, {""s.symbol"": ""2""}, {""s.symbol"": ""1""}, {""s.symbol"": ""3""}]"
List the top 5 authors that have published the most number of MOFs.,"MATCH (mof:MOF)-[:has_publication]-(pub:Publication)-[:has_author]-(j:Author) RETURN j.name, count(j) as freq ORDER BY freq DESC LIMIT 5",63,0,"[{""j.name"": ""P.D.C.Dietzel"", ""freq"": 418}, {""j.name"": ""M.H.Rosnes"", ""freq"": 392}, {""j.name"": ""B.Pato-Doldan"", ""freq"": 380}, {""j.name"": ""Jian Zhang"", ""freq"": 231}, {""j.name"": ""Jie-Peng Zhang"", ""freq"": 146}]"
"Name the Topology of the MOF that contains a Metal named ""Cu"" and a Crystal_System of ""cubic"".","MATCH (m:MOF)-[:has_metal]->(met: Metal {name: ""[Cu]""}), (m)-[:has_crystalSystem]->(cs:Crystal_System {name: ""cubic""}), (m)-[:has_topology]->(t:Topology) RETURN t.rcsr_code;",155,1,"[{""t.rcsr_code"": ""TIMEOUT""}, {""t.rcsr_code"": ""ERROR""}, {""t.rcsr_code"": ""sod""}, {""t.rcsr_code"": ""fcu""}, {""t.rcsr_code"": ""TIMEOUT""}, {""t.rcsr_code"": ""rho""}, {""t.rcsr_code"": ""lcv""}, {""t.rcsr_code"": ""ctn""}, {""t.rcsr_code"": ""lcv""}, {""t.rcsr_code"": ""sod""}, {""t.rcsr_code"": ""UNKNOWN""}, {""t.rcsr_code"": ""utc""}, {""t.rcsr_code"": ""TIMEOUT""}, {""t.rcsr_code"": ""lcv-f""}, {""t.rcsr_code"": ""gar""}, {""t.rcsr_code"": ""ERROR""}, {""t.rcsr_code"": ""TIMEOUT""}, {""t.rcsr_code"": ""met""}, {""t.rcsr_code"": ""TIMEOUT""}, {""t.rcsr_code"": ""the""}, {""t.rcsr_code"": ""met""}, {""t.rcsr_code"": ""nbo""}, {""t.rcsr_code"": ""TIMEOUT""}, {""t.rcsr_code"": ""UNKNOWN""}]"
What is the SMILES notation for the organic precursor employed in the synthesis of HKUST-1?,MATCH (s:Synthesis_Procedure)-[:has_publication]->(:Publication)<-[:has_publication]-(m:MOF) MATCH (s)-[:has_organic_precursor]->(mp:Synthesis_Organic_Precursor) WHERE m.name CONTAINS 'HKUST-1' RETURN mp.smiles,103,3,"[{""mp.smiles"": ""O=C(O)c1cc(C(=O)O)cc(C(=O)O)c1""}, {""mp.smiles"": ""O=C(O)c1cc(C(=O)O)cc(C(=O)O)c1""}]"
What MOF has the greatest count of distinct organic linkers utilized in its synthesis?,"MATCH (m1:MOF)-[:has_organicLinker]->(ol1:Organic_Linker) RETURN COUNT(m1), ol1.name ORDER BY count(m1) DESC LIMIT 1",149,1,"[{""COUNT(m1)"": 510, ""ol1.name"": ""[O-]C(=O)c1cc([O])c(cc1[O])C(=O)[O-]""}]"
List the top 5 families that most of the MOFs belong to.,"MATCH (m:MOF)-[r:has_family]->(c:Family) RETURN c.name, count(c) as freq ORDER BY freq DESC LIMIT 5",66,0,"[{""c.name"": ""Zn-oxide/zinc oxide"", ""freq"": 1012}, {""c.name"": ""MOF-74/CPO-27"", ""freq"": 507}, {""c.name"": ""Cu-Cu paddleWheels/HKUST-1"", ""freq"": 218}, {""c.name"": ""Zn-oxide/zinc oxide, IRMOF"", ""freq"": 168}, {""c.name"": ""Zr-oxide/zirconium oxide/UiO-66"", ""freq"": 136}]"
What is the numerical value and unit of the key parameter used in the production of HKUST-1?,"MATCH (s:Synthesis_Procedure)-[:has_publication]->(:Publication)<-[:has_publication]-(m:MOF) MATCH (s)-[:has_property]->(sp:Synthesis_Property) WHERE m.name CONTAINS 'MOF-5' RETURN sp.value, sp.unit",108,1,"[{""sp.value"": ""86"", ""sp.unit"": ""%1.0""}, {""sp.value"": ""60"", ""sp.unit"": ""%1.0""}, {""sp.value"": ""60"", ""sp.unit"": ""%1.0""}, {""sp.value"": ""60"", ""sp.unit"": ""%1.0""}, {""sp.value"": ""60"", ""sp.unit"": ""%1.0""}, {""sp.value"": ""81"", ""sp.unit"": ""%1.0""}, {""sp.value"": ""77"", ""sp.unit"": ""%1.0""}, {""sp.value"": ""83"", ""sp.unit"": ""%1.0""}, {""sp.value"": ""74"", ""sp.unit"": ""%1.0""}, {""sp.value"": ""65"", ""sp.unit"": ""%1.0""}, {""sp.value"": ""64"", ""sp.unit"": ""%1.0""}]"
Which symbol is utilized to represent the synthesis procedure for MOF-3?,MATCH (m:MOF)-[:has_publication]->(:Publication)<-[:has_publication]-(s:Synthesis_Procedure) WHERE m.name CONTAINS 'MOF-3' RETURN s.symbol,80,3,"[{""s.symbol"": ""[Pr2(C6H8O4)3(H2O)2]\u22c5C10H8N2""}, {""s.symbol"": """"}, {""s.symbol"": ""2""}, {""s.symbol"": ""1""}, {""s.symbol"": ""3""}]"
List the number of publications in each year.,"MATCH (p:Publication) RETURN p.year, COUNT(p) AS num_publications ORDER BY p.year",58,0,"[{""p.year"": 1959, ""num_publications"": 1}, {""p.year"": 1968, ""num_publications"": 1}, {""p.year"": 1974, ""num_publications"": 1}, {""p.year"": 1978, ""num_publications"": 1}, {""p.year"": 1980, ""num_publications"": 1}, {""p.year"": 1981, ""num_publications"": 1}, {""p.year"": 1982, ""num_publications"": 2}, {""p.year"": 1983, ""num_publications"": 1}, {""p.year"": 1984, ""num_publications"": 3}, {""p.year"": 1985, ""num_publications"": 2}, {""p.year"": 1986, ""num_publications"": 2}, {""p.year"": 1988, ""num_publications"": 3}, {""p.year"": 1989, ""num_publications"": 2}, {""p.year"": 1990, ""num_publications"": 2}, {""p.year"": 1991, ""num_publications"": 3}, {""p.year"": 1992, ""num_publications"": 3}, {""p.year"": 1994, ""num_publications"": 4}, {""p.year"": 1995, ""num_publications"": 1}, {""p.year"": 1996, ""num_publications"": 9}, {""p.year"": 1997, ""num_publications"": 11}, {""p.year"": 1998, ""num_publications"": 14}, {""p.year"": 1999, ""num_publications"": 20}, {""p.year"": 2000, ""num_publications"": 24}, {""p.year"": 2001, ""num_publications"": 40}, {""p.year"": 2002, ""num_publications"": 48}, {""p.year"": 2003, ""num_publications"": 49}, {""p.year"": 2004, ""num_publications"": 68}, {""p.year"": 2005, ""num_publications"": 99}, {""p.year"": 2006, ""num_publications"": 119}, {""p.year"": 2007, ""num_publications"": 138}, {""p.year"": 2008, ""num_publications"": 182}, {""p.year"": 2009, ""num_publications"": 205}, {""p.year"": 2010, ""num_publications"": 272}, {""p.year"": 2011, ""num_publications"": 316}, {""p.year"": 2012, ""num_publications"": 412}, {""p.year"": 2013, ""num_publications"": 411}, {""p.year"": 2014, ""num_publications"": 460}, {""p.year"": 2015, ""num_publications"": 514}, {""p.year"": 2016, ""num_publications"": 484}, {""p.year"": 2017, ""num_publications"": 458}, {""p.year"": 2018, ""num_publications"": 481}, {""p.year"": 2019, ""num_publications"": 491}, {""p.year"": 2020, ""num_publications"": 318}, {""p.year"": 2021, ""num_publications"": 6}]"
How many MOFs in the family 'Zn-oxide'?,MATCH (m:MOF)-[:has_family]->(f:Family {name:'Zn-oxide/zinc oxide'}) RETURN count(m.refcode),3,0,"[{""count(m.refcode)"": 1012}]"
Which paper reports the greatest number of MOFs?,"MATCH (m:MOF)-[:has_publication]-(p:Publication) RETURN count(m), p.doi ORDER BY count(m) DESC LIMIT 1",142,2,"[{""count(m)"": 379, ""p.doi"": ""10.1002/cssc.201601752""}]"
"Name the Topology associated with the MOF having a Metal named ""Zn"" and a Crystal_System of ""tetragonal"".","MATCH (m:MOF)-[:has_metal]->(met: Metal {name: ""[Zn]""}), (m)-[:has_crystalSystem]->(cs:Crystal_System {name: ""tetragonal""}), (m)-[:has_topology]->(t:Topology) RETURN t.rcsr_code;",152,3,"[{""t.rcsr_code"": ""deh""}, {""t.rcsr_code"": ""UNKNOWN""}, {""t.rcsr_code"": ""ERROR""}, {""t.rcsr_code"": ""pts""}, {""t.rcsr_code"": ""tfi""}, {""t.rcsr_code"": ""sql""}, {""t.rcsr_code"": ""lig""}, {""t.rcsr_code"": ""dia""}, {""t.rcsr_code"": ""sql""}, {""t.rcsr_code"": ""ERROR""}, {""t.rcsr_code"": ""rtl""}, {""t.rcsr_code"": ""UNKNOWN""}, {""t.rcsr_code"": ""UNKNOWN""}, {""t.rcsr_code"": ""ERROR""}, {""t.rcsr_code"": ""dia""}, {""t.rcsr_code"": ""UNKNOWN""}, {""t.rcsr_code"": ""lvt""}, {""t.rcsr_code"": ""sql""}, {""t.rcsr_code"": ""dia""}, {""t.rcsr_code"": ""UNKNOWN""}, {""t.rcsr_code"": ""UNKNOWN""}, {""t.rcsr_code"": ""dia""}, {""t.rcsr_code"": ""gis""}, {""t.rcsr_code"": ""lvt""}, {""t.rcsr_code"": ""mer""}, {""t.rcsr_code"": ""UNKNOWN""}, {""t.rcsr_code"": ""ant""}, {""t.rcsr_code"": ""UNKNOWN""}, {""t.rcsr_code"": ""dia""}, {""t.rcsr_code"": ""lvt""}, {""t.rcsr_code"": ""pcb""}, {""t.rcsr_code"": ""dia""}, {""t.rcsr_code"": ""rtl""}, {""t.rcsr_code"": ""ERROR""}, {""t.rcsr_code"": ""UNKNOWN""}, {""t.rcsr_code"": ""rtl""}, {""t.rcsr_code"": ""UNKNOWN""}, {""t.rcsr_code"": ""UNKNOWN""}, {""t.rcsr_code"": ""dia""}, {""t.rcsr_code"": ""UNKNOWN""}, {""t.rcsr_code"": ""gis""}, {""t.rcsr_code"": ""utg""}, {""t.rcsr_code"": ""sql""}, {""t.rcsr_code"": ""UNKNOWN""}, {""t.rcsr_code"": ""dia""}, {""t.rcsr_code"": ""UNKNOWN""}, {""t.rcsr_code"": ""ERROR""}, {""t.rcsr_code"": ""pts""}, {""t.rcsr_code"": ""ant""}, {""t.rcsr_code"": ""gis""}, {""t.rcsr_code"": ""ERROR""}, {""t.rcsr_code"": ""pts""}, {""t.rcsr_code"": ""lig""}, {""t.rcsr_code"": ""pcb""}, {""t.rcsr_code"": ""UNKNOWN""}, {""t.rcsr_code"": ""UNKNOWN""}, {""t.rcsr_code"": ""ERROR""}, {""t.rcsr_code"": ""deh""}, {""t.rcsr_code"": ""dia""}, {""t.rcsr_code"": ""UNKNOWN""}, {""t.rcsr_code"": ""UNKNOWN""}, {""t.rcsr_code"": ""ERROR""}, {""t.rcsr_code"": ""ERROR""}, {""t.rcsr_code"": ""ERROR""}, {""t.rcsr_code"": ""UNKNOWN""}, {""t.rcsr_code"": ""rtl""}, {""t.rcsr_code"": ""pts""}, {""t.rcsr_code"": ""UNKNOWN""}, {""t.rcsr_code"": ""ERROR""}, {""t.rcsr_code"": ""sql""}, {""t.rcsr_code"": ""dmd""}, {""t.rcsr_code"": ""gis""}, {""t.rcsr_code"": ""srs""}, {""t.rcsr_code"": ""mot-e""}, {""t.rcsr_code"": ""mjb""}, {""t.rcsr_code"": ""UNKNOWN""}, {""t.rcsr_code"": ""gis""}, {""t.rcsr_code"": ""dia""}, {""t.rcsr_code"": ""ERROR""}, {""t.rcsr_code"": ""UNKNOWN""}, {""t.rcsr_code"": ""gis""}, {""t.rcsr_code"": ""ERROR""}, {""t.rcsr_code"": ""UNKNOWN""}, {""t.rcsr_code"": ""dia""}, {""t.rcsr_code"": ""ant""}, {""t.rcsr_code"": ""deh""}, {""t.rcsr_code"": ""rtl""}, {""t.rcsr_code"": ""UNKNOWN""}, {""t.rcsr_code"": ""UNKNOWN""}, {""t.rcsr_code"": ""UNKNOWN""}, {""t.rcsr_code"": ""UNKNOWN""}, {""t.rcsr_code"": ""UNKNOWN""}, {""t.rcsr_code"": ""ant""}, {""t.rcsr_code"": ""ERROR""}, {""t.rcsr_code"": ""UNKNOWN""}, {""t.rcsr_code"": ""UNKNOWN""}, {""t.rcsr_code"": ""pts""}, {""t.rcsr_code"": ""sod""}, {""t.rcsr_code"": ""ant""}, {""t.rcsr_code"": ""dia""}, {""t.rcsr_code"": ""ERROR""}, {""t.rcsr_code"": ""dia""}, {""t.rcsr_code"": ""UNKNOWN""}, {""t.rcsr_code"": ""zni""}, {""t.rcsr_code"": ""dia""}]"
List the value of the property in the synthesis of MOF-3.,"MATCH (m:MOF)-[:has_publication]->(:Publication)<-[:has_publication]-(s:Synthesis_Procedure)-[:has_property]->(sp:Synthesis_Property) WHERE m.name CONTAINS 'MOF-3' RETURN sp.value, sp.unit",91,3,"[{""sp.value"": ""25"", ""sp.unit"": ""%1.0""}, {""sp.value"": ""4.99"", ""sp.unit"": ""%1.0""}, {""sp.value"": ""53"", ""sp.unit"": ""%1.0""}, {""sp.value"": ""57"", ""sp.unit"": ""%1.0""}, {""sp.value"": ""46"", ""sp.unit"": ""%1.0""}]"
What is the length of the c-axis of the unit cell of the MOFs 'HKUST-1'?,"MATCH (m:MOF) WHERE m.name CONTAINS 'HKUST-1' RETURN m.refcode, m.name, m.cell_lengths",44,0,"[{""m.refcode"": ""DOTSOV42"", ""m.name"": ""HKUST-1"", ""m.cell_lengths"": ""CellLengths(a=26.287910000000004, b=26.287910000000004, c=26.287910000000004)""}, {""m.refcode"": ""FIQCEN"", ""m.name"": ""HKUST-1|Teaching Subset: MOFs"", ""m.cell_lengths"": ""CellLengths(a=26.343, b=26.343, c=26.343)""}, {""m.refcode"": ""FUNGAZ"", ""m.name"": ""HKUST-1 (as synthesised)"", ""m.cell_lengths"": ""CellLengths(a=26.3518, b=26.3518, c=26.3518)""}, {""m.refcode"": ""LUDLED"", ""m.name"": ""HKUST-1"", ""m.cell_lengths"": ""CellLengths(a=26.315, b=26.315, c=26.315)""}, {""m.refcode"": ""WULJUJ"", ""m.name"": ""HKUST-1 0.56(dideuteroacetylene)"", ""m.cell_lengths"": ""CellLengths(a=26.3256, b=26.3256, c=26.3256)""}]"
Can you tell me the names of the databases that provided MOFs 'IRMOF'?,"MATCH (m:MOF) WHERE m.name CONTAINS 'IRMOF' RETURN m.refcode, m.name, m.database_name",21,1,"[{""m.refcode"": ""GINYAG"", ""m.name"": ""Ni-IRMOF-74-II"", ""m.database_name"": ""as543be_ASER""}, {""m.refcode"": ""GINYIO"", ""m.name"": ""Ni-IRMOF-74-III"", ""m.database_name"": ""as543be_ASER""}, {""m.refcode"": ""GINYOU"", ""m.name"": ""Ni-IRMOF-74-IV"", ""m.database_name"": ""as543be_ASER""}, {""m.refcode"": ""GINYUA"", ""m.name"": ""Ni-IRMOF-74-V"", ""m.database_name"": ""as543be_ASER""}, {""m.refcode"": ""HOLQAC"", ""m.name"": ""\u03b1-IRMOF-3-AMPh"", ""m.database_name"": ""as543be_ASER""}, {""m.refcode"": ""NODTEH"", ""m.name"": ""IRMOF-23terp"", ""m.database_name"": ""as543be_ASER""}, {""m.refcode"": ""NODTIL"", ""m.name"": ""IRMOF-25terPh"", ""m.database_name"": ""as543be_ASER""}, {""m.refcode"": ""NODTOR"", ""m.name"": ""IRMOF-pentane"", ""m.database_name"": ""as543be_ASER""}, {""m.refcode"": ""NUVYEK"", ""m.name"": ""IRMOF-61"", ""m.database_name"": ""as543be_ASER""}, {""m.refcode"": ""NUVYIO"", ""m.name"": ""IRMOF-62"", ""m.database_name"": ""as543be_ASER""}, {""m.refcode"": ""PIWLIT"", ""m.name"": ""IRMOF-9"", ""m.database_name"": ""as543be_ASER""}, {""m.refcode"": ""RAVVUH"", ""m.name"": ""IRMOF-74-II"", ""m.database_name"": ""as543be_ASER""}, {""m.refcode"": ""RAVWAO"", ""m.name"": ""IRMOF-74-III"", ""m.database_name"": ""as543be_ASER""}, {""m.refcode"": ""RAVWES"", ""m.name"": ""IRMOF-74-IV"", ""m.database_name"": ""as543be_ASER""}, {""m.refcode"": ""RAVWOC"", ""m.name"": ""IRMOF-74-V-hex"", ""m.database_name"": ""as543be_ASER""}, {""m.refcode"": ""RAVWUI"", ""m.name"": ""IRMOF-74-VI"", ""m.database_name"": ""as543be_ASER""}, {""m.refcode"": ""RAVXAP"", ""m.name"": ""IRMOF-74-VII"", ""m.database_name"": ""as543be_ASER""}, {""m.refcode"": ""RAVXET"", ""m.name"": ""IRMOF-74-VI-oeg"", ""m.database_name"": ""as543be_ASER""}, {""m.refcode"": ""RAVXIX"", ""m.name"": ""IRMOF-74-IX"", ""m.database_name"": ""as543be_ASER""}, {""m.refcode"": ""RAVXOD"", ""m.name"": ""IRMOF-74-XI"", ""m.database_name"": ""as543be_ASER""}, {""m.refcode"": ""RUTPAY01"", ""m.name"": ""IRMOF-77"", ""m.database_name"": ""as543be_ASER""}, {""m.refcode"": ""WORKUL"", ""m.name"": ""INT-IRMOF-8-C"", ""m.database_name"": ""as543be_ASER""}, {""m.refcode"": ""WORLAS"", ""m.name"": ""INT-IRMOF-8-B"", ""m.database_name"": ""as543be_ASER""}]"
Give me the recrystallization solvents for MOF 'IRMOF'.,"MATCH (m:MOF) WHERE m.name CONTAINS 'IRMOF' RETURN m.refcode, m.name, m.solvent",13,3,"[{""m.refcode"": ""GINYAG"", ""m.name"": ""Ni-IRMOF-74-II"", ""m.solvent"": """"}, {""m.refcode"": ""GINYIO"", ""m.name"": ""Ni-IRMOF-74-III"", ""m.solvent"": """"}, {""m.refcode"": ""GINYOU"", ""m.name"": ""Ni-IRMOF-74-IV"", ""m.solvent"": """"}, {""m.refcode"": ""GINYUA"", ""m.name"": ""Ni-IRMOF-74-V"", ""m.solvent"": """"}, {""m.refcode"": ""HOLQAC"", ""m.name"": ""\u03b1-IRMOF-3-AMPh"", ""m.solvent"": """"}, {""m.refcode"": ""NODTEH"", ""m.name"": ""IRMOF-23terp"", ""m.solvent"": """"}, {""m.refcode"": ""NODTIL"", ""m.name"": ""IRMOF-25terPh"", ""m.solvent"": """"}, {""m.refcode"": ""NODTOR"", ""m.name"": ""IRMOF-pentane"", ""m.solvent"": """"}, {""m.refcode"": ""NUVYEK"", ""m.name"": ""IRMOF-61"", ""m.solvent"": """"}, {""m.refcode"": ""NUVYIO"", ""m.name"": ""IRMOF-62"", ""m.solvent"": """"}, {""m.refcode"": ""PIWLIT"", ""m.name"": ""IRMOF-9"", ""m.solvent"": """"}, {""m.refcode"": ""RAVVUH"", ""m.name"": ""IRMOF-74-II"", ""m.solvent"": """"}, {""m.refcode"": ""RAVWAO"", ""m.name"": ""IRMOF-74-III"", ""m.solvent"": """"}, {""m.refcode"": ""RAVWES"", ""m.name"": ""IRMOF-74-IV"", ""m.solvent"": """"}, {""m.refcode"": ""RAVWOC"", ""m.name"": ""IRMOF-74-V-hex"", ""m.solvent"": """"}, {""m.refcode"": ""RAVWUI"", ""m.name"": ""IRMOF-74-VI"", ""m.solvent"": """"}, {""m.refcode"": ""RAVXAP"", ""m.name"": ""IRMOF-74-VII"", ""m.solvent"": """"}, {""m.refcode"": ""RAVXET"", ""m.name"": ""IRMOF-74-VI-oeg"", ""m.solvent"": """"}, {""m.refcode"": ""RAVXIX"", ""m.name"": ""IRMOF-74-IX"", ""m.solvent"": """"}, {""m.refcode"": ""RAVXOD"", ""m.name"": ""IRMOF-74-XI"", ""m.solvent"": """"}, {""m.refcode"": ""RUTPAY01"", ""m.name"": ""IRMOF-77"", ""m.solvent"": """"}, {""m.refcode"": ""WORKUL"", ""m.name"": ""INT-IRMOF-8-C"", ""m.solvent"": ""ethanol""}, {""m.refcode"": ""WORLAS"", ""m.name"": ""INT-IRMOF-8-B"", ""m.solvent"": ""N,N-dimethylformamide/ formic acid""}]"
What is the name of the paper that introduced MOF-5?,MATCH (m:MOF {name:'MOF-5'})-[r:has_publication]->(c:Publication)-[:has_title]-(t:Title) RETURN DISTINCT t.title,75,2,"[{""t.title"": ""Elucidating Negative Thermal Expansion in MOF-5 Elucidating NTE in MOF-5""}]"
What is the identifier assigned to MOF-3 in the MOF database?,MATCH (m:MOF) WHERE m.name CONTAINS 'MOF-3' RETURN m.refcode,77,3,"[{""m.refcode"": ""CEFNOT""}, {""m.refcode"": ""FAYPIG""}, {""m.refcode"": ""FEYQIK""}, {""m.refcode"": ""HOLQAC""}, {""m.refcode"": ""KITVEQ""}, {""m.refcode"": ""LAJKUE""}, {""m.refcode"": ""MIFGEQ""}, {""m.refcode"": ""PIKYAM""}]"
What metal has the highest frequency of use in MOF synthesis?,"MATCH (m:MOF)-[r:has_metal]->(c:Metal) RETURN c.name, count(c) as freq ORDER BY freq DESC LIMIT 1",67,3,"[{""c.name"": ""[Zn]"", ""freq"": 1179}]"
What is the makeup of the solvent used in the synthesis of MOF-3?,"MATCH (m:MOF)-[:has_publication]->(:Publication)<-[:has_publication]-(s:Synthesis_Procedure)-[:has_solvent_precursor]->(sp:Synthesis_Solvent_Precursor)-[:has_composition]->(sc:Solvent_Composition) WHERE m.name CONTAINS 'MOF-3' RETURN DISTINCT sc.comp_id, sc.unit, sc.order, sc.value",86,3,"[{""sc.comp_id"": ""MIsyn11347_sprec0_comp0"", ""sc.unit"": ""mL1.0"", ""sc.order"": 0, ""sc.value"": 1.0}, {""sc.comp_id"": ""MIsyn11347_sprec2_comp0"", ""sc.unit"": ""mL1.0"", ""sc.order"": 0, ""sc.value"": 0.5}, {""sc.comp_id"": ""MIsyn11346_sprec3_comp0"", ""sc.unit"": ""mL1.0"", ""sc.order"": 0, ""sc.value"": 0.5}, {""sc.comp_id"": ""MIsyn11346_sprec1_comp0"", ""sc.unit"": ""mL1.0"", ""sc.order"": 0, ""sc.value"": 1.0}, {""sc.comp_id"": ""MIsyn11348_sprec0_comp0"", ""sc.unit"": ""mL1.0"", ""sc.order"": 0, ""sc.value"": 2.0}, {""sc.comp_id"": ""MIsyn11348_sprec1_comp0"", ""sc.unit"": ""mL1.0"", ""sc.order"": 0, ""sc.value"": 1.0}, {""sc.comp_id"": ""MIsyn11348_sprec2_comp1"", ""sc.unit"": ""mol1.0L-1.0"", ""sc.order"": 1, ""sc.value"": 6.0}, {""sc.comp_id"": ""MIsyn11348_sprec2_comp0"", ""sc.unit"": ""mL1.0"", ""sc.order"": 0, ""sc.value"": 0.5}]"
Which is the most abundant atom present in all MOFs?,"MATCH (n:Atom) WITH n.name AS name, count(*) as freq ORDER BY freq LIMIT 1 RETURN name",56,2,"[{""name"": ""Atom(Co1)""}]"
What is the name of the initial research article about MOF-5?,MATCH (:MOF {name: 'MOF-5'})-[:has_publication]->(p:Publication)-[:has_title]-(t:Title) RETURN t.title ORDER BY p.year ASC LIMIT 1,131,1,"[{""t.title"": ""Elucidating Negative Thermal Expansion in MOF-5 Elucidating NTE in MOF-5""}]"
What is the quantity of MOFs that fall into the 'Zn-oxide' family?,MATCH (m:MOF)-[:has_family]->(f:Family {name:'Zn-oxide/zinc oxide'}) RETURN count(m.refcode),3,3,"[{""count(m.refcode)"": 1012}]"
What is the predominant family of MOFs?,"MATCH (m:MOF)-[r:has_family]->(c:Family) RETURN c.name, count(c) as freq ORDER BY freq DESC LIMIT 1",65,2,"[{""c.name"": ""Zn-oxide/zinc oxide"", ""freq"": 1012}]"
Identify the MOF with the highest number of Authors associated with its publications.,"MATCH (m:MOF)-[:has_publication]->(p:Publication)-[:has_author]->(a:Author) WITH m, count(distinct a) as numAuth RETURN m.refcode, numAuth ORDER BY numAuth DESC LIMIT 1;",158,1,"[{""m.refcode"": ""JOYKUF"", ""numAuth"": 26}]"
Which MOFs in the database have documented melting points?,"MATCH (m:MOF)  WHERE m.melting_point <> """" RETURN m.refcode, m.name, m.melting_point",10,2,"[{""m.refcode"": ""CEHKUW"", ""m.name"": """", ""m.melting_point"": ""decomposes from about 330 deg.C""}, {""m.refcode"": ""DALCEZ"", ""m.name"": """", ""m.melting_point"": ""170 deg.C(dec.)""}, {""m.refcode"": ""EJOGOZ"", ""m.name"": """", ""m.melting_point"": ""above 270 deg.C""}, {""m.refcode"": ""FIVYUF"", ""m.name"": """", ""m.melting_point"": ""578-580 K""}, {""m.refcode"": ""GERPUP"", ""m.name"": """", ""m.melting_point"": ""decomposes at 216 deg.C""}, {""m.refcode"": ""HEBZAR"", ""m.name"": """", ""m.melting_point"": ""above 650 K""}, {""m.refcode"": ""HEBZEV"", ""m.name"": """", ""m.melting_point"": ""above 650 K""}, {""m.refcode"": ""HONBES"", ""m.name"": """", ""m.melting_point"": ""decomposes above 300 deg.C""}, {""m.refcode"": ""INOVEN"", ""m.name"": """", ""m.melting_point"": ""above 300 deg.C""}, {""m.refcode"": ""KEVLEE"", ""m.name"": """", ""m.melting_point"": ""683 K decomp.""}, {""m.refcode"": ""MUKRIU"", ""m.name"": """", ""m.melting_point"": ""293deg.C(dec)""}, {""m.refcode"": ""MUWQEB"", ""m.name"": """", ""m.melting_point"": ""above 500 K""}, {""m.refcode"": ""NIMKAW"", ""m.name"": """", ""m.melting_point"": ""183-185 deg.C (dec.)""}, {""m.refcode"": ""NOBQEB"", ""m.name"": """", ""m.melting_point"": ""decomposes above 40 deg.C""}, {""m.refcode"": ""OHIQEE"", ""m.name"": """", ""m.melting_point"": ""above 523 K""}, {""m.refcode"": ""OHUKIM"", ""m.name"": """", ""m.melting_point"": ""above 500 K""}, {""m.refcode"": ""OPESOS"", ""m.name"": """", ""m.melting_point"": ""517.15 K""}, {""m.refcode"": ""OXEVOE"", ""m.name"": """", ""m.melting_point"": ""253.8-254.6 deg.C""}, {""m.refcode"": ""QAYTEP"", ""m.name"": """", ""m.melting_point"": ""232-234deg.C""}, {""m.refcode"": ""QEPBEV"", ""m.name"": """", ""m.melting_point"": ""447 K""}, {""m.refcode"": ""SAHDAH"", ""m.name"": """", ""m.melting_point"": ""282deg.C""}, {""m.refcode"": ""TIPRIT01"", ""m.name"": """", ""m.melting_point"": ""493K(dec.)""}, {""m.refcode"": ""TISGUY"", ""m.name"": """", ""m.melting_point"": ""above 220 deg.C""}, {""m.refcode"": ""WEZCIO"", ""m.name"": """", ""m.melting_point"": ""Decomposes at 280 deg.C""}, {""m.refcode"": ""XESCOO"", ""m.name"": """", ""m.melting_point"": ""232deg.C(dec.)""}, {""m.refcode"": ""XEVXUT"", ""m.name"": """", ""m.melting_point"": ""408 K""}, {""m.refcode"": ""XICDUI"", ""m.name"": ""catena-((\u03bc4-letrozole)-copper(i) tetrafluoroborate chloroform solvate)"", ""m.melting_point"": ""decomposes above 250 deg.C""}, {""m.refcode"": ""XIHRIQ"", ""m.name"": """", ""m.melting_point"": ""236-238 deg.C (dec.)""}, {""m.refcode"": ""XODBOI"", ""m.name"": """", ""m.melting_point"": ""254-255 deg.C(dec.)""}, {""m.refcode"": ""ZUBKEO"", ""m.name"": """", ""m.melting_point"": ""593 K""}]"
Which duration is required for the synthesis of MOF-3?,"MATCH (m:MOF)-[:has_publication]->(:Publication)<-[:has_publication]-(s:Synthesis_Procedure)-[:has_time]->(st:Synthesis_Time) WHERE m.name CONTAINS 'MOF-3' RETURN st.Value, st.Unit",89,2,"[{""st.Value"": ""72"", ""st.Unit"": ""h1.0""}, {""st.Value"": ""72"", ""st.Unit"": ""h1.0""}, {""st.Value"": ""48.0"", ""st.Unit"": ""h1.0""}, {""st.Value"": ""48.0"", ""st.Unit"": ""h1.0""}, {""st.Value"": ""48.0"", ""st.Unit"": ""h1.0""}]"
Can you identify the RCSR code corresponding to the predominant MOF topology?,"MATCH (m:MOF)-[r:has_topology]->(c:Topology) RETURN c.rcsr_code, count(c) as freq ORDER BY freq DESC LIMIT 1",71,2,"[{""c.rcsr_code"": ""UNKNOWN"", ""freq"": 2960}]"
Can you provide a list of MOFs that have their melting points listed in the database?,"MATCH (m:MOF)  WHERE m.melting_point <> """" RETURN m.refcode, m.name, m.melting_point",10,3,"[{""m.refcode"": ""CEHKUW"", ""m.name"": """", ""m.melting_point"": ""decomposes from about 330 deg.C""}, {""m.refcode"": ""DALCEZ"", ""m.name"": """", ""m.melting_point"": ""170 deg.C(dec.)""}, {""m.refcode"": ""EJOGOZ"", ""m.name"": """", ""m.melting_point"": ""above 270 deg.C""}, {""m.refcode"": ""FIVYUF"", ""m.name"": """", ""m.melting_point"": ""578-580 K""}, {""m.refcode"": ""GERPUP"", ""m.name"": """", ""m.melting_point"": ""decomposes at 216 deg.C""}, {""m.refcode"": ""HEBZAR"", ""m.name"": """", ""m.melting_point"": ""above 650 K""}, {""m.refcode"": ""HEBZEV"", ""m.name"": """", ""m.melting_point"": ""above 650 K""}, {""m.refcode"": ""HONBES"", ""m.name"": """", ""m.melting_point"": ""decomposes above 300 deg.C""}, {""m.refcode"": ""INOVEN"", ""m.name"": """", ""m.melting_point"": ""above 300 deg.C""}, {""m.refcode"": ""KEVLEE"", ""m.name"": """", ""m.melting_point"": ""683 K decomp.""}, {""m.refcode"": ""MUKRIU"", ""m.name"": """", ""m.melting_point"": ""293deg.C(dec)""}, {""m.refcode"": ""MUWQEB"", ""m.name"": """", ""m.melting_point"": ""above 500 K""}, {""m.refcode"": ""NIMKAW"", ""m.name"": """", ""m.melting_point"": ""183-185 deg.C (dec.)""}, {""m.refcode"": ""NOBQEB"", ""m.name"": """", ""m.melting_point"": ""decomposes above 40 deg.C""}, {""m.refcode"": ""OHIQEE"", ""m.name"": """", ""m.melting_point"": ""above 523 K""}, {""m.refcode"": ""OHUKIM"", ""m.name"": """", ""m.melting_point"": ""above 500 K""}, {""m.refcode"": ""OPESOS"", ""m.name"": """", ""m.melting_point"": ""517.15 K""}, {""m.refcode"": ""OXEVOE"", ""m.name"": """", ""m.melting_point"": ""253.8-254.6 deg.C""}, {""m.refcode"": ""QAYTEP"", ""m.name"": """", ""m.melting_point"": ""232-234deg.C""}, {""m.refcode"": ""QEPBEV"", ""m.name"": """", ""m.melting_point"": ""447 K""}, {""m.refcode"": ""SAHDAH"", ""m.name"": """", ""m.melting_point"": ""282deg.C""}, {""m.refcode"": ""TIPRIT01"", ""m.name"": """", ""m.melting_point"": ""493K(dec.)""}, {""m.refcode"": ""TISGUY"", ""m.name"": """", ""m.melting_point"": ""above 220 deg.C""}, {""m.refcode"": ""WEZCIO"", ""m.name"": """", ""m.melting_point"": ""Decomposes at 280 deg.C""}, {""m.refcode"": ""XESCOO"", ""m.name"": """", ""m.melting_point"": ""232deg.C(dec.)""}, {""m.refcode"": ""XEVXUT"", ""m.name"": """", ""m.melting_point"": ""408 K""}, {""m.refcode"": ""XICDUI"", ""m.name"": ""catena-((\u03bc4-letrozole)-copper(i) tetrafluoroborate chloroform solvate)"", ""m.melting_point"": ""decomposes above 250 deg.C""}, {""m.refcode"": ""XIHRIQ"", ""m.name"": """", ""m.melting_point"": ""236-238 deg.C (dec.)""}, {""m.refcode"": ""XODBOI"", ""m.name"": """", ""m.melting_point"": ""254-255 deg.C(dec.)""}, {""m.refcode"": ""ZUBKEO"", ""m.name"": """", ""m.melting_point"": ""593 K""}]"
